{"name":"bismark","description":"Bisulfite Mapper and Methylation Caller","usage":"bismark [options] <genome_folder> {-1 <mates1> -2 <mates2> | <singles>}","options":[{"names":["-1"],"argument":"<files>","description":"Comma-separated list of files containing the #1 mates (filename usually includes   \"_1\"), e.g. flyA_1.fq,flyB_1.fq). Sequences specified with this option must correspond file-for-file and read-for-read with those specified in <mates2>. Reads may be a mix of different lengths. Bismark will produce one mapping result and one report file per paired-end input file pair."},{"names":["-2"],"argument":"<files>","description":"Comma-separated list of files containing the #2 mates (filename usually includes   \"_2\"), e.g. flyA_2.fq,flyB_2.fq). Sequences specified with this option must correspond file-for-file and read-for-read with those specified in <mates1>. Reads may be a mix of different lengths."},{"names":["--se","--single_end"],"argument":"<list>","description":"Sets single-end mapping mode explicitly giving a list of file names as <list>. The filenames may be provided as a comma [,] or colon [:] separated list."},{"names":["-q","--fastq"],"argument":"","description":"The query input files (specified as <mate1>,<mate2> or <singles> are FASTQ files (usually having extension .fg or .fastq). This is the default. See also--solexa-quals."},{"names":["-f","--fasta"],"argument":"","description":"The query input files (specified as <mate1>,<mate2> or <singles> are FASTA files (usually having extensions .fa, .mfa, .fna or similar). All quality values are assumed to be 40 on the Phred scale. FASTA files are expected to contain both the read name and the sequence on a single line (and not spread over several lines)."},{"names":["-s","--skip"],"argument":"<int>","description":"Skip (i.e. do not align) the first <int> reads or read pairs from the input."},{"names":["-u","--upto"],"argument":"<int>","description":"Only aligns the first <int> reads or read pairs from the input. Default: no limit."},{"names":["--phred33-quals"],"argument":"","description":"FASTQ qualities are ASCII chars equal to the Phred quality plus 33. Default: ON."},{"names":["--phred64-quals"],"argument":"","description":"FASTQ qualities are ASCII chars equal to the Phred quality plus 64. Default: off."},{"names":["--path_to_bowtie2"],"argument":"","description":"The full path </../../> to the Bowtie 2 installation folder on your system (not the bowtie2 executable itself). If not specified, it is assumed that Bowtie 2 is in the PATH."},{"names":["--path_to_hisat2"],"argument":"","description":"The full path </../../> to the HISAT2 installation folder on your system (not the hisat2 executable itself). If not specified, it is assumed that HISAT2 is in the PATH."},{"names":["--path_to_minimap2"],"argument":"","description":"The full path </../../> to the minimap2 installation folder on your system (not the minimap2 executable itself). If not specified, it is assumed that minimap2 is in the PATH."},{"names":["-N"],"argument":"<int>","description":"Sets the number of mismatches to allowed in a seed alignment during multiseed alignment. Can be set to 0 or 1. Setting this higher makes alignment slower (often much slower) but increases sensitivity. Default: 0. This option is only available for Bowtie 2 (for Bowtie 1 see -n)."},{"names":["-L"],"argument":"<int>","description":"Sets the length of the seed substrings to align during multiseed alignment. Smaller values make alignment slower but more senstive. Default: the --sensitive preset of Bowtie 2 is used by default, which sets -L to 20. maximum of L can be set to 32. The length of the seed would effect the alignment speed dramatically while the larger L, the faster the aligment. This option is only available for Bowtie 2 (for Bowtie 1 see -l)."},{"names":["--ignore-quals"],"argument":"","description":"When calculating a mismatch penalty, always consider the quality value at the mismatched position to be the highest possible, regardless of the actual value. I.e. input is treated as though all quality values are high. This is also the default behavior when the input doesn't specify quality values (e.g. in -f mode). This option is invariable and on by default."},{"names":["-I","--minins"],"argument":"<int>","description":"The minimum insert size for valid paired-end alignments. E.g. if -I 60 is specified and a paired-end alignment consists of two 20-bp alignments in the appropriate orientation with a 20-bp gap between them, that alignment is considered valid (as long as -X is also satisfied). A 19-bp gap would not be valid in that case. Default: 0."},{"names":["-X","--maxins"],"argument":"<int>","description":"The maximum insert size for valid paired-end alignments. E.g. if -X 100 is specified and a paired-end alignment consists of two 20-bp alignments in the proper orientation with a 60-bp gap between them, that alignment is considered valid (as long as -I is also satisfied). A 61-bp gap would not be valid in that case. Default: 500."},{"names":["--parallel"],"argument":"<int>","description":"(May also be --multicore <int>) Sets the number of parallel instances of Bismark to be run concurrently. This forks the Bismark alignment step very early on so that each individual Spawn of Bismark processes only every n-th sequence (n being set by --parallel). Once all processes have completed, the individual BAM files, mapping reports, unmapped or ambiguous FastQ files are merged into single files in very much the same way as they would have been generated running Bismark conventionally with only a single instance."},{"names":["--local"],"argument":"","description":"In this mode, it is not required that the entire read aligns from one end to the other. Rather, some characters may be omitted (“soft-clipped”) from the ends in order to achieve the greatest possible alignment score. For Bowtie 2, the match bonus --ma (default: 2) is used in this mode, and the best possible alignment score is equal to the match bonus (--ma) times the length of the read. This is mutually exclusive with end-to-end alignments. For HISAT2, it is currently not exactly known how the best alignment is calculated. DEFAULT: OFF."},{"names":["--non_directional"],"argument":"","description":"The sequencing library was constructed in a non strand-specific manner, alignments to all four bisulfite strands will be reported. Default: OFF."},{"names":["--pbat"],"argument":"","description":"This options may be used for PBAT-Seq libraries (Post-Bisulfite Adapter Tagging; Kobayashi et al., PLoS Genetics, 2012). This is essentially the exact opposite of alignments in 'directional' mode, as it will only launch two alignment threads to the CTOT and CTOB strands instead of the normal OT and OB ones. Use this option only if you are certain that your libraries were constructed following a PBAT protocol (if you don't know what PBAT-Seq is you should not specify this option). The option --pbat works only for FastQ files (in both Bowtie and Bowtie 2 mode) and using uncompressed temporary files only)."},{"names":["--sam-no-hd"],"argument":"","description":"Suppress SAM header lines (starting with @). This might be useful when very large input files are split up into several smaller files to run concurrently and the output files are to be merged."},{"names":["--rg_tag"],"argument":"","description":"Write out a Read Group tag to the resulting SAM/BAM file. This will write the following line to the SAM header: @RG PL: ILLUMINA ID:SAMPLE SM:SAMPLE ; to set ID and SM see --rg_id and --rg_sample. In addition each read receives an RG:Z:RG-ID tag. Default: OFF."},{"names":["--rg_id"],"argument":"<string>","description":"Sets the ID field in the @RG header line. The default is 'SAMPLE'."},{"names":["--rg_sample"],"argument":"<string>","description":"Sets the SM field in the @RG header line; can't be set without setting --rg_id as well. The default is 'SAMPLE'."},{"names":["--strandID"],"argument":"","description":"For non-directional paired-end libraries, the strands identity is encoded by the order in which R1 and R2 are reported, as well as the read and genome conversion state. If third party tools re-organise this order it may become difficult to determine the alignment strand identity. This option adds an optional tag, e.g. 'YS:Z:OT' or 'YS:Z:CTOB' to preserve this information. See also this thread for more details: https://github.com/FelixKrueger/Bismark/issues/455. Default: OFF."},{"names":["-un","--unmapped"],"argument":"","description":"Write all reads that could not be aligned to a file in the output directory. Written reads will appear as they did in the input, without any translation of quality values that may have taken place within Bowtie or Bismark. Paired-end reads will be written to two parallel files with _1 and _2 inserted in their filenames, i.e. _unmapped_reads_1.txt and unmapped_reads_2.txt. Reads with more than one valid alignment with the same number of lowest mismatches (ambiguous mapping) are also written to _unmapped_reads.txt unless the option --ambiguous is specified as well."},{"names":["--ambiguous"],"argument":"","description":"Write all reads which produce more than one valid alignment with the same number of lowest mismatches or other reads that fail to align uniquely to a file in the output directory. Written reads will appear as. they did in the input, without any of the translation of quality values that may have taken place within Bowtie or Bismark. Paired-end reads will be written to two parallel files with _1 and _2 inserted in their filenames, i.e. _ambiguous_reads_1.txt and _ambiguous_reads_2.txt. These reads are not written to the file specified with --un."},{"names":["-o","--output_dir"],"argument":"<dir>","description":"Write all output files into this directory. By default the output files will be written into the same folder as the input file(s). If the specified folder does not exist, Bismark will attempt to create it first. The path to the output folder can be either relative or absolute."},{"names":["--temp_dir"],"argument":"<dir>","description":"Write temporary files to this directory instead of into the same directory as the input files. If the specified folder does not exist, Bismark will attempt to create it first. The path to the temporary folder can be either relative or absolute."},{"names":["--non_bs_mm"],"argument":"","description":"Optionally, outputs an extra column specifying the number of non-bisulfite mismatches a read has. This option is only available in end-to-end mode. The value is just the number of actual non-bisulfite mismatches and ignores potential insertions or deletions. The format for single-end reads and read 1 of paired-end reads is 'XA:Z:number of mismatches' and 'XB:Z:number of mismatches' for read 2 of paired-end reads."},{"names":["--gzip"],"argument":"","description":"Temporary bisulfite conversion files will be written out in a GZIP compressed form to save disk space. This option is available for most alignment modes but is not available for paired-end FastA files. This option might be somewhat slower than writing out uncompressed files, but this awaits further testing."},{"names":["--sam"],"argument":"","description":"The output will be written out in SAM format instead of the default BAM format. Be warned that this requires ~10 times more disk space. --sam is not compatible with the option --parallel."},{"names":["--bam"],"argument":"","description":"Bismark will attempt to use the path to Samtools that was specified with '--samtools_path', or, if it hasn't been specified, attempt to find Samtools in the PATH. If no installation of Samtools can be found, the SAM output will be compressed with GZIP instead (yielding a .sam.gz output file). Default: ON."},{"names":["--cram"],"argument":"","description":"Writes the output to a CRAM file instead of BAM. This requires the use of Samtools 1.2 or higher."},{"names":["--cram_ref"],"argument":"<ref_file>","description":"CRAM output requires you to specify a reference genome as a single FastA file. If this single-FastA reference file is not supplied explicitly it will be regenerated from the genome .fa sequence(s) used for the Bismark run and written to a file called 'Bismark_genome_CRAM_reference.mfa' into the oputput directory."},{"names":["--samtools_path"],"argument":"","description":"The path to your Samtools installation, e.g. /home/user/samtools/. Does not need to be specified explicitly if Samtools is in the PATH already."},{"names":["--prefix"],"argument":"<prefix>","description":"Prefixes <prefix> to the output filenames. Trailing dots will be replaced by a single one. For example, '--prefix test' with 'file.fq' would result in the output file 'test.file.fq_bismark.sam' etc."},{"names":["-B","--basename"],"argument":"<basename>","description":"Write all output to files starting with this base file name. For example, '--basename foo' would result in the files 'foo.bam' and 'foo_SE_report.txt' (or its paired-end equivalent). Takes precedence over --prefix. Be advised that you should not use this option in conjunction with supplying lists of files to be processed consecutively, as all output files will constantly overwrite each other."},{"names":["--old_flag"],"argument":"","description":"Only in paired-end SAM mode, uses the FLAG values used by Bismark v0.8.2 and before. In addition, this options appends /1 and /2 to the read IDs for reads 1 and 2 relative to the input file. Since both the appended read IDs and custom FLAG values may cause problems with some downstream tools such as Picard, new defaults were implemented as of version 0.8.3."},{"names":["--ambig_bam"],"argument":"","description":"For reads that have multiple alignments a random alignment is written out to a special file ending in '.ambiguous.bam'. The alignments are in Bowtie2 format and do not any contain Bismark specific entries such as the methylation call etc. These ambiguous BAM files are intended to be used as coverage estimators for variant callers."},{"names":["--nucleotide_coverage"],"argument":"","description":"Calculates the mono- and di-nucleotide sequence composition of covered positions in the analysed BAM file and compares it to the genomic average composition once alignments are complete by calling 'bam2nuc'. Since this calculation may take a while, bam2nuc attempts to write the genomic sequence composition into a file called 'genomic_nucleotide_frequencies.txt' indside the reference genome folder so it can be re-used the next time round instead of calculating it once again. If a file 'nucleotide_stats.txt' is found with the Bismark reports it will be automatically detected and used for the Bismark HTML report. This option works only for BAM or CRAM files."},{"names":["--icpc"],"argument":"","description":"This option will truncate read IDs at the first space or tab it encounters, which are sometimes used to add comments to a FastQ entry (instead of replacing them with underscores (_) as is the default behaviour). The opion is deliberately somewhat cryptic (\"I couldn't possibly comment\"), as it only becomes relevant when R1 and R2 of read pairs are mapped separately in single-end mode, and then re-paired afterwards (the SAM format dictates that R1 and R2 have the same read ID). Paired-end mapping already creates BAM files with identical read IDs. For more information please see here: https://github.com/FelixKrueger/Bismark/issues/236. Default: OFF."},{"names":["-h","--help"],"argument":"","description":"Displays this help file."},{"names":["-v","--version"],"argument":"","description":"Displays version information."},{"names":["--bowtie2"],"argument":"","description":"Default: ON. Uses Bowtie 2 as default aligner. Bismark limits Bowtie 2 to only perform end-to-end alignments, i.e. searches for alignments involving all read characters (also called untrimmed or unclipped alignments). Bismark assumes that raw sequence data is adapter and/or quality trimmed where appropriate. Both small (.bt2) and large (.bt2l) Bowtie 2 indexes are supported. To use HISAT2 instead of Bowtie 2 please see option --hisat2."},{"names":["--no_dovetail"],"argument":"","description":"Turn off this behaviour for paired-end libraries. Default: OFF."},{"names":["--hisat2"],"argument":"","description":"Uses HISAT2 instead of Bowtie 2. Bismark uses HISAT2 in end-to-end mode by default, i.e. searches for alignments involving all read characters (also called untrimmed or unclipped alignments) using the option '--no-softclipping'. Bismark assumes that raw sequence data is adapter and/or quality trimmed where appropriate. From v0.22.0 onwards, Bismark also supports the local alignment mode of HISAT2 (please see --local). Both small (.ht2) and large (.ht2l) HISAT2 indexes are supported. Default: OFF."},{"names":["--no-spliced-alignment"],"argument":"","description":"Disable spliced alignment. Default: spliced-alignments are performed."},{"names":["--known-splicesite-infile"],"argument":"<path>","description":"Provide a list of known splice sites."},{"names":["--no-mixed"],"argument":"","description":"This option disables the behavior to try to find alignments for the individual mates if it cannot find a concordant or discordant alignment for a pair. This option is invariably on by default."},{"names":["--no-discordant"],"argument":"","description":"Normally, Bowtie 2 or HISAT2 look for discordant alignments if it cannot find any concordant alignments. A discordant alignment is an alignment where both mates align uniquely, but that does not satisfy the paired-end constraints (--fr/--rf/--ff, -I, -X). This option disables that behavior and it is on by default."},{"names":["-D"],"argument":"<int>","description":"Up to <int> consecutive seed extension attempts can \"fail\" before Bowtie 2 moves on, using the alignments found so far. A seed extension \"fails\" if it does not yield a new best or a new second-best alignment. Default: 15."},{"names":["-R"],"argument":"<int>","description":"<int> is the maximum number of times Bowtie 2 will \"re-seed\" reads with repetitive seeds. When \"re-seeding,\" Bowtie 2 simply chooses a new set of reads (same length, same number of mismatches allowed) at different offsets and searches for more alignments. A read is considered to have repetitive seeds if the total number of seed hits divided by the number of seeds that aligned at least once is greater than 300. Default: 2."},{"names":["-p"],"argument":"NTHREADS","description":"Launch NTHREADS parallel search threads (default: 1)."},{"names":["--score_min"],"argument":"<func>","description":"Sets a function governing the minimum alignment score needed for an alignment to be considered \"valid\" (i.e. good enough to report). This is a function of read length."},{"names":["--rdg"],"argument":"<int1>,<int2>","description":"Sets the read gap open (<int1>) and extend (<int2>) penalties. A read gap of length N gets a penalty of <int1> + N * <int2>. Default: 5, 3."},{"names":["--rfg"],"argument":"<int1>,<int2>","description":"Sets the reference gap open (<int1>) and extend (<int2>) penalties. A reference gap of length N gets a penalty of <int1> + N * <int2>. Default: 5, 3."},{"names":["--minimap2","--mm2"],"argument":"","description":"Uses minimap2 as the underlying read aligner. This mode is very new and currently experimental. Expect that things may change in the near future. The default mapping mode is --nanopore (preset '-x map-ont' (Nanopore reads)). Currently, there are no plans to support PacBio reads. Internally, minimap2 is run with the options -a --MD. More information here: https://lh3.github.io/minimap2/minimap2.html. Default: OFF."},{"names":["--mm2_nanopore"],"argument":"","description":"Using the minimap2 preset for Oxford Nanopore (ONT) vs reference mapping (-x map-ont). Only works in conjuntion with --minimap2. Default mode when --minimap2 is specified without additional qualifiers."},{"names":["--mm2_pacbio"],"argument":"","description":"Using the minimap2 preset for PacBio vs reference mapping (-x map-pb). Only works in conjuntion with --minimap2. Default: OFF."},{"names":["--mm2_short_reads"],"argument":"","description":"This option invokes the minmap2 preset setting '-x sr' and is intended for genomic short-read mapping with accurate reads (probably Illumina 150bp+ ?). For spliced short-reads, please use --hisat2 instead. Default: OFF."},{"names":["--mm2_maximum_length"],"argument":"<int>","description":"Maximum length cutoff for very long sequences (currently allowed 100-100,000 bp). Default: 10000."}],"version":"v0.24.0"}
