{"name":"estimateReadFiltering","description":"estimates the number of reads that would be filtered given a set of settings and prints this to the terminal.","usage":"estimateReadFiltering.py -b sample1.bam sample2.bam > log.txt","options":[{"names":["-h","--help"],"argument":"","description":"show this help message and exit"},{"names":["--bamfiles"],"argument":"FILE1 FILE2","description":"[FILE1 FILE2 ...], -b FILE1 FILE2 [FILE1 FILE2 ...] List of indexed bam files separated by spaces."},{"names":["--outFile","-o"],"argument":"OUTFILE","description":"The file to write results to. By default, results are printed to the console"},{"names":["--sampleLabels"],"argument":"SAMPLELABELS [SAMPLELABELS ...]","description":"Labels for the samples. The default is to use the file name of the sample. The sample labels should be separated by spaces and quoted if a label itselfcontains a space E.g. --sampleLabels label-1 \"label 2\""},{"names":["--smartLabels"],"argument":"","description":"Instead of manually specifying labels for the input BAM files, this causes deepTools to use the file name after removing the path and extension."},{"names":["--binSize","-bs"],"argument":"INT","description":"Length in bases of the window used to sample the genome. (Default: 1000000)"},{"names":["--distanceBetweenBins","-n"],"argument":"INT","description":"To reduce the computation time, not every possible genomic bin is sampled. This option allows you to set the distance between bins actually sampled from. Larger numbers are sufficient for high coverage samples, while smaller values are useful for lower coverage samples. Note that if you specify a value that results in too few (<1000) reads sampled, the value will be decreased. (Default: 10000)"},{"names":["--numberOfProcessors","-p"],"argument":"INT","description":"Number of processors to use. Type \"max/2\" to use half the maximum number of processors or \"max\" to use all available processors. (Default: 1)"},{"names":["--verbose","-v"],"argument":"","description":"Set to see processing messages."},{"names":["--version"],"argument":"","description":"show program's version number and exit"},{"names":["--filterRNAstrand"],"argument":"{forward,reverse}","description":"Selects RNA-seq reads (single-end or paired-end) in the given strand. (Default: None)"},{"names":["--ignoreDuplicates"],"argument":"","description":"If set, reads that have the same orientation and start position will be considered only once. If reads are paired, the mate's position also has to coincide to ignore a read."},{"names":["--minMappingQuality"],"argument":"INT","description":"If set, only reads that have a mapping quality score of at least this are considered."},{"names":["--samFlagInclude"],"argument":"INT","description":"Include reads based on the SAM flag. For example, to get only reads that are the first mate, use a flag of 64. This is useful to count properly paired reads only once, as otherwise the second mate will be also considered for the coverage. (Default: None)"},{"names":["--samFlagExclude"],"argument":"INT","description":"Exclude reads based on the SAM flag. For example, to get only reads that map to the forward strand, use --samFlagExclude 16, where 16 is the SAM flag for reads that map to the reverse strand. (Default: None)"},{"names":["--blackListFileName","-bl"],"argument":"BED file [BED file ...]","description":"A BED or GTF file containing regions that should be excluded from all analyses. Currently this works by rejecting genomic chunks that happen to overlap an entry. Consequently, for BAM files, if a read partially overlaps a blacklisted region or a fragment spans over it, then the read/fragment might still be considered. Please note that you should adjust the effective genome size, if relevant."}],"version":"estimateReadFiltering 3.5.1"}
