{"name":"falco","description":"A high throughput sequence QC analysis tool","usage":"falco [OPTIONS] <seqfile1> <seqfile2> ...","options":[{"names":["-h","--help"],"argument":"","description":"Print this help file and exit"},{"names":["-v","--version"],"argument":"","description":"Print the version of the program and exit"},{"names":["-o","--outdir"],"argument":"<DIR>","description":"Create all output files in the specified output directory. FALCO-SPECIFIC: If the directory does not exists, the program will create it. If this option is not set then the output file for each sequence file is created in the same directory as the sequence file which was processed."},{"names":["--casava"],"argument":"","description":"[IGNORED BY FALCO] Files come from raw casava output. Files in the same sample group (differing only by the group number) will be analysed as a set rather than individually. Sequences with the filter flag set in the header will be excluded from the analysis. Files must have the same names given to them by casava (including being gzipped and ending with .gz) otherwise they won't be grouped together correctly."},{"names":["--nano"],"argument":"","description":"[IGNORED BY FALCO] Files come from nanopore sequences and are in fast5 format. In this mode you can pass in directories to process and the program will take in all fast5 files within those directories and produce a single output file from the sequences found in all files."},{"names":["--nofilter"],"argument":"","description":"[IGNORED BY FALCO] If running with --casava then don't remove read flagged by casava as poor quality when performing the QC analysis."},{"names":["--extract"],"argument":"","description":"[ALWAYS ON IN FALCO] If set then the zipped output file will be uncompressed in the same directory after it has been created. By default this option will be set if fastqc is run in non-interactive mode."},{"names":["-j","--java"],"argument":"<FILE>","description":"[IGNORED BY FALCO] Provides the full path to the java binary you want to use to launch fastqc. If not supplied then java is assumed to be in your path."},{"names":["--noextract"],"argument":"","description":"[IGNORED BY FALCO] Do not uncompress the output file after creating it. You should set this option if you do not wish to uncompress the output when running in non-interactive mode."},{"names":["--nogroup"],"argument":"","description":"Disable grouping of bases for reads >50bp. All reports will show data for every base in the read. WARNING: When using this option, your plots may end up a ridiculous size. You have been warned!"},{"names":["--min_length"],"argument":"<NUM>","description":"[NOT YET IMPLEMENTED IN FALCO] Sets an artificial lower limit on the length of the sequence to be shown in the report. As long as you set this to a value greater or equal to your longest read length then this will be the sequence length used to create your read groups. This can be useful for making directly comaparable statistics from datasets with somewhat variable read lengths."},{"names":["-f","--format"],"argument":"<FORMAT>","description":"Bypasses the normal sequence file format detection and forces the program to use the specified format. Validformats are bam, sam, bam_mapped, sam_mapped, fastq, fq, fastq.gz or fq.gz."},{"names":["-t","--threads"],"argument":"<NUM>","description":"[NOT YET IMPLEMENTED IN FALCO] Specifies the number of files which can be processed simultaneously. Each thread will be allocated 250MB of memory so you shouldn't run more threads than your available memory will cope with, and not more than 6 threads on a 32 bit machine [1]"},{"names":["-c","--contaminants"],"argument":"","description":"Specifies a non-default file which contains the list of contaminants to screen overrepresented sequences against. The file must contain sets of named contaminants in the form name[tab]sequence. Lines prefixed with a hash will be ignored. Default: ~/.local/share/condax/envs/falco/opt/falco/Configuration/contaminant_list.txt"},{"names":["-a","--adapters"],"argument":"","description":"Specifies a non-default file which contains the list of adapter sequences which will be explicity searched against the library. The file must contain sets of named adapters in the form name[tab]sequence. Lines prefixed with a hash will be ignored. Default: ~/.local/share/condax/envs/falco/opt/falco/Configuration/adapter_list.txt"},{"names":["-l","--limits"],"argument":"<FILE>","description":"Specifies a non-default file which contains a set of criteria which will be used to determine the warn/error limits for the various modules. This file can also be used to selectively remove some modules from the output all together. The format needs to mirror the default limits.txt file found in the Configuration folder. Default: ~/.local/share/condax/envs/falco/opt/falco/Configuration/limits.txt"},{"names":["-k","--kmers"],"argument":"<NUM>","description":"[IGNORED BY FALCO AND ALWAYS SET TO 7] Specifies the length of Kmer to look for in the Kmer content module. Specified Kmer length must be between 2 and 10. Default length is 7 if not specified."},{"names":["-q","--quiet"],"argument":"","description":"Supress all progress messages on stdout and only report errors."},{"names":["-d","--dir"],"argument":"<DIR>","description":"[IGNORED: FALCO DOES NOT CREATE TMP FILES] Selects a directory to be used for temporary files written when generating report images. Defaults to system temp directory if not specified."},{"names":["-s","-subsample"],"argument":"","description":"[Falco only] makes falco faster (but possibly less accurate) by only processing reads that are multiple of this value (using 0-based indexing to number reads). [1]"},{"names":["-b","-bisulfite"],"argument":"","description":"[Falco only] reads are whole genome bisulfite sequencing, and more Ts and fewer Cs are therefore expected and will be accounted for in base content."},{"names":["-r","-reverse-complement"],"argument":"","description":"[Falco only] The input is a reverse-complement. All modules will be tested by swapping A/T and C/G"},{"names":["-skip-data"],"argument":"","description":"[Falco only] Do not create FastQC data text file."},{"names":["-skip-report"],"argument":"","description":"[Falco only] Do not create FastQC report HTML file."},{"names":["-skip-summary"],"argument":"","description":"[Falco only] Do not create FastQC summary file"},{"names":["-D","-data-filename"],"argument":"<STR>","description":"[Falco only] Specify filename for FastQC data output (TXT). If not specified, it will be called fastq_data.txt in either the input file's directory or the one specified in the --output flag. Only available when running falco with a single input."},{"names":["-R","-report-filename"],"argument":"<STR>","description":"[Falco only] Specify filename for FastQC report output (HTML). If not specified, it will be called fastq_report.html in either the input file's directory or the one specified in the --output flag. Only available when running falco with a single input."},{"names":["-S","-summary-filename"],"argument":"<STR>","description":"[Falco only] Specify filename for the short summary output (TXT). If not specified, it will be called fastq_report.html in either the input file's directory or the one specified in the --output flag. Only available when running falco with a single input."},{"names":["-K","-add-call"],"argument":"","description":"[Falco only] add the command call call to FastQC data output and FastQC report HTML (this may break the parse of fastqc_data.txt in programs that are very strict about the FastQC output format)."},{"names":["-about"],"argument":"","description":"print about message"}],"version":"falco 1.2.2"}
