{"name":"fasttree","description":"fasttree","options":[{"names":["-n"],"argument":"","description":"read in multiple alignments in. This only works with phylip interleaved format. For example, you can use it with the output from phylip's seqboot. If you use -n, FastTree will write 1 tree per line to standard output."},{"names":["-intree"],"argument":"newickfile","description":"read the starting tree in from newickfile. Any branch lengths in the starting trees are ignored. -intree with -n will read a separate starting tree for each alignment."},{"names":["-intree1"],"argument":"newickfile","description":"read the same starting tree for each alignment"},{"names":["-quiet"],"argument":"","description":"do not write to standard error during normal operation (no progress indicator, no options summary, no likelihood values, etc.)"},{"names":["-nopr"],"argument":"","description":"do not write the progress indicator to stderr"},{"names":["-log"],"argument":"logfile","description":"save intermediate trees so you can extract the trees and restart long-running jobs if they crash -log also reports the per-site rates (1 means slowest category)"},{"names":["-quote"],"argument":"","description":"quote sequence names in the output and allow spaces, commas, parentheses, and colons in them but not ' characters (fasta files only)"},{"names":["-pseudo"],"argument":"[weight]","description":"Use pseudocounts to estimate distances between sequences with little or no overlap. (Off by default.) Recommended if analyzing the alignment has sequences with little or no overlap. If the weight is not specified, it is 1.0"},{"names":["-nni"],"argument":"","description":"set the number of rounds of min. evo. NNIs, and -spr to set the rounds of SPRs."},{"names":["-noml"],"argument":"","description":"turn off both min-evo NNIs and SPRs (useful if refining an approximately maximum-likelihood tree with further NNIs)"},{"names":["-sprlength"],"argument":"","description":"set the maximum length of a SPR move (default 10)"},{"names":["-mlnni"],"argument":"","description":"set the number of rounds of maximum-likelihood NNIs"},{"names":["-mlacc"],"argument":"num","description":"-mlacc 2 or -mlacc 3 to always optimize all 5 branches at each NNI, and to optimize all 5 branches in 2 or 3 rounds"},{"names":["-mllen"],"argument":"","description":"optimize branch lengths without ML NNIs"},{"names":["-slownni"],"argument":"","description":"turn off heuristics to avoid constant subtrees (affects both ML and ME NNIs)"},{"names":["-lg"],"argument":"","description":"Le-Gascuel 2008 model instead of (default) Jones-Taylor-Thorton 1992 model (a.a. only)"},{"names":["-wag"],"argument":"","description":"Whelan-And-Goldman 2001 model instead of (default) Jones-Taylor-Thorton 1992 model (a.a. only)"},{"names":["-gtr"],"argument":"","description":"generalized time-reversible instead of (default) Jukes-Cantor (nt only)"},{"names":["-cat"],"argument":"#","description":"specify the number of rate categories of sites (default 20)"},{"names":["-nocat"],"argument":"","description":"no CAT model (just 1 category)"},{"names":["-gamma"],"argument":"","description":"after the final round of optimizing branch lengths with the CAT model, report the likelihood under the discrete gamma model with the same number of categories. FastTree uses the same branch lengths but optimizes the gamma shape parameter and the scale of the lengths. The final tree will have rescaled lengths. Used with -log, this also generates per-site likelihoods for use with CONSEL, see GammaLogToPaup.pl and documentation on the FastTree web site."},{"names":["-nosupport"],"argument":"","description":"turn off support values or -boot 100 to just 100 resamples"},{"names":["-seed"],"argument":"","description":"initialize the random number generator"},{"names":["-slow"],"argument":"","description":"exhaustive search (like NJ or BIONJ, but different gap handling)"},{"names":["-notop"],"argument":"","description":"to turn this feature off and compare all leaves to each other, and all new joined nodes to each other"},{"names":["-topm"],"argument":"1.0","description":"set the top-hit list size to parameter*sqrt(N) FastTree estimates the top m hits of a leaf from the top 2*m hits of a 'close' neighbor, where close is defined as d(seed,close) < 0.75 * d(seed, hit of rank 2*m), and updates the top-hits as joins proceed"},{"names":["-close"],"argument":"0.75","description":"modify the close heuristic, lower is more conservative"},{"names":["-refresh"],"argument":"0.8","description":"compare a joined node to all other nodes if its top-hit list is less than 80% of the desired length, or if the age of the top-hit list is log2(m) or greater"},{"names":["-2nd"],"argument":"","description":"turn 2nd-level top hits heuristic on"},{"names":["-no2nd"],"argument":"","description":"turn 2nd-level top hits heuristic off"},{"names":["-nj"],"argument":"","description":"regular (unweighted) neighbor-joining (default)"},{"names":["-bionj"],"argument":"","description":"weighted joins as in BIONJ FastTree will also weight joins during NNIs"},{"names":["-constraints"],"argument":"alignmentfile","description":"an alignment with values of 0, 1, and - Not all sequences need be present. A column of 0s and 1s defines a constrained split. Some constraints may be violated (see 'violating constraints:' in standard error)."},{"names":["-constraintWeight"],"argument":"","description":"how strongly to weight the constraints. A value of 1 means a penalty of 1 in tree length for violating a constraint Default: 100.0"}],"version":"FastTree Version 2.1.11 Double precision (No SSE3)"}
