{
  "name": "pilon",
  "description": "pilon",
  "options": [
    {
      "names": [
        "--genome"
      ],
      "argument": "genome.fasta",
      "description": "The input genome we are trying to improve, which must be the reference used for the bam alignments. At least one of --frags or --jumps must also be given."
    },
    {
      "names": [
        "--frags"
      ],
      "argument": "frags.bam",
      "description": "A bam file consisting of fragment paired-end alignments, aligned to the --genome argument using bwa or bowtie2. This argument may be specifed more than once."
    },
    {
      "names": [
        "--jumps"
      ],
      "argument": "jumps.bam",
      "description": "A bam file consisting of jump (mate pair) paired-end alignments, aligned to the --genome argument using bwa or bowtie2. This argument may be specifed more than once."
    },
    {
      "names": [
        "--unpaired"
      ],
      "argument": "unpaired.bam",
      "description": "A bam file consisting of unpaired alignments, aligned to the --genome argument using bwa or bowtie2. This argument may be specifed more than once."
    },
    {
      "names": [
        "--bam"
      ],
      "argument": "any.bam",
      "description": "A bam file of unknown type; Pilon will scan it and attempt to classify it as one of the above bam types."
    },
    {
      "names": [
        "--nanopore"
      ],
      "argument": "ont.bam",
      "description": "A bam file containing Oxford Nanopore read alignments. Experimental."
    },
    {
      "names": [
        "--pacbio"
      ],
      "argument": "pb.bam",
      "description": "A bam file containing Pacific Biosciences read alignments. Experimental."
    },
    {
      "names": [
        "--output"
      ],
      "argument": "prefix",
      "description": "Prefix for output files"
    },
    {
      "names": [
        "--outdir"
      ],
      "argument": "directory",
      "description": "Use this directory for all output files."
    },
    {
      "names": [
        "--changes"
      ],
      "argument": "",
      "description": "If specified, a file listing changes in the <output>.fasta will be generated."
    },
    {
      "names": [
        "--vcf"
      ],
      "argument": "",
      "description": "If specified, a vcf file will be generated"
    },
    {
      "names": [
        "--variant"
      ],
      "argument": "",
      "description": "Sets up heuristics for variant calling, as opposed to assembly improvement; equivalent to \"--vcf --fix all,breaks\"."
    },
    {
      "names": [
        "--chunksize"
      ],
      "argument": "",
      "description": "Input FASTA elements larger than this will be processed in smaller pieces not to exceed this size (default 10000000)."
    },
    {
      "names": [
        "--diploid"
      ],
      "argument": "",
      "description": "Sample is from diploid organism; will eventually affect calling of heterozygous SNPs"
    },
    {
      "names": [
        "--fix"
      ],
      "argument": "fixlist",
      "description": "A comma-separated list of categories of issues to try to fix:"
    },
    {
      "names": [
        "--dumpreads"
      ],
      "argument": "",
      "description": "Dump reads for local re-assemblies."
    },
    {
      "names": [
        "--duplicates"
      ],
      "argument": "",
      "description": "Use reads marked as duplicates in the input BAMs (ignored by default)."
    },
    {
      "names": [
        "--iupac"
      ],
      "argument": "",
      "description": "Output IUPAC ambiguous base codes in the output FASTA file when appropriate."
    },
    {
      "names": [
        "--nonpf"
      ],
      "argument": "",
      "description": "Use reads which failed sequencer quality filtering (ignored by default)."
    },
    {
      "names": [
        "--targets"
      ],
      "argument": "targetlist",
      "description": "Only process the specified target(s). Targets are comma-separated, and each target is a fasta element name optionally followed by a base range. Example: \"scaffold00001,scaffold00002:10000-20000\" would result in processing all of scaffold00001 and coordinates 10000-20000 of scaffold00002. If \"targetlist\" is the name of a file, each line will be treated as a target specification."
    },
    {
      "names": [
        "--verbose"
      ],
      "argument": "",
      "description": "More verbose output."
    },
    {
      "names": [
        "--debug"
      ],
      "argument": "",
      "description": "Debugging output (implies verbose)."
    },
    {
      "names": [
        "--version"
      ],
      "argument": "",
      "description": "Print version string and exit."
    },
    {
      "names": [
        "--defaultqual"
      ],
      "argument": "qual",
      "description": "Assumes bases are of this quality if quals are no present in input BAMs (default 10)."
    },
    {
      "names": [
        "--flank"
      ],
      "argument": "nbases",
      "description": "Controls how much of the well-aligned reads will be used; this many bases at each end of the good reads will be ignored (default 10)."
    },
    {
      "names": [
        "--gapmargin"
      ],
      "argument": "",
      "description": "Closed gaps must be within this number of bases of true size to be closed (100000)"
    },
    {
      "names": [
        "--K"
      ],
      "argument": "",
      "description": "Kmer size used by internal assembler (default 47)."
    },
    {
      "names": [
        "--mindepth"
      ],
      "argument": "depth",
      "description": "Variants (snps and indels) will only be called if there is coverage of good pairs at this depth or more; if this value is >= 1, it is an absolute depth, if it is a fraction < 1, then minimum depth is computed by multiplying this value by the mean coverage for the region, with a minumum value of 5 (default 0.1: min depth to call is 10% of mean coverage or 5, whichever is greater)."
    },
    {
      "names": [
        "--mingap"
      ],
      "argument": "",
      "description": "Minimum size for unclosed gaps (default 10)"
    },
    {
      "names": [
        "--minmq"
      ],
      "argument": "",
      "description": "Minimum alignment mapping quality for a read to count in pileups (default 0)"
    },
    {
      "names": [
        "--minqual"
      ],
      "argument": "",
      "description": "Minimum base quality to consider for pileups (default 0)"
    },
    {
      "names": [
        "--nostrays"
      ],
      "argument": "",
      "description": "Skip making a pass through the input BAM files to identify stray pairs, that is, those pairs in which both reads are aligned but not marked valid because they have inconsistent orientation or separation. Identifying stray pairs can help fill gaps and assemble larger insertions, especially of repeat content. However, doing so sometimes consumes considerable memory."
    }
  ]
}
