{"name":"subread-align","description":"The Subread aligner","usage":"subread-align [options] -i <index_name> -r <input> -t <type> -o <output>","options":[{"names":["-i"],"argument":"<string>","description":"Base name of the index."},{"names":["-r"],"argument":"<string>","description":"Name of an input read file. If paired-end, this should be the first read file (typically containing \"R1\"in the file name) and the second should be provided via \"-R\". Acceptable formats include gzipped FASTQ, FASTQ, gzipped FASTA and FASTA. These formats are identified automatically."},{"names":["-t"],"argument":"<int>","description":"Type of input sequencing data. Its values include"},{"names":["-o"],"argument":"<string>","description":"Name of an output file. By default, the output is in BAM format. Omitting this option makes the output be written to STDOUT."},{"names":["-R"],"argument":"<string>","description":"Name of the second read file in paired-end data (typically containing \"R2\" the file name)."},{"names":["--SAMinput"],"argument":"","description":"Input reads are in SAM format."},{"names":["--BAMinput"],"argument":"","description":"Input reads are in BAM format."},{"names":["--SAMoutput"],"argument":"","description":"Save mapping results in SAM format."},{"names":["-P"],"argument":"<3:6>","description":"Offset value added to the Phred quality score of each read base. '3' for phred+33 and '6' for phred+64. '3' by default."},{"names":["-n"],"argument":"<int>","description":"Number of selected subreads, 10 by default."},{"names":["-m"],"argument":"<int>","description":"Consensus threshold for reporting a hit (minimal number of subreads that map in consensus) . If paired-end, this gives the consensus threshold for the anchor read (anchor read receives more votes than the other read in the same pair). 3 by default"},{"names":["-p"],"argument":"<int>","description":"Consensus threshold for the non- anchor read in a pair. 1 by default."},{"names":["-M"],"argument":"<int>","description":"Maximum number of mis-matched bases allowed in each reported alignment. 3 by default. Mis-matched bases found in softclipped bases are not counted."},{"names":["--multiMapping"],"argument":"","description":"Report multi-mapping reads in addition to uniquely mapped reads. Use \"-B\" to set the maximum number of equally-best alignments to be reported."},{"names":["-B"],"argument":"<int>","description":"Maximum number of equally-best alignments to be reported for a multi-mapping read. Equally-best alignments have the same number of mis-matched bases. 1 by default."},{"names":["-I"],"argument":"<int>","description":"Maximum length (in bp) of indels that can be detected. 5 by default. Indels of up to 200bp long can be detected."},{"names":["--complexIndels"],"argument":"","description":"Detect multiple short indels that are in close proximity (they can be as close as 1bp apart from each other)."},{"names":["--trim5"],"argument":"<int>","description":"Trim off <int> number of bases from 5' end of each read. 0 by default."},{"names":["--trim3"],"argument":"<int>","description":"Trim off <int> number of bases from 3' end of each read. 0 by default."},{"names":["-d"],"argument":"<int>","description":"Minimum fragment/insert length, 50bp by default."},{"names":["-D"],"argument":"<int>","description":"Maximum fragment/insert length, 600bp by default."},{"names":["-S"],"argument":"<ff:fr:rf>","description":"Orientation of first and second reads, 'fr' by default ( forward/reverse)."},{"names":["-T"],"argument":"<int>","description":"Number of CPU threads used, 1 by default."},{"names":["--rg-id"],"argument":"<string>","description":"Add read group ID to the output."},{"names":["--rg"],"argument":"<string>","description":"Add <tag:value> to the read group (RG) header in the output."},{"names":["--keepReadOrder"],"argument":"","description":"Keep order of reads in BAM output the same as that in the input file. Reads from the same pair are always placed next to each other no matter this option is specified or not."},{"names":["-b"],"argument":"","description":"Convert color-space read bases to base-space read bases in the mapping output. Note that read mapping is performed at color-space."},{"names":["--DPGapOpen"],"argument":"<int>","description":"Penalty for gap opening in short indel detection. -1 by default."},{"names":["--DPGapExt"],"argument":"<int>","description":"Penalty for gap extension in short indel detection. 0 by default."},{"names":["--DPMismatch"],"argument":"<int>","description":"Penalty for mismatches in short indel detection. 0 by default."},{"names":["--DPMatch"],"argument":"<int>","description":"Score for matched bases in short indel detection. 2 by default."},{"names":["--sv"],"argument":"","description":"Detect structural variants (eg. long indel, inversion, duplication and translocation) and report breakpoints. Refer to Users Guide for breakpoint reporting."},{"names":["-a"],"argument":"","description":"Name of an annotation file (gzipped file is accepted). GTF/GFF format by default. See -F option for more format information."},{"names":["-F"],"argument":"","description":"Specify format of the provided annotation file. Acceptable formats include 'GTF' (or compatible GFF format) and 'SAF'. 'GTF' by default. For SAF format, please refer to Users Guide."},{"names":["-A"],"argument":"","description":"Provide a chromosome name alias file to match chr names in annotation with those in the reads. This should be a twocolumn comma-delimited text file. Its first column should include chr names in the annotation and its second column should include chr names in the index. Chr names are case sensitive. No column header should be included in the file."},{"names":["--gtfFeature"],"argument":"<string>","description":"Specify feature type in GTF annotation. 'exon'   by default. Features used for read counting will be extracted from annotation using the provided value."},{"names":["--gtfAttr"],"argument":"<string>","description":"Specify attribute type in GTF annotation. 'gene_id'   by default. Meta-features used for read counting will be extracted from annotation using the provided value."},{"names":["-v"],"argument":"","description":"Output version of the program."}],"version":"2.0.1"}
