{
  "name": "tabix",
  "description": "tabix",
  "options": [
    {
      "names": [
        "-0",
        "--zero-based"
      ],
      "argument": "",
      "description": "Specify that the position in the data file is 0-based (e.g. UCSC files) rather than 1-based."
    },
    {
      "names": [
        "-b",
        "--begin"
      ],
      "argument": "INT",
      "description": "Column of start chromosomal position. [4]"
    },
    {
      "names": [
        "-c",
        "--comment"
      ],
      "argument": "CHAR",
      "description": "Skip lines started with character CHAR. [#]"
    },
    {
      "names": [
        "-C",
        "--csi"
      ],
      "argument": "",
      "description": "Produce CSI format index instead of classical tabix or BAI style indices."
    },
    {
      "names": [
        "-e",
        "--end"
      ],
      "argument": "INT",
      "description": "Column of end chromosomal position. The end column can be the same as the start column. [5]"
    },
    {
      "names": [
        "-f",
        "--force"
      ],
      "argument": "",
      "description": "Force to overwrite the index file if it is present."
    },
    {
      "names": [
        "-m",
        "--min-shift"
      ],
      "argument": "INT",
      "description": "set minimal interval size for CSI indices to 2^INT [14]"
    },
    {
      "names": [
        "-p",
        "--preset"
      ],
      "argument": "STR",
      "description": "Input format for indexing. Valid values are: gff, bed, sam, vcf. This option should not be applied together with any of -s, -b, -e, -c and -0; it is not used for data retrieval because this setting is stored in the index file. [gff]"
    },
    {
      "names": [
        "-s",
        "--sequence"
      ],
      "argument": "INT",
      "description": "Column of sequence name. Option -s, -b, -e, -S, -c and -0 are all stored in the index file and thus not used in data retrieval. [1]"
    },
    {
      "names": [
        "-S",
        "--skip-lines"
      ],
      "argument": "INT",
      "description": "Skip first INT lines in the data file. [0]"
    },
    {
      "names": [
        "-h",
        "--print-header"
      ],
      "argument": "",
      "description": "Print also the header/meta lines."
    },
    {
      "names": [
        "-H",
        "--only-header"
      ],
      "argument": "",
      "description": "Print only the header/meta lines."
    },
    {
      "names": [
        "-l",
        "--list-chroms"
      ],
      "argument": "",
      "description": "List the sequence names stored in the index file."
    },
    {
      "names": [
        "-r",
        "--reheader"
      ],
      "argument": "FILE",
      "description": "Replace the header with the content of FILE"
    },
    {
      "names": [
        "-R",
        "--regions"
      ],
      "argument": "FILE",
      "description": "Restrict to regions listed in the FILE. The FILE can be BED file (requires .bed, .bed.gz, .bed.bgz file name extension) or a TAB-delimited file with CHROM, POS, and, optionally, POS_TO columns, where positions are 1-based and inclusive. When this option is in use, the input file may not be sorted."
    },
    {
      "names": [
        "-T",
        "--targets"
      ],
      "argument": "FILE",
      "description": "Similar to -R but the entire input will be read sequentially and regions not listed in FILE will be skipped."
    },
    {
      "names": [
        "-D"
      ],
      "argument": "",
      "description": "Do not download the index file before opening it. Valid for remote files only."
    },
    {
      "names": [
        "--cache"
      ],
      "argument": "INT",
      "description": "Set the BGZF block cache size to INT megabytes. [10]"
    },
    {
      "names": [
        "--separate-regions"
      ],
      "argument": "",
      "description": "This option can be used when multiple regions are supplied in the command line and the user needs to quickly see which file records belong to which region. For this, a line with the name of the region, preceded by the file specific comment symbol, is inserted in the output before its corresponding group of records."
    },
    {
      "names": [
        "--verbosity"
      ],
      "argument": "INT",
      "description": "Set verbosity of logging messages printed to stderr. The default is 3, which turns on error and warning messages; 2 reduces warning messages; 1 prints only error messages and 0 is mostly silent. Values higher than 3 produce additional informational and debugging messages."
    }
  ]
}
