{"name":"ffmpeg","description":"ffmpeg","options":[{"names":["-L"],"argument":"","description":"Show license."},{"names":["-h","-?","-help","--help"],"argument":"[arg]","description":"Show help. An optional parameter may be specified to print help about a specific item. If no argument is specified, only basic (non advanced) tool options are shown."},{"names":["-version"],"argument":"","description":"Show version."},{"names":["-formats"],"argument":"","description":"Show available formats (including devices)."},{"names":["-demuxers"],"argument":"","description":"Show available demuxers."},{"names":["-muxers"],"argument":"","description":"Show available muxers."},{"names":["-devices"],"argument":"","description":"Show available devices."},{"names":["-codecs"],"argument":"","description":"Show all codecs known to libavcodec."},{"names":["-decoders"],"argument":"","description":"Show available decoders."},{"names":["-encoders"],"argument":"","description":"Show all available encoders."},{"names":["-bsfs"],"argument":"","description":"Show available bitstream filters."},{"names":["-protocols"],"argument":"","description":"Show available protocols."},{"names":["-filters"],"argument":"","description":"Show available libavfilter filters."},{"names":["-pix_fmts"],"argument":"","description":"Show available pixel formats."},{"names":["-sample_fmts"],"argument":"","description":"Show available sample formats."},{"names":["-layouts"],"argument":"","description":"Show channel names and standard channel layouts."},{"names":["-colors"],"argument":"","description":"Show recognized color names."},{"names":["-sources"],"argument":"device[,opt1=val1[,opt2=val2]...]","description":"Show autodetected sources of the input device. Some devices may provide system-dependent source names that cannot be autodetected. The returned list cannot be assumed to be always complete."},{"names":["-sinks"],"argument":"device[,opt1=val1[,opt2=val2]...]","description":"Show autodetected sinks of the output device. Some devices may provide system-dependent sink names that cannot be autodetected. The returned list cannot be assumed to be always complete."},{"names":["-loglevel","-v"],"argument":"[flags+]loglevel","description":"Set logging level and flags used by the library."},{"names":["-report"],"argument":"","description":"Dump full command line and console output to a file named \"program-YYYYMMDD-HHMMSS.log\" in the current directory. This file can be useful for bug reports. It also implies \"-loglevel debug\"."},{"names":["-hide_banner"],"argument":"","description":"Suppress printing banner."},{"names":["-cpuflags"],"argument":"flags (global)","description":"Allows setting and clearing cpu flags. This option is intended for testing. Do not use it unless you know what you're doing."},{"names":["-f"],"argument":"fmt (input/output)","description":"Force input or output file format. The format is normally auto detected for input files and guessed from the file extension for output files, so this option is not needed in most cases."},{"names":["-i"],"argument":"url (input)","description":"input file url"},{"names":["-y"],"argument":"(global)","description":"Overwrite output files without asking."},{"names":["-n"],"argument":"(global)","description":"Do not overwrite output files, and exit immediately if a specified output file already exists."},{"names":["-stream_loop"],"argument":"number (input)","description":"Set number of times input stream shall be looped. Loop 0 means no loop, loop -1 means infinite loop."},{"names":["-c","-codec"],"argument":"[:stream_specifier] codec (input/output,per-stream)","description":"Select an encoder (when used before an output file) or a decoder (when used before an input file) for one or more streams. codec is the name of a decoder/encoder or a special value \"copy\" (output only) to indicate that the stream is not to be re-encoded."},{"names":["-t"],"argument":"duration (input/output)","description":"When used as an input option (before \"-i\"), limit the duration of data read from the input file."},{"names":["-to"],"argument":"position (input/output)","description":"Stop writing the output or reading the input at position. position must be a time duration specification, see the Time duration section in the ffmpeg-utils(1) manual."},{"names":["-fs"],"argument":"limit_size (output)","description":"Set the file size limit, expressed in bytes. No further chunk of bytes is written after the limit is exceeded. The size of the output file is slightly more than the requested file size."},{"names":["-ss"],"argument":"position (input/output)","description":"When used as an input option (before \"-i\"), seeks in this input file to position. Note that in most formats it is not possible to seek exactly, so ffmpeg will seek to the closest seek point before position. When transcoding and -accurate_seek is enabled (the default), this extra segment between the seek point and position will be decoded and discarded. When doing stream copy or when -noaccurate_seek is used, it will be preserved."},{"names":["-sseof"],"argument":"position (input)","description":"Like the \"-ss\" option but relative to the \"end of file\". That is negative values are earlier in the file, 0 is at EOF."},{"names":["-itsoffset"],"argument":"offset (input)","description":"Set the input time offset."},{"names":["-itsscale"],"argument":"scale (input,per-stream)","description":"Rescale input timestamps. scale should be a floating point number."},{"names":["-timestamp"],"argument":"date (output)","description":"Set the recording timestamp in the container."},{"names":["-metadata"],"argument":"[:metadata_specifier] key=value (output,per-metadata)","description":"Set a metadata key/value pair."},{"names":["-disposition"],"argument":"[:stream_specifier] value (output,per-stream)","description":"Sets the disposition for a stream."},{"names":["-program"],"argument":"[title=title:][program_num=program_num:]st=stream[:st=stream...] (output)","description":"Creates a program with the specified title, program_num and adds the specified stream(s) to it."},{"names":["-target"],"argument":"type (output)","description":"Specify target file type (\"vcd\", \"svcd\", \"dvd\", \"dv\", \"dv50\"). type may be prefixed with \"pal-\", \"ntsc-\" or \"film-\" to use the corresponding standard. All the format options (bitrate, codecs, buffer sizes) are then set automatically. You can just type:"},{"names":["-dn"],"argument":"(input/output)","description":"As an input option, blocks all data streams of a file from being filtered or being automatically selected or mapped for any output. See \"-discard\" option to disable streams individually."},{"names":["-dframes"],"argument":"number (output)","description":"Set the number of data frames to output. This is an obsolete alias for \"-frames:d\", which you should use instead."},{"names":["-frames"],"argument":"[:stream_specifier] framecount (output,per-stream)","description":"Stop writing to the stream after framecount frames."},{"names":["-q","-qscale"],"argument":"[:stream_specifier] q (output,per-stream)","description":"Use fixed quality scale (VBR). The meaning of q/qscale is codec-dependent. If qscale is used without a stream_specifier then it applies only to the video stream, this is to maintain compatibility with previous behavior and as specifying the same codec specific value to 2 different codecs that is audio and video generally is not what is intended when no stream_specifier is used."},{"names":["-filter"],"argument":"[:stream_specifier] filtergraph (output,per-stream)","description":"Create the filtergraph specified by filtergraph and use it to filter the stream."},{"names":["-filter_script"],"argument":"[:stream_specifier] filename (output,per-stream)","description":"This option is similar to -filter, the only difference is that its argument is the name of the file from which a filtergraph description is to be read."},{"names":["-filter_threads"],"argument":"nb_threads (global)","description":"Defines how many threads are used to process a filter pipeline. Each pipeline will produce a thread pool with this many threads available for parallel processing. The default is the number of available CPUs."},{"names":["-pre"],"argument":"[:stream_specifier] preset_name (output,per-stream)","description":"Specify the preset for matching stream(s)."},{"names":["-stats"],"argument":"(global)","description":"Print encoding progress/statistics. It is on by default, to explicitly disable it you need to specify \"-nostats\"."},{"names":["-progress"],"argument":"url (global)","description":"Send program-friendly progress information to url."},{"names":["-stdin"],"argument":"","description":"Enable interaction on standard input. On by default unless standard input is used as an input. To explicitly disable interaction you need to specify \"-nostdin\"."},{"names":["-debug_ts"],"argument":"(global)","description":"Print timestamp information. It is off by default. This option is mostly useful for testing and debugging purposes, and the output format may change from one version to another, so it should not be employed by portable scripts."},{"names":["-attach"],"argument":"filename (output)","description":"Add an attachment to the output file. This is supported by a few formats like Matroska for e.g. fonts used in rendering subtitles. Attachments are implemented as a specific type of stream, so this option will add a new stream to the file. It is then possible to use per-stream options on this stream in the usual way. Attachment streams created with this option will be created after all the other streams (i.e. those created with \"-map\" or automatic mappings)."},{"names":["-dump_attachment"],"argument":"[:stream_specifier] filename (input,per-stream)","description":"Extract the matching attachment stream into a file named filename. If filename is empty, then the value of the \"filename\" metadata tag will be used."},{"names":["-noautorotate"],"argument":"","description":"Disable automatically rotating video based on file metadata."},{"names":["-vframes"],"argument":"number (output)","description":"Set the number of video frames to output. This is an obsolete alias for \"-frames:v\", which you should use instead."},{"names":["-r"],"argument":"[:stream_specifier] fps (input/output,per-stream)","description":"Set frame rate (Hz value, fraction or abbreviation)."},{"names":["-s"],"argument":"[:stream_specifier] size (input/output,per-stream)","description":"Set frame size."},{"names":["-aspect"],"argument":"[:stream_specifier] aspect (output,per-stream)","description":"Set the video display aspect ratio specified by aspect."},{"names":["-vn"],"argument":"(input/output)","description":"As an input option, blocks all video streams of a file from being filtered or being automatically selected or mapped for any output. See \"-discard\" option to disable streams individually."},{"names":["-vcodec"],"argument":"codec (output)","description":"Set the video codec. This is an alias for \"-codec:v\"."},{"names":["-pass"],"argument":"[:stream_specifier] n (output,per-stream)","description":"Select the pass number (1 or 2). It is used to do two-pass video encoding. The statistics of the video are recorded in the first pass into a log file (see also the option -passlogfile), and in the second pass that log file is used to generate the video at the exact requested bitrate. On pass 1, you may just deactivate audio and set output to null, examples for Windows and Unix:"},{"names":["-passlogfile"],"argument":"[:stream_specifier] prefix (output,per-stream)","description":"Set two-pass log file name prefix to prefix, the default file name prefix is ``ffmpeg2pass''. The complete file name will be PREFIX-N.log, where N is a number specific to the output stream"},{"names":["-vf"],"argument":"filtergraph (output)","description":"Create the filtergraph specified by filtergraph and use it to filter the stream."},{"names":["-pix_fmt"],"argument":"[:stream_specifier] format (input/output,per-stream)","description":"Set pixel format. Use \"-pix_fmts\" to show all the supported pixel formats. If the selected pixel format can not be selected, ffmpeg will print a warning and select the best pixel format supported by the encoder. If pix_fmt is prefixed by a \"+\", ffmpeg will exit with an error if the requested pixel format can not be selected, and automatic conversions inside filtergraphs are disabled. If pix_fmt is a single \"+\", ffmpeg selects the same pixel format as the input (or graph output) and automatic conversions are disabled."},{"names":["-sws_flags"],"argument":"flags (input/output)","description":"Set SwScaler flags."},{"names":["-rc_override"],"argument":"[:stream_specifier] override (output,per-stream)","description":"Rate control override for specific intervals, formatted as \"int,int,int\" list separated with slashes. Two first values are the beginning and end frame numbers, last one is quantizer to use if positive, or quality factor if negative."},{"names":["-ilme"],"argument":"","description":"Force interlacing support in encoder (MPEG-2 and MPEG-4 only). Use this option if your input file is interlaced and you want to keep the interlaced format for minimum losses. The alternative is to deinterlace the input stream with -deinterlace, but deinterlacing introduces losses."},{"names":["-psnr"],"argument":"","description":"Calculate PSNR of compressed frames."},{"names":["-vstats"],"argument":"","description":"Dump video coding statistics to vstats_HHMMSS.log."},{"names":["-vstats_file"],"argument":"file","description":"Dump video coding statistics to file."},{"names":["-vstats_version"],"argument":"file","description":"Specifies which version of the vstats format to use. Default is 2."},{"names":["-top"],"argument":"[:stream_specifier] n (output,per-stream)","description":"top=1/bottom=0/auto=-1 field first"},{"names":["-dc"],"argument":"precision","description":"Intra_dc_precision."},{"names":["-vtag"],"argument":"fourcc/tag (output)","description":"Force video tag/fourcc. This is an alias for \"-tag:v\"."},{"names":["-qphist"],"argument":"(global)","description":"Show QP histogram"},{"names":["-vbsf"],"argument":"bitstream_filter","description":"Deprecated see -bsf"},{"names":["-force_key_frames"],"argument":"[:stream_specifier] time[,time...] (output,per-stream)","description":"Force key frames at the specified timestamps, more precisely at the first frames after each specified time."},{"names":["-copyinkf"],"argument":"[:stream_specifier] (output,per-stream)","description":"When doing stream copy, copy also non-key frames found at the beginning."},{"names":["-init_hw_device"],"argument":"type[=name][:device[,key=value...]]","description":"Initialise a new hardware device of type type called name, using the given device parameters. If no name is specified it will receive a default name of the form \"type%d\"."},{"names":["-init_hw_device"],"argument":"list","description":"List all hardware device types supported in this build of ffmpeg."},{"names":["-filter_hw_device"],"argument":"name","description":"Pass the hardware device called name to all filters in any filter graph. This can be used to set the device to upload to with the \"hwupload\" filter, or the device to map to with the \"hwmap\" filter. Other filters may also make use of this parameter when they require a hardware device. Note that this is typically only required when the input is not already in hardware frames - when it is, filters will derive the device they require from the context of the frames they receive as input."},{"names":["-hwaccel"],"argument":"[:stream_specifier] hwaccel (input,per-stream)","description":"Use hardware acceleration to decode the matching stream(s). The allowed values of hwaccel are:"},{"names":["-hwaccel_device"],"argument":"[:stream_specifier] hwaccel_device (input,per-stream)","description":"Select a device to use for hardware acceleration."},{"names":["-hwaccels"],"argument":"","description":"List all hardware acceleration methods supported in this build of ffmpeg."},{"names":["-aframes"],"argument":"number (output)","description":"Set the number of audio frames to output. This is an obsolete alias for \"-frames:a\", which you should use instead."},{"names":["-ar"],"argument":"[:stream_specifier] freq (input/output,per-stream)","description":"Set the audio sampling frequency. For output streams it is set by default to the frequency of the corresponding input stream. For input streams this option only makes sense for audio grabbing devices and raw demuxers and is mapped to the corresponding demuxer options."},{"names":["-aq"],"argument":"q (output)","description":"Set the audio quality (codec-specific, VBR). This is an alias for -q:a."},{"names":["-ac"],"argument":"[:stream_specifier] channels (input/output,per-stream)","description":"Set the number of audio channels. For output streams it is set by default to the number of input audio channels. For input streams this option only makes sense for audio grabbing devices and raw demuxers and is mapped to the corresponding demuxer options."},{"names":["-an"],"argument":"(input/output)","description":"As an input option, blocks all audio streams of a file from being filtered or being automatically selected or mapped for any output. See \"-discard\" option to disable streams individually."},{"names":["-acodec"],"argument":"codec (input/output)","description":"Set the audio codec. This is an alias for \"-codec:a\"."},{"names":["-sample_fmt"],"argument":"[:stream_specifier] sample_fmt (output,per-stream)","description":"Set the audio sample format. Use \"-sample_fmts\" to get a list of supported sample formats."},{"names":["-af"],"argument":"filtergraph (output)","description":"Create the filtergraph specified by filtergraph and use it to filter the stream."},{"names":["-atag"],"argument":"fourcc/tag (output)","description":"Force audio tag/fourcc. This is an alias for \"-tag:a\"."},{"names":["-absf"],"argument":"bitstream_filter","description":"Deprecated, see -bsf"},{"names":["-guess_layout_max"],"argument":"channels (input,per-stream)","description":"If some input channel layout is not known, try to guess only if it corresponds to at most the specified number of channels. For example, 2 tells to ffmpeg to recognize 1 channel as mono and 2 channels as stereo but not 6 channels as 5.1. The default is to always try to guess. Use 0 to disable all guessing."},{"names":["-scodec"],"argument":"codec (input/output)","description":"Set the subtitle codec. This is an alias for \"-codec:s\"."},{"names":["-sn"],"argument":"(input/output)","description":"As an input option, blocks all subtitle streams of a file from being filtered or being automatically selected or mapped for any output. See \"-discard\" option to disable streams individually."},{"names":["-sbsf"],"argument":"bitstream_filter","description":"Deprecated, see -bsf"},{"names":["-fix_sub_duration"],"argument":"","description":"Fix subtitles durations. For each subtitle, wait for the next packet in the same stream and adjust the duration of the first to avoid overlap. This is necessary with some subtitles codecs, especially DVB subtitles, because the duration in the original packet is only a rough estimate and the end is actually marked by an empty subtitle frame. Failing to use this option when necessary can result in exaggerated durations or muxing failures due to non-monotonic timestamps."},{"names":["-canvas_size"],"argument":"size","description":"Set the size of the canvas used to render subtitles."},{"names":["-ignore_unknown"],"argument":"","description":"Ignore input streams with unknown type instead of failing if copying such streams is attempted."},{"names":["-copy_unknown"],"argument":"","description":"Allow input streams with unknown type to be copied instead of failing if copying such streams is attempted."},{"names":["-map_channel"],"argument":"[input_file_id.stream_specifier.channel_id|-1][?][:output_file_id.stream_specifier]","description":"Map an audio channel from a given input to an output. If output_file_id.stream_specifier is not set, the audio channel will be mapped on all the audio streams."},{"names":["-map_metadata"],"argument":"[:metadata_spec_out] infile[:metadata_spec_in] (output,per-metadata)","description":"Set metadata information of the next output file from infile. Note that those are file indices (zero-based), not filenames. Optional metadata_spec_in/out parameters specify, which metadata to copy. A metadata specifier can have the following forms:"},{"names":["-map_chapters"],"argument":"input_file_index (output)","description":"Copy chapters from input file with index input_file_index to the next output file. If no chapter mapping is specified, then chapters are copied from the first input file with at least one chapter. Use a negative file index to disable any chapter copying."},{"names":["-benchmark"],"argument":"(global)","description":"Show benchmarking information at the end of an encode. Shows real, system and user time used and maximum memory consumption. Maximum memory consumption is not supported on all systems, it will usually display as 0 if not supported."},{"names":["-benchmark_all"],"argument":"(global)","description":"Show benchmarking information during the encode. Shows real, system and user time used in various steps (audio/video encode/decode)."},{"names":["-timelimit"],"argument":"duration (global)","description":"Exit after ffmpeg has been running for duration seconds."},{"names":["-dump"],"argument":"(global)","description":"Dump each input packet to stderr."},{"names":["-hex"],"argument":"(global)","description":"When dumping packets, also dump the payload."},{"names":["-re"],"argument":"(input)","description":"Read input at native frame rate. Mainly used to simulate a grab device, or live input stream (e.g. when reading from a file). Should not be used with actual grab devices or live input streams (where it can cause packet loss). By default ffmpeg attempts to read the input(s) as fast as possible. This option will slow down the reading of the input(s) to the native frame rate of the input(s). It is useful for real-time output (e.g. live streaming)."},{"names":["-vsync"],"argument":"parameter","description":"Video sync method. For compatibility reasons old values can be specified as numbers. Newly added values will have to be specified as strings always."},{"names":["-frame_drop_threshold"],"argument":"parameter","description":"Frame drop threshold, which specifies how much behind video frames can be before they are dropped. In frame rate units, so 1.0 is one frame. The default is -1.1. One possible usecase is to avoid framedrops in case of noisy timestamps or to increase frame drop precision in case of exact timestamps."},{"names":["-async"],"argument":"samples_per_second","description":"Audio sync method. \"Stretches/squeezes\" the audio stream to match the timestamps, the parameter is the maximum samples per second by which the audio is changed. -async 1 is a special case where only the start of the audio stream is corrected without any later correction."},{"names":["-copyts"],"argument":"","description":"Do not process input timestamps, but keep their values without trying to sanitize them. In particular, do not remove the initial start time offset value."},{"names":["-start_at_zero"],"argument":"","description":"When used with copyts, shift input timestamps so they start at zero."},{"names":["-copytb"],"argument":"mode","description":"Specify how to set the encoder timebase when stream copying. mode is an integer numeric value, and can assume one of the following values:"},{"names":["-enc_time_base"],"argument":"[:stream_specifier] timebase (output,per-stream)","description":"Set the encoder timebase. timebase is a floating point number, and can assume one of the following values:"},{"names":["-bitexact"],"argument":"(input/output)","description":"Enable bitexact mode for (de)muxer and (de/en)coder"},{"names":["-shortest"],"argument":"(output)","description":"Finish encoding when the shortest input stream ends."},{"names":["-dts_delta_threshold"],"argument":"","description":"Timestamp discontinuity delta threshold."},{"names":["-muxdelay"],"argument":"seconds (output)","description":"Set the maximum demux-decode delay."},{"names":["-muxpreload"],"argument":"seconds (output)","description":"Set the initial demux-decode delay."},{"names":["-streamid"],"argument":"output-stream-index:new-value (output)","description":"Assign a new stream-id value to an output stream. This option should be specified prior to the output filename to which it applies. For the situation where multiple output files exist, a streamid may be reassigned to a different value."},{"names":["-bsf"],"argument":"[:stream_specifier] bitstream_filters (output,per-stream)","description":"Set bitstream filters for matching streams. bitstream_filters is a comma-separated list of bitstream filters. Use the \"-bsfs\" option to get the list of bitstream filters."},{"names":["-tag"],"argument":"[:stream_specifier] codec_tag (input/output,per-stream)","description":"Force a tag/fourcc for matching streams."},{"names":["-timecode"],"argument":"hh:mm:ssSEPff","description":"Specify Timecode for writing. SEP is ':' for non drop timecode and ';' (or '.') for drop."},{"names":["-filter_complex"],"argument":"filtergraph (global)","description":"Define a complex filtergraph, i.e. one with arbitrary number of inputs and/or outputs. For simple graphs -- those with one input and one output of the same type -- see the -filter options. filtergraph is a description of the filtergraph, as described in the ``Filtergraph syntax'' section of the ffmpeg-filters manual."},{"names":["-filter_complex_threads"],"argument":"nb_threads (global)","description":"Defines how many threads are used to process a filter_complex graph. Similar to filter_threads but used for \"-filter_complex\" graphs only. The default is the number of available CPUs."},{"names":["-lavfi"],"argument":"filtergraph (global)","description":"Define a complex filtergraph, i.e. one with arbitrary number of inputs and/or outputs. Equivalent to -filter_complex."},{"names":["-filter_complex_script"],"argument":"filename (global)","description":"This option is similar to -filter_complex, the only difference is that its argument is the name of the file from which a complex filtergraph description is to be read."},{"names":["-accurate_seek"],"argument":"(input)","description":"This option enables or disables accurate seeking in input files with the -ss option. It is enabled by default, so seeking is accurate when transcoding. Use -noaccurate_seek to disable it, which may be useful e.g. when copying some streams and transcoding the others."},{"names":["-seek_timestamp"],"argument":"(input)","description":"This option enables or disables seeking by timestamp in input files with the -ss option. It is disabled by default. If enabled, the argument to the -ss option is considered an actual timestamp, and is not offset by the start time of the file. This matters only for files which do not start from timestamp 0, such as transport streams."},{"names":["-thread_queue_size"],"argument":"size (input)","description":"This option sets the maximum number of queued packets when reading from the file or device. With low latency / high rate live streams, packets may be discarded if they are not read in a timely manner; raising this value can avoid it."},{"names":["-sdp_file"],"argument":"file (global)","description":"Print sdp information for an output stream to file. This allows dumping sdp information when at least one output isn't an rtp stream. (Requires at least one of the output formats to be rtp)."},{"names":["-discard"],"argument":"(input)","description":"Allows discarding specific streams or frames from streams. Any input stream can be fully discarded, using value \"all\" whereas selective discarding of frames from a stream occurs at the demuxer and is not supported by all demuxers."},{"names":["-abort_on"],"argument":"flags (global)","description":"Stop and abort on various conditions. The following flags are available:"},{"names":["-xerror"],"argument":"(global)","description":"Stop and exit on error"},{"names":["-max_muxing_queue_size"],"argument":"packets (output,per-stream)","description":"When transcoding audio and/or video streams, ffmpeg will not begin writing into the output until it has one packet for each such stream. While waiting for that to happen, packets for other streams are buffered. This option sets the size of this buffer, in packets, for the matching output stream."}],"version":"ffmpeg version 4.2.4-1ubuntu0.1 Copyright (c) 2000-2020 the FFmpeg developers","tldr":"> Video conversion tool.\n> More information: <https://ffmpeg.org>.\n\n- Extract the sound from a video and save it as MP3:\n\n`ffmpeg -i {{video.mp4}} -vn {{sound}}.mp3`\n\n- Convert frames from a video or GIF into individual numbered images:\n\n`ffmpeg -i {{video.mpg|video.gif}} {{frame_%d.png}}`\n\n- Combine numbered images (`frame_1.jpg`, `frame_2.jpg`, etc) into a video or GIF:\n\n`ffmpeg -i {{frame_%d.jpg}} -f image2 {{video.mpg|video.gif}}`\n\n- Quickly extract a single frame from a video at time mm:ss and save it as a 128x128 resolution image:\n\n`ffmpeg -ss {{mm:ss}} -i {{video.mp4}} -frames 1 -s {{128x128}} -f image2 {{image.png}}`\n\n- Trim a video from a given start time mm:ss to an end time mm2:ss2 (omit the -to flag to trim till the end):\n\n`ffmpeg -ss {{mm:ss}} -to {{mm2:ss2}} -i {{video.mp4}} -codec copy {{output.mp4}}`\n\n- Convert AVI video to MP4. AAC Audio @ 128kbit, h264 Video @ CRF 23:\n\n`ffmpeg -i {{input_video}}.avi -codec:audio aac -b:audio 128k -codec:video libx264 -crf 23 {{output_video}}.mp4`\n\n- Remux MKV video to MP4 without re-encoding audio or video streams:\n\n`ffmpeg -i {{input_video}}.mkv -codec copy {{output_video}}.mp4`\n\n- Convert MP4 video to VP9 codec. For the best quality, use a CRF value (recommended range 15-35) and -b:video MUST be 0:\n\n`ffmpeg -i {{input_video}}.mp4 -codec:video libvpx-vp9 -crf {{30}} -b:video 0 -codec:audio libopus -vbr on -threads {{number_of_threads}} {{output_video}}.webm`\n"}
