{"name":"git","description":"git","options":[],"subcommands":[{"name":"clone","description":"Clone a repository into a new directory","options":[{"names":["-l","--local"],"argument":"","description":"When the repository to clone from is on a local machine, this flag bypasses the normal \"Git aware\" transport mechanism and clones the repository by making a copy of HEAD and everything under objects and refs directories. The files under .git/objects/ directory are hardlinked to save space when possible."},{"names":["--no-hardlinks"],"argument":"","description":"Force the cloning process from a repository on a local filesystem to copy the files under the .git/objects directory instead of using hardlinks. This may be desirable if you are trying to make a back-up of your repository."},{"names":["-s","--shared"],"argument":"","description":"When the repository to clone is on the local machine, instead of using hard links, automatically setup .git/objects/info/alternates to share the objects with the source repository. The resulting repository starts out without any object of its own."},{"names":["--reference"],"argument":"[-if-able] <repository>","description":"If the reference repository is on the local machine, automatically setup .git/objects/info/alternates to obtain objects from the reference repository. Using an already existing repository as an alternate will require fewer objects to be copied from the repository being cloned, reducing network and local storage costs. When using the --reference-if-able, a non existing directory is skipped with a warning instead of aborting the clone."},{"names":["--dissociate"],"argument":"","description":"Borrow the objects from reference repositories specified with the --reference options only to reduce network transfer, and stop borrowing from them after a clone is made by making necessary local copies of borrowed objects. This option can also be used when cloning locally from a repository that already borrows objects from another repository—the new repository will borrow objects from the same repository, and this option can be used to stop the borrowing."},{"names":["-q","--quiet"],"argument":"","description":"Operate quietly. Progress is not reported to the standard error stream."},{"names":["-v","--verbose"],"argument":"","description":"Run verbosely. Does not affect the reporting of progress status to the standard error stream."},{"names":["--progress"],"argument":"","description":"Progress status is reported on the standard error stream by default when it is attached to a terminal, unless --quiet is specified. This flag forces progress status even if the standard error stream is not directed to a terminal."},{"names":["--server-option"],"argument":"<option>","description":"Transmit the given string to the server when communicating using protocol version 2. The given string must not contain a NUL or LF character. The server’s handling of server options, including unknown ones, is server-specific. When multiple --server-option=<option> are given, they are all sent to the other side in the order listed on the command line."},{"names":["-n","--no-checkout"],"argument":"","description":"No checkout of HEAD is performed after the clone is complete."},{"names":["--reject-shallow"],"argument":"","description":"Fail if the source repository is a shallow repository. The clone.rejectShallow configuration variable can be used to specify the default."},{"names":["--no-reject-shallow"],"argument":"","description":"Fail if the source repository is a shallow repository. The clone.rejectShallow configuration variable can be used to specify the default."},{"names":["--bare"],"argument":"","description":"Make a bare Git repository. That is, instead of creating <directory> and placing the administrative files in <directory>/.git, make the <directory> itself the $GIT_DIR. This obviously implies the --no-checkout because there is nowhere to check out the working tree. Also the branch heads at the remote are copied directly to corresponding local branch heads, without mapping them to refs/remotes/origin/. When this option is used, neither remote-tracking branches nor the related configuration variables are created."},{"names":["--sparse"],"argument":"","description":"Employ a sparse-checkout, with only files in the toplevel directory initially being present. The git-sparse-checkout(1) command can be used to grow the working directory as needed."},{"names":["--filter"],"argument":"<filter-spec>","description":"Use the partial clone feature and request that the server sends a subset of reachable objects according to a given object filter. When using --filter, the supplied <filter-spec> is used for the partial clone filter. For example, --filter=blob:none will filter out all blobs (file contents) until needed by Git. Also, --filter=blob:limit=<size> will filter out all blobs of size at least <size>. For more details on filter specifications, see the --filter option in git-rev-list(1)."},{"names":["--mirror"],"argument":"","description":"Set up a mirror of the source repository. This implies --bare. Compared to --bare, --mirror not only maps local branches of the source to local branches of the target, it maps all refs (including remote-tracking branches, notes etc.) and sets up a refspec configuration such that all these refs are overwritten by a git remote update in the target repository."},{"names":["-o","--origin"],"argument":"<name>","description":"Instead of using the remote name origin to keep track of the upstream repository, use <name>. Overrides clone.defaultRemoteName from the config."},{"names":["-b","--branch"],"argument":"<name>","description":"Instead of pointing the newly created HEAD to the branch pointed to by the cloned repository’s HEAD, point to <name> branch instead. In a non-bare repository, this is the branch that will be checked out. --branch can also take tags and detaches the HEAD at that commit in the resulting repository."},{"names":["-u","--upload-pack"],"argument":"<upload-pack>","description":"When given, and the repository to clone from is accessed via ssh, this specifies a non-default path for the command run on the other end."},{"names":["--template"],"argument":"<template-directory>","description":"Specify the directory from which templates will be used; (See the \"TEMPLATE DIRECTORY\" section of git-init(1).)"},{"names":["-c","--config"],"argument":"<key>=<value>","description":"Set a configuration variable in the newly-created repository; this takes effect immediately after the repository is initialized, but before the remote history is fetched or any files checked out. The key is in the same format as expected by git-config(1) (e.g., core.eol=true). If multiple values are given for the same key, each value will be written to the config file. This makes it safe, for example, to add additional fetch refspecs to the origin remote."},{"names":["--depth"],"argument":"<depth>","description":"Create a shallow clone with a history truncated to the specified number of commits. Implies --single-branch unless --no-single-branch is given to fetch the histories near the tips of all branches. If you want to clone submodules shallowly, also pass --shallow-submodules."},{"names":["--shallow-since"],"argument":"<date>","description":"Create a shallow clone with a history after the specified time."},{"names":["--shallow-exclude"],"argument":"<revision>","description":"Create a shallow clone with a history, excluding commits reachable from a specified remote branch or tag. This option can be specified multiple times."},{"names":["--single-branch"],"argument":"","description":"Clone only the history leading to the tip of a single branch, either specified by the --branch option or the primary branch remote’s HEAD points at. Further fetches into the resulting repository will only update the remote-tracking branch for the branch this option was used for the initial cloning. If the HEAD at the remote did not point at any branch when --single-branch clone was made, no remote-tracking branch is created."},{"names":["--no-single-branch"],"argument":"","description":"Clone only the history leading to the tip of a single branch, either specified by the --branch option or the primary branch remote’s HEAD points at. Further fetches into the resulting repository will only update the remote-tracking branch for the branch this option was used for the initial cloning. If the HEAD at the remote did not point at any branch when --single-branch clone was made, no remote-tracking branch is created."},{"names":["--no-tags"],"argument":"","description":"Don’t clone any tags, and set remote.<remote>.tagOpt=--no-tags in the config, ensuring that future git pull and git fetch operations won’t follow any tags. Subsequent explicit tag fetches will still work, (see git-fetch(1))."},{"names":["--recurse-submodules"],"argument":"[=<pathspec>]","description":"After the clone is created, initialize and clone submodules within based on the provided pathspec. If no pathspec is provided, all submodules are initialized and cloned. This option can be given multiple times for pathspecs consisting of multiple entries. The resulting clone has submodule.active set to the provided pathspec, or \".\" (meaning all submodules) if no pathspec is provided."},{"names":["--shallow-submodules"],"argument":"","description":"All submodules which are cloned will be shallow with a depth of 1."},{"names":["--no-shallow-submodules"],"argument":"","description":"All submodules which are cloned will be shallow with a depth of 1."},{"names":["--remote-submodules"],"argument":"","description":"All submodules which are cloned will use the status of the submodule’s remote-tracking branch to update the submodule, rather than the superproject’s recorded SHA-1. Equivalent to passing --remote to git submodule update."},{"names":["--no-remote-submodules"],"argument":"","description":"All submodules which are cloned will use the status of the submodule’s remote-tracking branch to update the submodule, rather than the superproject’s recorded SHA-1. Equivalent to passing --remote to git submodule update."},{"names":["--separate-git-dir"],"argument":"<git-dir>","description":"Instead of placing the cloned repository where it is supposed to be, place the cloned repository at the specified directory, then make a filesystem-agnostic Git symbolic link to there. The result is Git repository can be separated from working tree."},{"names":["-j","--jobs"],"argument":"<n>","description":"The number of submodules fetched at the same time. Defaults to the submodule.fetchJobs option."}]},{"name":"init","description":"Create an empty Git repository or reinitialize an existing one","options":[{"names":["-q","--quiet"],"argument":"","description":"Only print error and warning messages; all other output will be suppressed."},{"names":["--bare"],"argument":"","description":"Create a bare repository. If GIT_DIR environment is not set, it is set to the current working directory."},{"names":["--object-format"],"argument":"<format>","description":"Specify the given object format (hash algorithm) for the repository. The valid values are sha1 and (if enabled) sha256. sha1 is the default."},{"names":["--template"],"argument":"<template-directory>","description":"Specify the directory from which templates will be used. (See the \"TEMPLATE DIRECTORY\" section below.)"},{"names":["--separate-git-dir"],"argument":"<git-dir>","description":"Instead of initializing the repository as a directory to either $GIT_DIR or ./.git/, create a text file there containing the path to the actual repository. This file acts as filesystem-agnostic Git symbolic link to the repository."},{"names":["-b","--initial-branch"],"argument":"<branch-name>","description":"Use the specified name for the initial branch in the newly created repository. If not specified, fall back to the default name (currently master, but this is subject to change in the future; the name can be customized via the init.defaultBranch configuration variable)."},{"names":["--shared"],"argument":"[=(false|true|umask|group|all|world|everybody|<perm>)]","description":"Specify that the Git repository is to be shared amongst several users. This allows users belonging to the same group to push into that repository. When specified, the config variable \"core.sharedRepository\" is set so that files and directories under $GIT_DIR are created with the requested permissions. When not specified, Git will use permissions reported by umask(2)."}]},{"name":"add","description":"Add file contents to the index","options":[{"names":["-n","--dry-run"],"argument":"","description":"Don’t actually add the file(s), just show if they exist and/or will be ignored."},{"names":["-v","--verbose"],"argument":"","description":"Be verbose."},{"names":["-f","--force"],"argument":"","description":"Allow adding otherwise ignored files."},{"names":["--sparse"],"argument":"","description":"Allow updating index entries outside of the sparse-checkout cone. Normally, git add refuses to update index entries whose paths do not fit within the sparse-checkout cone, since those files might be removed from the working tree without warning. See git-sparse-checkout(1) for more details."},{"names":["-i","--interactive"],"argument":"","description":"Add modified contents in the working tree interactively to the index. Optional path arguments may be supplied to limit operation to a subset of the working tree. See “Interactive mode” for details."},{"names":["-p","--patch"],"argument":"","description":"Interactively choose hunks of patch between the index and the work tree and add them to the index. This gives the user a chance to review the difference before adding modified contents to the index."},{"names":["-e","--edit"],"argument":"","description":"Open the diff vs. the index in an editor and let the user edit it. After the editor was closed, adjust the hunk headers and apply the patch to the index."},{"names":["-u","--update"],"argument":"","description":"Update the index just where it already has an entry matching <pathspec>. This removes as well as modifies index entries to match the working tree, but adds no new files."},{"names":["-A","--all","--no-ignore-removal"],"argument":"","description":"Update the index not only where the working tree has a file matching <pathspec> but also where the index already has an entry. This adds, modifies, and removes index entries to match the working tree."},{"names":["--no-all","--ignore-removal"],"argument":"","description":"Update the index by adding new files that are unknown to the index and files modified in the working tree, but ignore files that have been removed from the working tree. This option is a no-op when no <pathspec> is used."},{"names":["-N","--intent-to-add"],"argument":"","description":"Record only the fact that the path will be added later. An entry for the path is placed in the index with no content. This is useful for, among other things, showing the unstaged content of such files with git diff and committing them with git commit -a."},{"names":["--refresh"],"argument":"","description":"Don’t add the file(s), but only refresh their stat() information in the index."},{"names":["--ignore-errors"],"argument":"","description":"If some files could not be added because of errors indexing them, do not abort the operation, but continue adding the others. The command shall still exit with non-zero status. The configuration variable add.ignoreErrors can be set to true to make this the default behaviour."},{"names":["--ignore-missing"],"argument":"","description":"This option can only be used together with --dry-run. By using this option the user can check if any of the given files would be ignored, no matter if they are already present in the work tree or not."},{"names":["--no-warn-embedded-repo"],"argument":"","description":"By default, git add will warn when adding an embedded repository to the index without using git submodule add to create an entry in .gitmodules. This option will suppress the warning (e.g., if you are manually performing operations on submodules)."},{"names":["--renormalize"],"argument":"","description":"Apply the \"clean\" process freshly to all tracked files to forcibly add them again to the index. This is useful after changing core.autocrlf configuration or the text attribute in order to correct files added with wrong CRLF/LF line endings. This option implies -u."},{"names":["--chmod"],"argument":"(+|-)x","description":"Override the executable bit of the added files. The executable bit is only changed in the index, the files on disk are left unchanged."},{"names":["--pathspec-from-file"],"argument":"<file>","description":"Pathspec is passed in <file> instead of commandline args. If <file> is exactly - then standard input is used. Pathspec elements are separated by LF or CR/LF. Pathspec elements can be quoted as explained for the configuration variable core.quotePath (see git-config(1)). See also --pathspec-file-nul and global --literal-pathspecs."},{"names":["--pathspec-file-nul"],"argument":"","description":"Only meaningful with --pathspec-from-file. Pathspec elements are separated with NUL character and all other characters are taken literally (including newlines and quotes)."},{"names":["--"],"argument":"","description":"This option can be used to separate command-line options from the list of files, (useful when filenames might be mistaken for command-line options)."}]},{"name":"mv","description":"Move or rename a file, a directory, or a symlink","options":[{"names":["-f","--force"],"argument":"","description":"Force renaming or moving of a file even if the target exists"},{"names":["-k"],"argument":"","description":"Skip move or rename actions which would lead to an error condition. An error happens when a source is neither existing nor controlled by Git, or when it would overwrite an existing file unless -f is given."},{"names":["-n","--dry-run"],"argument":"","description":"Do nothing; only show what would happen"},{"names":["-v","--verbose"],"argument":"","description":"Report the names of files as they are moved."}]},{"name":"restore","description":"Restore working tree files","options":[{"names":["-s","--source"],"argument":"<tree>","description":"Restore the working tree files with the content from the given tree. It is common to specify the source tree by naming a commit, branch or tag associated with it."},{"names":["-p","--patch"],"argument":"","description":"Interactively select hunks in the difference between the restore source and the restore location. See the “Interactive Mode” section of git-add(1) to learn how to operate the --patch mode."},{"names":["-W","--worktree","-S","--staged"],"argument":"","description":"Specify the restore location. If neither option is specified, by default the working tree is restored. Specifying --staged will only restore the index. Specifying both restores both."},{"names":["-q","--quiet"],"argument":"","description":"Quiet, suppress feedback messages. Implies --no-progress."},{"names":["--progress","--no-progress"],"argument":"","description":"Progress status is reported on the standard error stream by default when it is attached to a terminal, unless --quiet is specified. This flag enables progress reporting even if not attached to a terminal, regardless of --quiet."},{"names":["--ours","--theirs"],"argument":"","description":"When restoring files in the working tree from the index, use stage #2 (ours) or #3 (theirs) for unmerged paths."},{"names":["-m","--merge"],"argument":"","description":"When restoring files on the working tree from the index, recreate the conflicted merge in the unmerged paths."},{"names":["--conflict"],"argument":"<style>","description":"The same as --merge option above, but changes the way the conflicting hunks are presented, overriding the merge.conflictStyle configuration variable. Possible values are \"merge\" (default), \"diff3\", and \"zdiff3\"."},{"names":["--ignore-unmerged"],"argument":"","description":"When restoring files on the working tree from the index, do not abort the operation if there are unmerged entries and neither --ours, --theirs, --merge or --conflict is specified. Unmerged paths on the working tree are left alone."},{"names":["--ignore-skip-worktree-bits"],"argument":"","description":"In sparse checkout mode, by default is to only update entries matched by <pathspec> and sparse patterns in $GIT_DIR/info/sparse-checkout. This option ignores the sparse patterns and unconditionally restores any files in <pathspec>."},{"names":["--recurse-submodules","--no-recurse-submodules"],"argument":"","description":"If <pathspec> names an active submodule and the restore location includes the working tree, the submodule will only be updated if this option is given, in which case its working tree will be restored to the commit recorded in the superproject, and any local modifications overwritten. If nothing (or --no-recurse-submodules) is used, submodules working trees will not be updated. Just like git-checkout(1), this will detach HEAD of the submodule."},{"names":["--overlay","--no-overlay"],"argument":"","description":"In overlay mode, the command never removes files when restoring. In no-overlay mode, tracked files that do not appear in the --source tree are removed, to make them match <tree> exactly. The default is no-overlay mode."},{"names":["--pathspec-from-file"],"argument":"<file>","description":"Pathspec is passed in <file> instead of commandline args. If <file> is exactly - then standard input is used. Pathspec elements are separated by LF or CR/LF. Pathspec elements can be quoted as explained for the configuration variable core.quotePath (see git-config(1)). See also --pathspec-file-nul and global --literal-pathspecs."},{"names":["--pathspec-file-nul"],"argument":"","description":"Only meaningful with --pathspec-from-file. Pathspec elements are separated with NUL character and all other characters are taken literally (including newlines and quotes)."},{"names":["--"],"argument":"","description":"Do not interpret any more arguments as options."}]},{"name":"rm","description":"Remove files from the working tree and from the index","options":[{"names":["-f","--force"],"argument":"","description":"Override the up-to-date check."},{"names":["-n","--dry-run"],"argument":"","description":"Don’t actually remove any file(s). Instead, just show if they exist in the index and would otherwise be removed by the command."},{"names":["-r"],"argument":"","description":"Allow recursive removal when a leading directory name is given."},{"names":["--"],"argument":"","description":"This option can be used to separate command-line options from the list of files, (useful when filenames might be mistaken for command-line options)."},{"names":["--cached"],"argument":"","description":"Use this option to unstage and remove paths only from the index. Working tree files, whether modified or not, will be left alone."},{"names":["--ignore-unmatch"],"argument":"","description":"Exit with a zero status even if no files matched."},{"names":["--sparse"],"argument":"","description":"Allow updating index entries outside of the sparse-checkout cone. Normally, git rm refuses to update index entries whose paths do not fit within the sparse-checkout cone. See git-sparse-checkout(1) for more."},{"names":["-q","--quiet"],"argument":"","description":"git rm normally outputs one line (in the form of an rm command) for each file removed. This option suppresses that output."},{"names":["--pathspec-from-file"],"argument":"<file>","description":"Pathspec is passed in <file> instead of commandline args. If <file> is exactly - then standard input is used. Pathspec elements are separated by LF or CR/LF. Pathspec elements can be quoted as explained for the configuration variable core.quotePath (see git-config(1)). See also --pathspec-file-nul and global --literal-pathspecs."},{"names":["--pathspec-file-nul"],"argument":"","description":"Only meaningful with --pathspec-from-file. Pathspec elements are separated with NUL character and all other characters are taken literally (including newlines and quotes)."}]},{"name":"bisect","description":"Use binary search to find the commit that introduced a bug","options":[{"names":["--no-checkout"],"argument":"","description":"Do not checkout the new working tree at each iteration of the bisection process. Instead just update a special reference named BISECT_HEAD to make it point to the commit that should be tested."},{"names":["--first-parent"],"argument":"","description":"Follow only the first parent commit upon seeing a merge commit."}]},{"name":"diff","description":"Show changes between commits, commit and working tree, etc","options":[{"names":["-p","-u","--patch"],"argument":"","description":"Generate patch (see section on generating patches). This is the default."},{"names":["-s","--no-patch"],"argument":"","description":"Suppress diff output. Useful for commands like git show that show the patch by default, or to cancel the effect of --patch."},{"names":["-U","--unified"],"argument":"<n>","description":"Generate diffs with <n> lines of context instead of the usual three. Implies --patch."},{"names":["--output"],"argument":"<file>","description":"Output to a specific file instead of stdout."},{"names":["--output-indicator-new","--output-indicator-old","--output-indicator-context"],"argument":"<char>","description":"Specify the character used to indicate new, old or context lines in the generated patch. Normally they are +, - and ' ' respectively."},{"names":["--raw"],"argument":"","description":"Generate the diff in raw format."},{"names":["--patch-with-raw"],"argument":"","description":"Synonym for -p --raw."},{"names":["--indent-heuristic"],"argument":"","description":"Enable the heuristic that shifts diff hunk boundaries to make patches easier to read. This is the default."},{"names":["--no-indent-heuristic"],"argument":"","description":"Disable the indent heuristic."},{"names":["--minimal"],"argument":"","description":"Spend extra time to make sure the smallest possible diff is produced."},{"names":["--patience"],"argument":"","description":"Generate a diff using the \"patience diff\" algorithm."},{"names":["--histogram"],"argument":"","description":"Generate a diff using the \"histogram diff\" algorithm."},{"names":["--anchored"],"argument":"<text>","description":"Generate a diff using the \"anchored diff\" algorithm."},{"names":["--diff-algorithm"],"argument":"{patience|minimal|histogram|myers}","description":"Choose a diff algorithm. The variants are as follows:"},{"names":["--stat"],"argument":"[=<width>[,<name-width>[,<count>]]]","description":"Generate a diffstat. By default, as much space as necessary will be used for the filename part, and the rest for the graph part. Maximum width defaults to terminal width, or 80 columns if not connected to a terminal, and can be overridden by <width>. The width of the filename part can be limited by giving another width <name-width> after a comma. The width of the graph part can be limited by using --stat-graph-width=<width> (affects all commands generating a stat graph) or by setting diff.statGraphWidth=<width> (does not affect git format-patch). By giving a third parameter <count>, you can limit the output to the first <count> lines, followed by ... if there are more."},{"names":["--compact-summary"],"argument":"","description":"Output a condensed summary of extended header information such as file creations or deletions (\"new\" or \"gone\", optionally \"+l\" if it’s a symlink) and mode changes (\"+x\" or \"-x\" for adding or removing executable bit respectively) in diffstat. The information is put between the filename part and the graph part. Implies --stat."},{"names":["--numstat"],"argument":"","description":"Similar to --stat, but shows number of added and deleted lines in decimal notation and pathname without abbreviation, to make it more machine friendly. For binary files, outputs two - instead of saying 0 0."},{"names":["--shortstat"],"argument":"","description":"Output only the last line of the --stat format containing total number of modified files, as well as number of added and deleted lines."},{"names":["-X","--dirstat"],"argument":"[<param1,param2,...>]","description":"Output the distribution of relative amount of changes for each sub-directory. The behavior of --dirstat can be customized by passing it a comma separated list of parameters. The defaults are controlled by the diff.dirstat configuration variable (see git-config(1)). The following parameters are available:"},{"names":["--cumulative"],"argument":"","description":"Synonym for --dirstat=cumulative"},{"names":["--dirstat-by-file"],"argument":"[=<param1,param2>...]","description":"Synonym for --dirstat=files,param1,param2..."},{"names":["--summary"],"argument":"","description":"Output a condensed summary of extended header information such as creations, renames and mode changes."},{"names":["--patch-with-stat"],"argument":"","description":"Synonym for -p --stat."},{"names":["-z"],"argument":"","description":"When --raw, --numstat, --name-only or --name-status has been given, do not munge pathnames and use NULs as output field terminators."},{"names":["--name-only"],"argument":"","description":"Show only names of changed files. The file names are often encoded in UTF-8. For more information see the discussion about encoding in the git-log(1) manual page."},{"names":["--name-status"],"argument":"","description":"Show only names and status of changed files. See the description of the --diff-filter option on what the status letters mean. Just like --name-only the file names are often encoded in UTF-8."},{"names":["--submodule"],"argument":"[=<format>]","description":"Specify how differences in submodules are shown. When specifying --submodule=short the short format is used. This format just shows the names of the commits at the beginning and end of the range. When --submodule or --submodule=log is specified, the log format is used. This format lists the commits in the range like git-submodule(1) summary does. When --submodule=diff is specified, the diff format is used. This format shows an inline diff of the changes in the submodule contents between the commit range. Defaults to diff.submodule or the short format if the config option is unset."},{"names":["--color"],"argument":"[=<when>]","description":"Show colored diff. --color (i.e. without =<when>) is the same as --color=always. <when> can be one of always, never, or auto. It can be changed by the color.ui and color.diff configuration settings."},{"names":["--no-color"],"argument":"","description":"Turn off colored diff. This can be used to override configuration settings. It is the same as --color=never."},{"names":["--color-moved"],"argument":"[=<mode>]","description":"Moved lines of code are colored differently. It can be changed by the diff.colorMoved configuration setting. The <mode> defaults to no if the option is not given and to zebra if the option with no mode is given. The mode must be one of:"},{"names":["--no-color-moved"],"argument":"","description":"Turn off move detection. This can be used to override configuration settings. It is the same as --color-moved=no."},{"names":["--color-moved-ws"],"argument":"<modes>","description":"This configures how whitespace is ignored when performing the move detection for --color-moved. It can be set by the diff.colorMovedWS configuration setting. These modes can be given as a comma separated list:"},{"names":["--no-color-moved-ws"],"argument":"","description":"Do not ignore whitespace when performing move detection. This can be used to override configuration settings. It is the same as --color-moved-ws=no."},{"names":["--word-diff"],"argument":"[=<mode>]","description":"Show a word diff, using the <mode> to delimit changed words. By default, words are delimited by whitespace; see --word-diff-regex below. The <mode> defaults to plain, and must be one of:"},{"names":["--word-diff-regex"],"argument":"<regex>","description":"Use <regex> to decide what a word is, instead of considering runs of non-whitespace to be a word. Also implies --word-diff unless it was already enabled."},{"names":["--color-words"],"argument":"[=<regex>]","description":"Equivalent to --word-diff=color plus (if a regex was specified) --word-diff-regex=<regex>."},{"names":["--no-renames"],"argument":"","description":"Turn off rename detection, even when the configuration file gives the default to do so."},{"names":["--rename-empty"],"argument":"","description":"Whether to use empty blobs as rename source."},{"names":["--no-rename-empty"],"argument":"","description":"Whether to use empty blobs as rename source."},{"names":["--check"],"argument":"","description":"Warn if changes introduce conflict markers or whitespace errors. What are considered whitespace errors is controlled by core.whitespace configuration. By default, trailing whitespaces (including lines that consist solely of whitespaces) and a space character that is immediately followed by a tab character inside the initial indent of the line are considered whitespace errors. Exits with non-zero status if problems are found. Not compatible with --exit-code."},{"names":["--ws-error-highlight"],"argument":"<kind>","description":"Highlight whitespace errors in the context, old or new lines of the diff. Multiple values are separated by comma, none resets previous values, default reset the list to new and all is a shorthand for old,new,context. When this option is not given, and the configuration variable diff.wsErrorHighlight is not set, only whitespace errors in new lines are highlighted. The whitespace errors are colored with color.diff.whitespace."},{"names":["--full-index"],"argument":"","description":"Instead of the first handful of characters, show the full pre- and post-image blob object names on the \"index\" line when generating patch format output."},{"names":["--binary"],"argument":"","description":"In addition to --full-index, output a binary diff that can be applied with git-apply. Implies --patch."},{"names":["--abbrev"],"argument":"[=<n>]","description":"Instead of showing the full 40-byte hexadecimal object name in diff-raw format output and diff-tree header lines, show the shortest prefix that is at least <n> hexdigits long that uniquely refers the object. In diff-patch output format, --full-index takes higher precedence, i.e. if --full-index is specified, full blob names will be shown regardless of --abbrev. Non default number of digits can be specified with --abbrev=<n>."},{"names":["-B","--break-rewrites"],"argument":"[<n>][/<m>]","description":"Break complete rewrite changes into pairs of delete and create. This serves two purposes:"},{"names":["-M","--find-renames"],"argument":"[<n>]","description":"Detect renames. If n is specified, it is a threshold on the similarity index (i.e. amount of addition/deletions compared to the file’s size). For example, -M90% means Git should consider a delete/add pair to be a rename if more than 90% of the file hasn’t changed. Without a % sign, the number is to be read as a fraction, with a decimal point before it. I.e., -M5 becomes 0.5, and is thus the same as -M50%. Similarly, -M05 is the same as -M5%. To limit detection to exact renames, use -M100%. The default similarity index is 50%."},{"names":["-C","--find-copies"],"argument":"[<n>]","description":"Detect copies as well as renames. See also --find-copies-harder. If n is specified, it has the same meaning as for -M<n>."},{"names":["--find-copies-harder"],"argument":"","description":"For performance reasons, by default, -C option finds copies only if the original file of the copy was modified in the same changeset. This flag makes the command inspect unmodified files as candidates for the source of copy. This is a very expensive operation for large projects, so use it with caution. Giving more than one -C option has the same effect."},{"names":["-D","--irreversible-delete"],"argument":"","description":"Omit the preimage for deletes, i.e. print only the header but not the diff between the preimage and /dev/null. The resulting patch is not meant to be applied with patch or git apply; this is solely for people who want to just concentrate on reviewing the text after the change. In addition, the output obviously lacks enough information to apply such a patch in reverse, even manually, hence the name of the option."},{"names":["-l"],"argument":"<num>","description":"The -M and -C options involve some preliminary steps that can detect subsets of renames/copies cheaply, followed by an exhaustive fallback portion that compares all remaining unpaired destinations to all relevant sources. (For renames, only remaining unpaired sources are relevant; for copies, all original sources are relevant.) For N sources and destinations, this exhaustive check is O(N^2). This option prevents the exhaustive portion of rename/copy detection from running if the number of source/destination files involved exceeds the specified number. Defaults to diff.renameLimit. Note that a value of 0 is treated as unlimited."},{"names":["--diff-filter"],"argument":"[(A|C|D|M|R|T|U|X|B)...[*]]","description":"Select only files that are Added (A), Copied (C), Deleted (D), Modified (M), Renamed (R), have their type (i.e. regular file, symlink, submodule, ...) changed (T), are Unmerged (U), are Unknown (X), or have had their pairing Broken (B). Any combination of the filter characters (including none) can be used. When * (All-or-none) is added to the combination, all paths are selected if there is any file that matches other criteria in the comparison; if there is no file that matches other criteria, nothing is selected."},{"names":["-S"],"argument":"<string>","description":"Look for differences that change the number of occurrences of the specified string (i.e. addition/deletion) in a file. Intended for the scripter’s use."},{"names":["-G"],"argument":"<regex>","description":"Look for differences whose patch text contains added/removed lines that match <regex>."},{"names":["--find-object"],"argument":"<object-id>","description":"Look for differences that change the number of occurrences of the specified object. Similar to -S, just the argument is different in that it doesn’t search for a specific string but for a specific object id."},{"names":["--pickaxe-all"],"argument":"","description":"When -S or -G finds a change, show all the changes in that changeset, not just the files that contain the change in <string>."},{"names":["--pickaxe-regex"],"argument":"","description":"Treat the <string> given to -S as an extended POSIX regular expression to match."},{"names":["-O"],"argument":"<orderfile>","description":"Control the order in which files appear in the output. This overrides the diff.orderFile configuration variable (see git-config(1)). To cancel diff.orderFile, use -O/dev/null."},{"names":["--skip-to","--rotate-to"],"argument":"<file>","description":"Discard the files before the named <file> from the output (i.e. skip to), or move them to the end of the output (i.e. rotate to). These were invented primarily for use of the git difftool command, and may not be very useful otherwise."},{"names":["-R"],"argument":"","description":"Swap two inputs; that is, show differences from index or on-disk file to tree contents."},{"names":["--relative","--no-relative"],"argument":"[=<path>]","description":"When run from a subdirectory of the project, it can be told to exclude changes outside the directory and show pathnames relative to it with this option. When you are not in a subdirectory (e.g. in a bare repository), you can name which subdirectory to make the output relative to by giving a <path> as an argument. --no-relative can be used to countermand both diff.relative config option and previous --relative."},{"names":["-a","--text"],"argument":"","description":"Treat all files as text."},{"names":["--ignore-cr-at-eol"],"argument":"","description":"Ignore carriage-return at the end of line when doing a comparison."},{"names":["--ignore-space-at-eol"],"argument":"","description":"Ignore changes in whitespace at EOL."},{"names":["-b","--ignore-space-change"],"argument":"","description":"Ignore changes in amount of whitespace. This ignores whitespace at line end, and considers all other sequences of one or more whitespace characters to be equivalent."},{"names":["-w","--ignore-all-space"],"argument":"","description":"Ignore whitespace when comparing lines. This ignores differences even if one line has whitespace where the other line has none."},{"names":["--ignore-blank-lines"],"argument":"","description":"Ignore changes whose lines are all blank."},{"names":["-I","--ignore-matching-lines"],"argument":"<regex>","description":"Ignore changes whose all lines match <regex>. This option may be specified more than once."},{"names":["--inter-hunk-context"],"argument":"<lines>","description":"Show the context between diff hunks, up to the specified number of lines, thereby fusing hunks that are close to each other. Defaults to diff.interHunkContext or 0 if the config option is unset."},{"names":["-W","--function-context"],"argument":"","description":"Show whole function as context lines for each change. The function names are determined in the same way as git diff works out patch hunk headers (see Defining a custom hunk-header in gitattributes(5))."},{"names":["--exit-code"],"argument":"","description":"Make the program exit with codes similar to diff(1). That is, it exits with 1 if there were differences and 0 means no differences."},{"names":["--quiet"],"argument":"","description":"Disable all output of the program. Implies --exit-code."},{"names":["--ext-diff"],"argument":"","description":"Allow an external diff helper to be executed. If you set an external diff driver with gitattributes(5), you need to use this option with git-log(1) and friends."},{"names":["--no-ext-diff"],"argument":"","description":"Disallow external diff drivers."},{"names":["--textconv","--no-textconv"],"argument":"","description":"Allow (or disallow) external text conversion filters to be run when comparing binary files. See gitattributes(5) for details. Because textconv filters are typically a one-way conversion, the resulting diff is suitable for human consumption, but cannot be applied. For this reason, textconv filters are enabled by default only for git-diff(1) and git-log(1), but not for git-format-patch(1) or diff plumbing commands."},{"names":["--ignore-submodules"],"argument":"[=<when>]","description":"Ignore changes to submodules in the diff generation. <when> can be either \"none\", \"untracked\", \"dirty\" or \"all\", which is the default. Using \"none\" will consider the submodule modified when it either contains untracked or modified files or its HEAD differs from the commit recorded in the superproject and can be used to override any settings of the ignore option in git-config(1) or gitmodules(5). When \"untracked\" is used submodules are not considered dirty when they only contain untracked content (but they are still scanned for modified content). Using \"dirty\" ignores all changes to the work tree of submodules, only changes to the commits stored in the superproject are shown (this was the behavior until 1.7.0). Using \"all\" hides all changes to submodules."},{"names":["--src-prefix"],"argument":"<prefix>","description":"Show the given source prefix instead of \"a/\"."},{"names":["--dst-prefix"],"argument":"<prefix>","description":"Show the given destination prefix instead of \"b/\"."},{"names":["--no-prefix"],"argument":"","description":"Do not show any source or destination prefix."},{"names":["--line-prefix"],"argument":"<prefix>","description":"Prepend an additional prefix to every line of output."},{"names":["--ita-invisible-in-index"],"argument":"","description":"By default entries added by \"git add -N\" appear as an existing empty file in \"git diff\" and a new file in \"git diff --cached\". This option makes the entry appear as a new file in \"git diff\" and non-existent in \"git diff --cached\". This option could be reverted with --ita-visible-in-index. Both options are experimental and could be removed in future."},{"names":["-1","--base","-2","--ours","-3","--theirs"],"argument":"","description":"Compare the working tree with the \"base\" version (stage #1), \"our branch\" (stage #2) or \"their branch\" (stage #3). The index contains these stages only for unmerged entries i.e. while resolving conflicts. See git-read-tree(1) section \"3-Way Merge\" for detailed information."},{"names":["-0"],"argument":"","description":"Omit diff output for unmerged entries and just show \"Unmerged\". Can be used only when comparing the working tree with the index."}]},{"name":"grep","description":"Print lines matching a pattern","options":[{"names":["--cached"],"argument":"","description":"Instead of searching tracked files in the working tree, search blobs registered in the index file."},{"names":["--no-index"],"argument":"","description":"Search files in the current directory that is not managed by Git."},{"names":["--untracked"],"argument":"","description":"In addition to searching in the tracked files in the working tree, search also in untracked files."},{"names":["--no-exclude-standard"],"argument":"","description":"Also search in ignored files by not honoring the .gitignore mechanism. Only useful with --untracked."},{"names":["--exclude-standard"],"argument":"","description":"Do not pay attention to ignored files specified via the .gitignore mechanism. Only useful when searching files in the current directory with --no-index."},{"names":["--recurse-submodules"],"argument":"","description":"Recursively search in each submodule that is active and checked out in the repository. When used in combination with the <tree> option the prefix of all submodule output will be the name of the parent project’s <tree> object. This option has no effect if --no-index is given."},{"names":["-a","--text"],"argument":"","description":"Process binary files as if they were text."},{"names":["--textconv"],"argument":"","description":"Honor textconv filter settings."},{"names":["--no-textconv"],"argument":"","description":"Do not honor textconv filter settings. This is the default."},{"names":["-i","--ignore-case"],"argument":"","description":"Ignore case differences between the patterns and the files."},{"names":["-I"],"argument":"","description":"Don’t match the pattern in binary files."},{"names":["--max-depth"],"argument":"<depth>","description":"For each <pathspec> given on command line, descend at most <depth> levels of directories. A value of -1 means no limit. This option is ignored if <pathspec> contains active wildcards. In other words if \"a*\" matches a directory named \"a*\", \"*\" is matched literally so --max-depth is still effective."},{"names":["-r","--recursive"],"argument":"","description":"Same as --max-depth=-1; this is the default."},{"names":["--no-recursive"],"argument":"","description":"Same as --max-depth=0."},{"names":["-w","--word-regexp"],"argument":"","description":"Match the pattern only at word boundary (either begin at the beginning of a line, or preceded by a non-word character; end at the end of a line or followed by a non-word character)."},{"names":["-v","--invert-match"],"argument":"","description":"Select non-matching lines."},{"names":["-h","-H"],"argument":"","description":"By default, the command shows the filename for each match. -h option is used to suppress this output. -H is there for completeness and does not do anything except it overrides -h given earlier on the command line."},{"names":["--full-name"],"argument":"","description":"When run from a subdirectory, the command usually outputs paths relative to the current directory. This option forces paths to be output relative to the project top directory."},{"names":["-E","--extended-regexp","-G","--basic-regexp"],"argument":"","description":"Use POSIX extended/basic regexp for patterns. Default is to use basic regexp."},{"names":["-P","--perl-regexp"],"argument":"","description":"Use Perl-compatible regular expressions for patterns."},{"names":["-F","--fixed-strings"],"argument":"","description":"Use fixed strings for patterns (don’t interpret pattern as a regex)."},{"names":["-n","--line-number"],"argument":"","description":"Prefix the line number to matching lines."},{"names":["--column"],"argument":"","description":"Prefix the 1-indexed byte-offset of the first match from the start of the matching line."},{"names":["-l","--files-with-matches","--name-only","-L","--files-without-match"],"argument":"","description":"Instead of showing every matched line, show only the names of files that contain (or do not contain) matches. For better compatibility with git diff, --name-only is a synonym for --files-with-matches."},{"names":["-O","--open-files-in-pager"],"argument":"[<pager>]","description":"Open the matching files in the pager (not the output of grep). If the pager happens to be \"less\" or \"vi\", and the user specified only one pattern, the first file is positioned at the first match automatically. The pager argument is optional; if specified, it must be stuck to the option without a space. If pager is unspecified, the default pager will be used (see core.pager in git-config(1))."},{"names":["-z","--null"],"argument":"","description":"Use \\0 as the delimiter for pathnames in the output, and print them verbatim. Without this option, pathnames with \"unusual\" characters are quoted as explained for the configuration variable core.quotePath (see git-config(1))."},{"names":["-o","--only-matching"],"argument":"","description":"Print only the matched (non-empty) parts of a matching line, with each such part on a separate output line."},{"names":["-c","--count"],"argument":"","description":"Instead of showing every matched line, show the number of lines that match."},{"names":["--color"],"argument":"[=<when>]","description":"Show colored matches. The value must be always (the default), never, or auto."},{"names":["--no-color"],"argument":"","description":"Turn off match highlighting, even when the configuration file gives the default to color output. Same as --color=never."},{"names":["--break"],"argument":"","description":"Print an empty line between matches from different files."},{"names":["--heading"],"argument":"","description":"Show the filename above the matches in that file instead of at the start of each shown line."},{"names":["-p","--show-function"],"argument":"","description":"Show the preceding line that contains the function name of the match, unless the matching line is a function name itself. The name is determined in the same way as git diff works out patch hunk headers (see Defining a custom hunk-header in gitattributes(5))."},{"names":["-C","--context"],"argument":"<num>","description":"Show <num> leading and trailing lines, and place a line containing -- between contiguous groups of matches."},{"names":["-A","--after-context"],"argument":"<num>","description":"Show <num> trailing lines, and place a line containing -- between contiguous groups of matches."},{"names":["-B","--before-context"],"argument":"<num>","description":"Show <num> leading lines, and place a line containing -- between contiguous groups of matches."},{"names":["-W","--function-context"],"argument":"","description":"Show the surrounding text from the previous line containing a function name up to the one before the next function name, effectively showing the whole function in which the match was found. The function names are determined in the same way as git diff works out patch hunk headers (see Defining a custom hunk-header in gitattributes(5))."},{"names":["--threads"],"argument":"<num>","description":"Number of grep worker threads to use. See grep.threads in CONFIGURATION for more information."},{"names":["-f"],"argument":"<file>","description":"Read patterns from <file>, one per line."},{"names":["-e"],"argument":"","description":"The next parameter is the pattern. This option has to be used for patterns starting with - and should be used in scripts passing user input to grep. Multiple patterns are combined by or."},{"names":["--all-match"],"argument":"","description":"When giving multiple pattern expressions combined with --or, this flag is specified to limit the match to files that have lines to match all of them."},{"names":["-q","--quiet"],"argument":"","description":"Do not output matched lines; instead, exit with status 0 when there is a match and with non-zero status when there isn’t."},{"names":["--"],"argument":"","description":"Signals the end of options; the rest of the parameters are <pathspec> limiters."}]},{"name":"log","description":"Show commit logs","options":[{"names":["--follow"],"argument":"","description":"Continue listing the history of a file beyond renames (works only for a single file)."},{"names":["--no-decorate","--decorate"],"argument":"[=short|full|auto|no]","description":"Print out the ref names of any commits that are shown. If short is specified, the ref name prefixes refs/heads/, refs/tags/ and refs/remotes/ will not be printed. If full is specified, the full ref name (including prefix) will be printed. If auto is specified, then if the output is going to a terminal, the ref names are shown as if short were given, otherwise no ref names are shown. The option --decorate is short-hand for --decorate=short. Default to configuration value of log.decorate if configured, otherwise, auto."},{"names":["--decorate-refs","--decorate-refs-exclude"],"argument":"<pattern>","description":"If no --decorate-refs is given, pretend as if all refs were included. For each candidate, do not use it for decoration if it matches any patterns given to --decorate-refs-exclude or if it doesn’t match any of the patterns given to --decorate-refs. The log.excludeDecoration config option allows excluding refs from the decorations, but an explicit --decorate-refs pattern will override a match in log.excludeDecoration."},{"names":["--source"],"argument":"","description":"Print out the ref name given on the command line by which each commit was reached."},{"names":["--full-diff"],"argument":"","description":"Without this flag, git log -p <path>... shows commits that touch the specified paths, and diffs about the same specified paths. With this, the full diff is shown for commits that touch the specified paths; this means that \"<path>...\" limits only commits, and doesn’t limit diff for those commits."},{"names":["--log-size"],"argument":"","description":"Include a line “log size <number>” in the output for each commit, where <number> is the length of that commit’s message in bytes. Intended to speed up tools that read log messages from git log output by allowing them to allocate space in advance."},{"names":["-n","--max-count"],"argument":"<number>","description":"Limit the number of commits to output."},{"names":["--skip"],"argument":"<number>","description":"Skip number commits before starting to show the commit output."},{"names":["--since","--after"],"argument":"<date>","description":"Show commits more recent than a specific date."},{"names":["--until","--before"],"argument":"<date>","description":"Show commits older than a specific date."},{"names":["--author","--committer"],"argument":"<pattern>","description":"Limit the commits output to ones with author/committer header lines that match the specified pattern (regular expression). With more than one --author=<pattern>, commits whose author matches any of the given patterns are chosen (similarly for multiple --committer=<pattern>)."},{"names":["--grep-reflog"],"argument":"<pattern>","description":"Limit the commits output to ones with reflog entries that match the specified pattern (regular expression). With more than one --grep-reflog, commits whose reflog message matches any of the given patterns are chosen. It is an error to use this option unless --walk-reflogs is in use."},{"names":["--grep"],"argument":"<pattern>","description":"Limit the commits output to ones with log message that matches the specified pattern (regular expression). With more than one --grep=<pattern>, commits whose message matches any of the given patterns are chosen (but see --all-match)."},{"names":["--all-match"],"argument":"","description":"Limit the commits output to ones that match all given --grep, instead of ones that match at least one."},{"names":["--invert-grep"],"argument":"","description":"Limit the commits output to ones with log message that do not match the pattern specified with --grep=<pattern>."},{"names":["-i","--regexp-ignore-case"],"argument":"","description":"Match the regular expression limiting patterns without regard to letter case."},{"names":["--basic-regexp"],"argument":"","description":"Consider the limiting patterns to be basic regular expressions; this is the default."},{"names":["-E","--extended-regexp"],"argument":"","description":"Consider the limiting patterns to be extended regular expressions instead of the default basic regular expressions."},{"names":["-F","--fixed-strings"],"argument":"","description":"Consider the limiting patterns to be fixed strings (don’t interpret pattern as a regular expression)."},{"names":["-P","--perl-regexp"],"argument":"","description":"Consider the limiting patterns to be Perl-compatible regular expressions."},{"names":["--remove-empty"],"argument":"","description":"Stop when a given path disappears from the tree."},{"names":["--merges"],"argument":"","description":"Print only merge commits. This is exactly the same as --min-parents=2."},{"names":["--no-merges"],"argument":"","description":"Do not print commits with more than one parent. This is exactly the same as --max-parents=1."},{"names":["--min-parents","--max-parents","--no-min-parents","--no-max-parents"],"argument":"<number>","description":"Show only commits which have at least (or at most) that many parent commits. In particular, --max-parents=1 is the same as --no-merges, --min-parents=2 is the same as --merges. --max-parents=0 gives all root commits and --min-parents=3 all octopus merges."},{"names":["--first-parent"],"argument":"","description":"Follow only the first parent commit upon seeing a merge commit. This option can give a better overview when viewing the evolution of a particular topic branch, because merges into a topic branch tend to be only about adjusting to updated upstream from time to time, and this option allows you to ignore the individual commits brought in to your history by such a merge."},{"names":["--not"],"argument":"","description":"Reverses the meaning of the ^ prefix (or lack thereof) for all following revision specifiers, up to the next --not."},{"names":["--all"],"argument":"","description":"Pretend as if all the refs in refs/, along with HEAD, are listed on the command line as <commit>."},{"names":["--branches"],"argument":"[=<pattern>]","description":"Pretend as if all the refs in refs/heads are listed on the command line as <commit>. If <pattern> is given, limit branches to ones matching given shell glob. If pattern lacks ?, *, or [, /* at the end is implied."},{"names":["--tags"],"argument":"[=<pattern>]","description":"Pretend as if all the refs in refs/tags are listed on the command line as <commit>. If <pattern> is given, limit tags to ones matching given shell glob. If pattern lacks ?, *, or [, /* at the end is implied."},{"names":["--remotes"],"argument":"[=<pattern>]","description":"Pretend as if all the refs in refs/remotes are listed on the command line as <commit>. If <pattern> is given, limit remote-tracking branches to ones matching given shell glob. If pattern lacks ?, *, or [, /* at the end is implied."},{"names":["--glob"],"argument":"<glob-pattern>","description":"Pretend as if all the refs matching shell glob <glob-pattern> are listed on the command line as <commit>. Leading refs/, is automatically prepended if missing. If pattern lacks ?, *, or [, /* at the end is implied."},{"names":["--exclude"],"argument":"<glob-pattern>","description":"Do not include refs matching <glob-pattern> that the next --all, --branches, --tags, --remotes, or --glob would otherwise consider. Repetitions of this option accumulate exclusion patterns up to the next --all, --branches, --tags, --remotes, or --glob option (other options or arguments do not clear accumulated patterns)."},{"names":["--reflog"],"argument":"","description":"Pretend as if all objects mentioned by reflogs are listed on the command line as <commit>."},{"names":["--alternate-refs"],"argument":"","description":"Pretend as if all objects mentioned as ref tips of alternate repositories were listed on the command line. An alternate repository is any repository whose object directory is specified in objects/info/alternates. The set of included objects may be modified by core.alternateRefsCommand, etc. See git-config(1)."},{"names":["--single-worktree"],"argument":"","description":"By default, all working trees will be examined by the following options when there are more than one (see git-worktree(1)): --all, --reflog and --indexed-objects. This option forces them to examine the current working tree only."},{"names":["--ignore-missing"],"argument":"","description":"Upon seeing an invalid object name in the input, pretend as if the bad input was not given."},{"names":["--bisect"],"argument":"","description":"Pretend as if the bad bisection ref refs/bisect/bad was listed and as if it was followed by --not and the good bisection refs refs/bisect/good-* on the command line."},{"names":["--stdin"],"argument":"","description":"In addition to the <commit> listed on the command line, read them from the standard input. If a -- separator is seen, stop reading commits and start reading paths to limit the result."},{"names":["--cherry-mark"],"argument":"","description":"Like --cherry-pick (see below) but mark equivalent commits with = rather than omitting them, and inequivalent ones with +."},{"names":["--cherry-pick"],"argument":"","description":"Omit any commit that introduces the same change as another commit on the “other side” when the set of commits are limited with symmetric difference."},{"names":["--left-only","--right-only"],"argument":"","description":"List only commits on the respective side of a symmetric difference, i.e. only those which would be marked < resp. > by --left-right."},{"names":["--cherry"],"argument":"","description":"A synonym for --right-only --cherry-mark --no-merges; useful to limit the output to the commits on our side and mark those that have been applied to the other side of a forked history with git log --cherry upstream...mybranch, similar to git cherry upstream mybranch."},{"names":["-g","--walk-reflogs"],"argument":"","description":"Instead of walking the commit ancestry chain, walk reflog entries from the most recent one to older ones. When this option is used you cannot specify commits to exclude (that is, ^commit, commit1..commit2, and commit1...commit2 notations cannot be used)."},{"names":["--merge"],"argument":"","description":"After a failed merge, show refs that touch files having a conflict and don’t exist on all heads to merge."},{"names":["--boundary"],"argument":"","description":"Output excluded boundary commits. Boundary commits are prefixed with -."},{"names":["--simplify-by-decoration"],"argument":"","description":"Commits that are referred by some branch or tag are selected."},{"names":["--show-pulls"],"argument":"","description":"Include all commits from the default mode, but also any merge commits that are not TREESAME to the first parent but are TREESAME to a later parent. This mode is helpful for showing the merge commits that \"first introduced\" a change to a branch."},{"names":["--full-history"],"argument":"","description":"Same as the default mode, but does not prune some history."},{"names":["--dense"],"argument":"","description":"Only the selected commits are shown, plus some to have a meaningful history."},{"names":["--sparse"],"argument":"","description":"All commits in the simplified history are shown."},{"names":["--simplify-merges"],"argument":"","description":"Additional option to --full-history to remove some needless merges from the resulting history, as there are no selected commits contributing to this merge."},{"names":["--ancestry-path"],"argument":"","description":"When given a range of commits to display (e.g. commit1..commit2 or commit2 ^commit1), only display commits that exist directly on the ancestry chain between the commit1 and commit2, i.e. commits that are both descendants of commit1, and ancestors of commit2."},{"names":["--dense"],"argument":"","description":"Commits that are walked are included if they are not TREESAME to any parent."},{"names":["--sparse"],"argument":"","description":"All commits that are walked are included."},{"names":["--simplify-merges"],"argument":"","description":"First, build a history graph in the same way that --full-history with parent rewriting does (see above)."},{"names":["--ancestry-path"],"argument":"","description":"Limit the displayed commits to those directly on the ancestry chain between the “from” and “to” commits in the given commit range. I.e. only display commits that are ancestor of the “to” commit and descendants of the “from” commit."},{"names":["--show-pulls"],"argument":"","description":"In addition to the commits shown in the default history, show each merge commit that is not TREESAME to its first parent but is TREESAME to a later parent."},{"names":["--date-order"],"argument":"","description":"Show no parents before all of its children are shown, but otherwise show commits in the commit timestamp order."},{"names":["--author-date-order"],"argument":"","description":"Show no parents before all of its children are shown, but otherwise show commits in the author timestamp order."},{"names":["--topo-order"],"argument":"","description":"Show no parents before all of its children are shown, and avoid showing commits on multiple lines of history intermixed."},{"names":["--reverse"],"argument":"","description":"Output the commits chosen to be shown (see Commit Limiting section above) in reverse order. Cannot be combined with --walk-reflogs."},{"names":["--no-walk"],"argument":"[=(sorted|unsorted)]","description":"Only show the given commits, but do not traverse their ancestors. This has no effect if a range is specified. If the argument unsorted is given, the commits are shown in the order they were given on the command line. Otherwise (if sorted or no argument was given), the commits are shown in reverse chronological order by commit time. Cannot be combined with --graph."},{"names":["--do-walk"],"argument":"","description":"Overrides a previous --no-walk."},{"names":["--pretty","--format"],"argument":"[=<format>]","description":"Pretty-print the contents of the commit logs in a given format, where <format> can be one of oneline, short, medium, full, fuller, reference, email, raw, format:<string> and tformat:<string>. When <format> is none of the above, and has %placeholder in it, it acts as if --pretty=tformat:<format> were given."},{"names":["--abbrev-commit"],"argument":"","description":"Instead of showing the full 40-byte hexadecimal commit object name, show a prefix that names the object uniquely. \"--abbrev=<n>\" (which also modifies diff output, if it is displayed) option can be used to specify the minimum length of the prefix."},{"names":["--no-abbrev-commit"],"argument":"","description":"Show the full 40-byte hexadecimal commit object name. This negates --abbrev-commit, either explicit or implied by other options such as \"--oneline\". It also overrides the log.abbrevCommit variable."},{"names":["--oneline"],"argument":"","description":"This is a shorthand for \"--pretty=oneline --abbrev-commit\" used together."},{"names":["--encoding"],"argument":"<encoding>","description":"Commit objects record the character encoding used for the log message in their encoding header; this option can be used to tell the command to re-code the commit log message in the encoding preferred by the user. For non plumbing commands this defaults to UTF-8. Note that if an object claims to be encoded in X and we are outputting in X, we will output the object verbatim; this means that invalid sequences in the original commit may be copied to the output. Likewise, if iconv(3) fails to convert the commit, we will quietly output the original object verbatim."},{"names":["--expand-tabs","--no-expand-tabs"],"argument":"<n>","description":"Perform a tab expansion (replace each tab with enough spaces to fill to the next display column that is multiple of <n>) in the log message before showing it in the output. --expand-tabs is a short-hand for --expand-tabs=8, and --no-expand-tabs is a short-hand for --expand-tabs=0, which disables tab expansion."},{"names":["--notes"],"argument":"[=<ref>]","description":"Show the notes (see git-notes(1)) that annotate the commit, when showing the commit log message. This is the default for git log, git show and git whatchanged commands when there is no --pretty, --format, or --oneline option given on the command line."},{"names":["--no-notes"],"argument":"","description":"Do not show notes. This negates the above --notes option, by resetting the list of notes refs from which notes are shown. Options are parsed in the order given on the command line, so e.g. \"--notes --notes=foo --no-notes --notes=bar\" will only show notes from \"refs/notes/bar\"."},{"names":["--show-signature"],"argument":"","description":"Check the validity of a signed commit object by passing the signature to gpg --verify and show the output."},{"names":["--relative-date"],"argument":"","description":"Synonym for --date=relative."},{"names":["--date"],"argument":"<format>","description":"Only takes effect for dates shown in human-readable format, such as when using --pretty. log.date config variable sets a default value for the log command’s --date option. By default, dates are shown in the original time zone (either committer’s or author’s). If -local is appended to the format (e.g., iso-local), the user’s local time zone is used instead."},{"names":["--parents"],"argument":"","description":"Print also the parents of the commit (in the form \"commit parent...\"). Also enables parent rewriting, see History Simplification above."},{"names":["--children"],"argument":"","description":"Print also the children of the commit (in the form \"commit child...\"). Also enables parent rewriting, see History Simplification above."},{"names":["--left-right"],"argument":"","description":"Mark which side of a symmetric difference a commit is reachable from. Commits from the left side are prefixed with < and those from the right with >. If combined with --boundary, those commits are prefixed with -."},{"names":["--graph"],"argument":"","description":"Draw a text-based graphical representation of the commit history on the left hand side of the output. This may cause extra lines to be printed in between commits, in order for the graph history to be drawn properly. Cannot be combined with --no-walk."},{"names":["--show-linear-break"],"argument":"[=<barrier>]","description":"When --graph is not used, all history branches are flattened which can make it hard to see that the two consecutive commits do not belong to a linear branch. This option puts a barrier in between them in that case. If <barrier> is specified, it is the string that will be shown instead of the default one."},{"names":["-p","-u","--patch"],"argument":"","description":"Generate patch (see section on generating patches)."},{"names":["-s","--no-patch"],"argument":"","description":"Suppress diff output. Useful for commands like git show that show the patch by default, or to cancel the effect of --patch."},{"names":["--diff-merges","--no-diff-merges"],"argument":"(off|none|on|first-parent|1|separate|m|combined|c|dense-combined|cc)","description":"Specify diff format to be used for merge commits. Default is off unless --first-parent is in use, in which case first-parent is the default."},{"names":["--combined-all-paths"],"argument":"","description":"This flag causes combined diffs (used for merge commits) to list the name of the file from all parents. It thus only has effect when --diff-merges=[dense-]combined is in use, and is likely only useful if filename changes are detected (i.e. when either rename or copy detection have been requested)."},{"names":["-U","--unified"],"argument":"<n>","description":"Generate diffs with <n> lines of context instead of the usual three. Implies --patch."},{"names":["--output"],"argument":"<file>","description":"Output to a specific file instead of stdout."},{"names":["--output-indicator-new","--output-indicator-old","--output-indicator-context"],"argument":"<char>","description":"Specify the character used to indicate new, old or context lines in the generated patch. Normally they are +, - and ' ' respectively."},{"names":["--raw"],"argument":"","description":"For each commit, show a summary of changes using the raw diff format. See the \"RAW OUTPUT FORMAT\" section of git-diff(1). This is different from showing the log itself in raw format, which you can achieve with --format=raw."},{"names":["--patch-with-raw"],"argument":"","description":"Synonym for -p --raw."},{"names":["-t"],"argument":"","description":"Show the tree objects in the diff output."},{"names":["--indent-heuristic"],"argument":"","description":"Enable the heuristic that shifts diff hunk boundaries to make patches easier to read. This is the default."},{"names":["--no-indent-heuristic"],"argument":"","description":"Disable the indent heuristic."},{"names":["--minimal"],"argument":"","description":"Spend extra time to make sure the smallest possible diff is produced."},{"names":["--patience"],"argument":"","description":"Generate a diff using the \"patience diff\" algorithm."},{"names":["--histogram"],"argument":"","description":"Generate a diff using the \"histogram diff\" algorithm."},{"names":["--anchored"],"argument":"<text>","description":"Generate a diff using the \"anchored diff\" algorithm."},{"names":["--diff-algorithm"],"argument":"{patience|minimal|histogram|myers}","description":"Choose a diff algorithm. The variants are as follows:"},{"names":["--stat"],"argument":"[=<width>[,<name-width>[,<count>]]]","description":"Generate a diffstat. By default, as much space as necessary will be used for the filename part, and the rest for the graph part. Maximum width defaults to terminal width, or 80 columns if not connected to a terminal, and can be overridden by <width>. The width of the filename part can be limited by giving another width <name-width> after a comma. The width of the graph part can be limited by using --stat-graph-width=<width> (affects all commands generating a stat graph) or by setting diff.statGraphWidth=<width> (does not affect git format-patch). By giving a third parameter <count>, you can limit the output to the first <count> lines, followed by ... if there are more."},{"names":["--compact-summary"],"argument":"","description":"Output a condensed summary of extended header information such as file creations or deletions (\"new\" or \"gone\", optionally \"+l\" if it’s a symlink) and mode changes (\"+x\" or \"-x\" for adding or removing executable bit respectively) in diffstat. The information is put between the filename part and the graph part. Implies --stat."},{"names":["--numstat"],"argument":"","description":"Similar to --stat, but shows number of added and deleted lines in decimal notation and pathname without abbreviation, to make it more machine friendly. For binary files, outputs two - instead of saying 0 0."},{"names":["--shortstat"],"argument":"","description":"Output only the last line of the --stat format containing total number of modified files, as well as number of added and deleted lines."},{"names":["-X","--dirstat"],"argument":"[<param1,param2,...>]","description":"Output the distribution of relative amount of changes for each sub-directory. The behavior of --dirstat can be customized by passing it a comma separated list of parameters. The defaults are controlled by the diff.dirstat configuration variable (see git-config(1)). The following parameters are available:"},{"names":["--cumulative"],"argument":"","description":"Synonym for --dirstat=cumulative"},{"names":["--dirstat-by-file"],"argument":"[=<param1,param2>...]","description":"Synonym for --dirstat=files,param1,param2..."},{"names":["--summary"],"argument":"","description":"Output a condensed summary of extended header information such as creations, renames and mode changes."},{"names":["--patch-with-stat"],"argument":"","description":"Synonym for -p --stat."},{"names":["-z"],"argument":"","description":"Separate the commits with NULs instead of with new newlines."},{"names":["--name-only"],"argument":"","description":"Show only names of changed files. The file names are often encoded in UTF-8. For more information see the discussion about encoding in the git-log(1) manual page."},{"names":["--name-status"],"argument":"","description":"Show only names and status of changed files. See the description of the --diff-filter option on what the status letters mean. Just like --name-only the file names are often encoded in UTF-8."},{"names":["--submodule"],"argument":"[=<format>]","description":"Specify how differences in submodules are shown. When specifying --submodule=short the short format is used. This format just shows the names of the commits at the beginning and end of the range. When --submodule or --submodule=log is specified, the log format is used. This format lists the commits in the range like git-submodule(1) summary does. When --submodule=diff is specified, the diff format is used. This format shows an inline diff of the changes in the submodule contents between the commit range. Defaults to diff.submodule or the short format if the config option is unset."},{"names":["--color"],"argument":"[=<when>]","description":"Show colored diff. --color (i.e. without =<when>) is the same as --color=always. <when> can be one of always, never, or auto."},{"names":["--no-color"],"argument":"","description":"Turn off colored diff. It is the same as --color=never."},{"names":["--color-moved"],"argument":"[=<mode>]","description":"Moved lines of code are colored differently. The <mode> defaults to no if the option is not given and to zebra if the option with no mode is given. The mode must be one of:"},{"names":["--no-color-moved"],"argument":"","description":"Turn off move detection. This can be used to override configuration settings. It is the same as --color-moved=no."},{"names":["--color-moved-ws"],"argument":"<modes>","description":"This configures how whitespace is ignored when performing the move detection for --color-moved. These modes can be given as a comma separated list:"},{"names":["--no-color-moved-ws"],"argument":"","description":"Do not ignore whitespace when performing move detection. This can be used to override configuration settings. It is the same as --color-moved-ws=no."},{"names":["--word-diff"],"argument":"[=<mode>]","description":"Show a word diff, using the <mode> to delimit changed words. By default, words are delimited by whitespace; see --word-diff-regex below. The <mode> defaults to plain, and must be one of:"},{"names":["--word-diff-regex"],"argument":"<regex>","description":"Use <regex> to decide what a word is, instead of considering runs of non-whitespace to be a word. Also implies --word-diff unless it was already enabled."},{"names":["--color-words"],"argument":"[=<regex>]","description":"Equivalent to --word-diff=color plus (if a regex was specified) --word-diff-regex=<regex>."},{"names":["--no-renames"],"argument":"","description":"Turn off rename detection, even when the configuration file gives the default to do so."},{"names":["--rename-empty"],"argument":"","description":"Whether to use empty blobs as rename source."},{"names":["--no-rename-empty"],"argument":"","description":"Whether to use empty blobs as rename source."},{"names":["--check"],"argument":"","description":"Warn if changes introduce conflict markers or whitespace errors. What are considered whitespace errors is controlled by core.whitespace configuration. By default, trailing whitespaces (including lines that consist solely of whitespaces) and a space character that is immediately followed by a tab character inside the initial indent of the line are considered whitespace errors. Exits with non-zero status if problems are found. Not compatible with --exit-code."},{"names":["--ws-error-highlight"],"argument":"<kind>","description":"Highlight whitespace errors in the context, old or new lines of the diff. Multiple values are separated by comma, none resets previous values, default reset the list to new and all is a shorthand for old,new,context. When this option is not given, and the configuration variable diff.wsErrorHighlight is not set, only whitespace errors in new lines are highlighted. The whitespace errors are colored with color.diff.whitespace."},{"names":["--full-index"],"argument":"","description":"Instead of the first handful of characters, show the full pre- and post-image blob object names on the \"index\" line when generating patch format output."},{"names":["--binary"],"argument":"","description":"In addition to --full-index, output a binary diff that can be applied with git-apply. Implies --patch."},{"names":["--abbrev"],"argument":"[=<n>]","description":"Instead of showing the full 40-byte hexadecimal object name in diff-raw format output and diff-tree header lines, show the shortest prefix that is at least <n> hexdigits long that uniquely refers the object. In diff-patch output format, --full-index takes higher precedence, i.e. if --full-index is specified, full blob names will be shown regardless of --abbrev. Non default number of digits can be specified with --abbrev=<n>."},{"names":["-B","--break-rewrites"],"argument":"[<n>][/<m>]","description":"Break complete rewrite changes into pairs of delete and create. This serves two purposes:"},{"names":["-M","--find-renames"],"argument":"[<n>]","description":"If generating diffs, detect and report renames for each commit. For following files across renames while traversing history, see --follow. If n is specified, it is a threshold on the similarity index (i.e. amount of addition/deletions compared to the file’s size). For example, -M90% means Git should consider a delete/add pair to be a rename if more than 90% of the file hasn’t changed. Without a % sign, the number is to be read as a fraction, with a decimal point before it. I.e., -M5 becomes 0.5, and is thus the same as -M50%. Similarly, -M05 is the same as -M5%. To limit detection to exact renames, use -M100%. The default similarity index is 50%."},{"names":["-C","--find-copies"],"argument":"[<n>]","description":"Detect copies as well as renames. See also --find-copies-harder. If n is specified, it has the same meaning as for -M<n>."},{"names":["--find-copies-harder"],"argument":"","description":"For performance reasons, by default, -C option finds copies only if the original file of the copy was modified in the same changeset. This flag makes the command inspect unmodified files as candidates for the source of copy. This is a very expensive operation for large projects, so use it with caution. Giving more than one -C option has the same effect."},{"names":["-D","--irreversible-delete"],"argument":"","description":"Omit the preimage for deletes, i.e. print only the header but not the diff between the preimage and /dev/null. The resulting patch is not meant to be applied with patch or git apply; this is solely for people who want to just concentrate on reviewing the text after the change. In addition, the output obviously lacks enough information to apply such a patch in reverse, even manually, hence the name of the option."},{"names":["-l"],"argument":"<num>","description":"The -M and -C options involve some preliminary steps that can detect subsets of renames/copies cheaply, followed by an exhaustive fallback portion that compares all remaining unpaired destinations to all relevant sources. (For renames, only remaining unpaired sources are relevant; for copies, all original sources are relevant.) For N sources and destinations, this exhaustive check is O(N^2). This option prevents the exhaustive portion of rename/copy detection from running if the number of source/destination files involved exceeds the specified number. Defaults to diff.renameLimit. Note that a value of 0 is treated as unlimited."},{"names":["--diff-filter"],"argument":"[(A|C|D|M|R|T|U|X|B)...[*]]","description":"Select only files that are Added (A), Copied (C), Deleted (D), Modified (M), Renamed (R), have their type (i.e. regular file, symlink, submodule, ...) changed (T), are Unmerged (U), are Unknown (X), or have had their pairing Broken (B). Any combination of the filter characters (including none) can be used. When * (All-or-none) is added to the combination, all paths are selected if there is any file that matches other criteria in the comparison; if there is no file that matches other criteria, nothing is selected."},{"names":["-S"],"argument":"<string>","description":"Look for differences that change the number of occurrences of the specified string (i.e. addition/deletion) in a file. Intended for the scripter’s use."},{"names":["-G"],"argument":"<regex>","description":"Look for differences whose patch text contains added/removed lines that match <regex>."},{"names":["--find-object"],"argument":"<object-id>","description":"Look for differences that change the number of occurrences of the specified object. Similar to -S, just the argument is different in that it doesn’t search for a specific string but for a specific object id."},{"names":["--pickaxe-all"],"argument":"","description":"When -S or -G finds a change, show all the changes in that changeset, not just the files that contain the change in <string>."},{"names":["--pickaxe-regex"],"argument":"","description":"Treat the <string> given to -S as an extended POSIX regular expression to match."},{"names":["-O"],"argument":"<orderfile>","description":"Control the order in which files appear in the output. This overrides the diff.orderFile configuration variable (see git-config(1)). To cancel diff.orderFile, use -O/dev/null."},{"names":["--skip-to","--rotate-to"],"argument":"<file>","description":"Discard the files before the named <file> from the output (i.e. skip to), or move them to the end of the output (i.e. rotate to). These were invented primarily for use of the git difftool command, and may not be very useful otherwise."},{"names":["-R"],"argument":"","description":"Swap two inputs; that is, show differences from index or on-disk file to tree contents."},{"names":["--relative","--no-relative"],"argument":"[=<path>]","description":"When run from a subdirectory of the project, it can be told to exclude changes outside the directory and show pathnames relative to it with this option. When you are not in a subdirectory (e.g. in a bare repository), you can name which subdirectory to make the output relative to by giving a <path> as an argument. --no-relative can be used to countermand both diff.relative config option and previous --relative."},{"names":["-a","--text"],"argument":"","description":"Treat all files as text."},{"names":["--ignore-cr-at-eol"],"argument":"","description":"Ignore carriage-return at the end of line when doing a comparison."},{"names":["--ignore-space-at-eol"],"argument":"","description":"Ignore changes in whitespace at EOL."},{"names":["-b","--ignore-space-change"],"argument":"","description":"Ignore changes in amount of whitespace. This ignores whitespace at line end, and considers all other sequences of one or more whitespace characters to be equivalent."},{"names":["-w","--ignore-all-space"],"argument":"","description":"Ignore whitespace when comparing lines. This ignores differences even if one line has whitespace where the other line has none."},{"names":["--ignore-blank-lines"],"argument":"","description":"Ignore changes whose lines are all blank."},{"names":["-I","--ignore-matching-lines"],"argument":"<regex>","description":"Ignore changes whose all lines match <regex>. This option may be specified more than once."},{"names":["--inter-hunk-context"],"argument":"<lines>","description":"Show the context between diff hunks, up to the specified number of lines, thereby fusing hunks that are close to each other. Defaults to diff.interHunkContext or 0 if the config option is unset."},{"names":["-W","--function-context"],"argument":"","description":"Show whole function as context lines for each change. The function names are determined in the same way as git diff works out patch hunk headers (see Defining a custom hunk-header in gitattributes(5))."},{"names":["--ext-diff"],"argument":"","description":"Allow an external diff helper to be executed. If you set an external diff driver with gitattributes(5), you need to use this option with git-log(1) and friends."},{"names":["--no-ext-diff"],"argument":"","description":"Disallow external diff drivers."},{"names":["--textconv","--no-textconv"],"argument":"","description":"Allow (or disallow) external text conversion filters to be run when comparing binary files. See gitattributes(5) for details. Because textconv filters are typically a one-way conversion, the resulting diff is suitable for human consumption, but cannot be applied. For this reason, textconv filters are enabled by default only for git-diff(1) and git-log(1), but not for git-format-patch(1) or diff plumbing commands."},{"names":["--ignore-submodules"],"argument":"[=<when>]","description":"Ignore changes to submodules in the diff generation. <when> can be either \"none\", \"untracked\", \"dirty\" or \"all\", which is the default. Using \"none\" will consider the submodule modified when it either contains untracked or modified files or its HEAD differs from the commit recorded in the superproject and can be used to override any settings of the ignore option in git-config(1) or gitmodules(5). When \"untracked\" is used submodules are not considered dirty when they only contain untracked content (but they are still scanned for modified content). Using \"dirty\" ignores all changes to the work tree of submodules, only changes to the commits stored in the superproject are shown (this was the behavior until 1.7.0). Using \"all\" hides all changes to submodules."},{"names":["--src-prefix"],"argument":"<prefix>","description":"Show the given source prefix instead of \"a/\"."},{"names":["--dst-prefix"],"argument":"<prefix>","description":"Show the given destination prefix instead of \"b/\"."},{"names":["--no-prefix"],"argument":"","description":"Do not show any source or destination prefix."},{"names":["--line-prefix"],"argument":"<prefix>","description":"Prepend an additional prefix to every line of output."},{"names":["--ita-invisible-in-index"],"argument":"","description":"By default entries added by \"git add -N\" appear as an existing empty file in \"git diff\" and a new file in \"git diff --cached\". This option makes the entry appear as a new file in \"git diff\" and non-existent in \"git diff --cached\". This option could be reverted with --ita-visible-in-index. Both options are experimental and could be removed in future."}]},{"name":"show","description":"Show various types of objects","options":[{"names":["--pretty","--format"],"argument":"[=<format>]","description":"Pretty-print the contents of the commit logs in a given format, where <format> can be one of oneline, short, medium, full, fuller, reference, email, raw, format:<string> and tformat:<string>. When <format> is none of the above, and has %placeholder in it, it acts as if --pretty=tformat:<format> were given."},{"names":["--abbrev-commit"],"argument":"","description":"Instead of showing the full 40-byte hexadecimal commit object name, show a prefix that names the object uniquely. \"--abbrev=<n>\" (which also modifies diff output, if it is displayed) option can be used to specify the minimum length of the prefix."},{"names":["--no-abbrev-commit"],"argument":"","description":"Show the full 40-byte hexadecimal commit object name. This negates --abbrev-commit, either explicit or implied by other options such as \"--oneline\". It also overrides the log.abbrevCommit variable."},{"names":["--oneline"],"argument":"","description":"This is a shorthand for \"--pretty=oneline --abbrev-commit\" used together."},{"names":["--encoding"],"argument":"<encoding>","description":"Commit objects record the character encoding used for the log message in their encoding header; this option can be used to tell the command to re-code the commit log message in the encoding preferred by the user. For non plumbing commands this defaults to UTF-8. Note that if an object claims to be encoded in X and we are outputting in X, we will output the object verbatim; this means that invalid sequences in the original commit may be copied to the output. Likewise, if iconv(3) fails to convert the commit, we will quietly output the original object verbatim."},{"names":["--expand-tabs","--no-expand-tabs"],"argument":"<n>","description":"Perform a tab expansion (replace each tab with enough spaces to fill to the next display column that is multiple of <n>) in the log message before showing it in the output. --expand-tabs is a short-hand for --expand-tabs=8, and --no-expand-tabs is a short-hand for --expand-tabs=0, which disables tab expansion."},{"names":["--notes"],"argument":"[=<ref>]","description":"Show the notes (see git-notes(1)) that annotate the commit, when showing the commit log message. This is the default for git log, git show and git whatchanged commands when there is no --pretty, --format, or --oneline option given on the command line."},{"names":["--no-notes"],"argument":"","description":"Do not show notes. This negates the above --notes option, by resetting the list of notes refs from which notes are shown. Options are parsed in the order given on the command line, so e.g. \"--notes --notes=foo --no-notes --notes=bar\" will only show notes from \"refs/notes/bar\"."},{"names":["--show-signature"],"argument":"","description":"Check the validity of a signed commit object by passing the signature to gpg --verify and show the output."},{"names":["-p","-u","--patch"],"argument":"","description":"Generate patch (see section on generating patches)."},{"names":["-s","--no-patch"],"argument":"","description":"Suppress diff output. Useful for commands like git show that show the patch by default, or to cancel the effect of --patch."},{"names":["--diff-merges","--no-diff-merges"],"argument":"(off|none|on|first-parent|1|separate|m|combined|c|dense-combined|cc)","description":"Specify diff format to be used for merge commits. Default is dense-combined unless --first-parent is in use, in which case first-parent is the default."},{"names":["--combined-all-paths"],"argument":"","description":"This flag causes combined diffs (used for merge commits) to list the name of the file from all parents. It thus only has effect when --diff-merges=[dense-]combined is in use, and is likely only useful if filename changes are detected (i.e. when either rename or copy detection have been requested)."},{"names":["-U","--unified"],"argument":"<n>","description":"Generate diffs with <n> lines of context instead of the usual three. Implies --patch."},{"names":["--output"],"argument":"<file>","description":"Output to a specific file instead of stdout."},{"names":["--output-indicator-new","--output-indicator-old","--output-indicator-context"],"argument":"<char>","description":"Specify the character used to indicate new, old or context lines in the generated patch. Normally they are +, - and ' ' respectively."},{"names":["--raw"],"argument":"","description":"For each commit, show a summary of changes using the raw diff format. See the \"RAW OUTPUT FORMAT\" section of git-diff(1). This is different from showing the log itself in raw format, which you can achieve with --format=raw."},{"names":["--patch-with-raw"],"argument":"","description":"Synonym for -p --raw."},{"names":["-t"],"argument":"","description":"Show the tree objects in the diff output."},{"names":["--indent-heuristic"],"argument":"","description":"Enable the heuristic that shifts diff hunk boundaries to make patches easier to read. This is the default."},{"names":["--no-indent-heuristic"],"argument":"","description":"Disable the indent heuristic."},{"names":["--minimal"],"argument":"","description":"Spend extra time to make sure the smallest possible diff is produced."},{"names":["--patience"],"argument":"","description":"Generate a diff using the \"patience diff\" algorithm."},{"names":["--histogram"],"argument":"","description":"Generate a diff using the \"histogram diff\" algorithm."},{"names":["--anchored"],"argument":"<text>","description":"Generate a diff using the \"anchored diff\" algorithm."},{"names":["--diff-algorithm"],"argument":"{patience|minimal|histogram|myers}","description":"Choose a diff algorithm. The variants are as follows:"},{"names":["--stat"],"argument":"[=<width>[,<name-width>[,<count>]]]","description":"Generate a diffstat. By default, as much space as necessary will be used for the filename part, and the rest for the graph part. Maximum width defaults to terminal width, or 80 columns if not connected to a terminal, and can be overridden by <width>. The width of the filename part can be limited by giving another width <name-width> after a comma. The width of the graph part can be limited by using --stat-graph-width=<width> (affects all commands generating a stat graph) or by setting diff.statGraphWidth=<width> (does not affect git format-patch). By giving a third parameter <count>, you can limit the output to the first <count> lines, followed by ... if there are more."},{"names":["--compact-summary"],"argument":"","description":"Output a condensed summary of extended header information such as file creations or deletions (\"new\" or \"gone\", optionally \"+l\" if it’s a symlink) and mode changes (\"+x\" or \"-x\" for adding or removing executable bit respectively) in diffstat. The information is put between the filename part and the graph part. Implies --stat."},{"names":["--numstat"],"argument":"","description":"Similar to --stat, but shows number of added and deleted lines in decimal notation and pathname without abbreviation, to make it more machine friendly. For binary files, outputs two - instead of saying 0 0."},{"names":["--shortstat"],"argument":"","description":"Output only the last line of the --stat format containing total number of modified files, as well as number of added and deleted lines."},{"names":["-X","--dirstat"],"argument":"[<param1,param2,...>]","description":"Output the distribution of relative amount of changes for each sub-directory. The behavior of --dirstat can be customized by passing it a comma separated list of parameters. The defaults are controlled by the diff.dirstat configuration variable (see git-config(1)). The following parameters are available:"},{"names":["--cumulative"],"argument":"","description":"Synonym for --dirstat=cumulative"},{"names":["--dirstat-by-file"],"argument":"[=<param1,param2>...]","description":"Synonym for --dirstat=files,param1,param2..."},{"names":["--summary"],"argument":"","description":"Output a condensed summary of extended header information such as creations, renames and mode changes."},{"names":["--patch-with-stat"],"argument":"","description":"Synonym for -p --stat."},{"names":["-z"],"argument":"","description":"Separate the commits with NULs instead of with new newlines."},{"names":["--name-only"],"argument":"","description":"Show only names of changed files. The file names are often encoded in UTF-8. For more information see the discussion about encoding in the git-log(1) manual page."},{"names":["--name-status"],"argument":"","description":"Show only names and status of changed files. See the description of the --diff-filter option on what the status letters mean. Just like --name-only the file names are often encoded in UTF-8."},{"names":["--submodule"],"argument":"[=<format>]","description":"Specify how differences in submodules are shown. When specifying --submodule=short the short format is used. This format just shows the names of the commits at the beginning and end of the range. When --submodule or --submodule=log is specified, the log format is used. This format lists the commits in the range like git-submodule(1) summary does. When --submodule=diff is specified, the diff format is used. This format shows an inline diff of the changes in the submodule contents between the commit range. Defaults to diff.submodule or the short format if the config option is unset."},{"names":["--color"],"argument":"[=<when>]","description":"Show colored diff. --color (i.e. without =<when>) is the same as --color=always. <when> can be one of always, never, or auto."},{"names":["--no-color"],"argument":"","description":"Turn off colored diff. It is the same as --color=never."},{"names":["--color-moved"],"argument":"[=<mode>]","description":"Moved lines of code are colored differently. The <mode> defaults to no if the option is not given and to zebra if the option with no mode is given. The mode must be one of:"},{"names":["--no-color-moved"],"argument":"","description":"Turn off move detection. This can be used to override configuration settings. It is the same as --color-moved=no."},{"names":["--color-moved-ws"],"argument":"<modes>","description":"This configures how whitespace is ignored when performing the move detection for --color-moved. These modes can be given as a comma separated list:"},{"names":["--no-color-moved-ws"],"argument":"","description":"Do not ignore whitespace when performing move detection. This can be used to override configuration settings. It is the same as --color-moved-ws=no."},{"names":["--word-diff"],"argument":"[=<mode>]","description":"Show a word diff, using the <mode> to delimit changed words. By default, words are delimited by whitespace; see --word-diff-regex below. The <mode> defaults to plain, and must be one of:"},{"names":["--word-diff-regex"],"argument":"<regex>","description":"Use <regex> to decide what a word is, instead of considering runs of non-whitespace to be a word. Also implies --word-diff unless it was already enabled."},{"names":["--color-words"],"argument":"[=<regex>]","description":"Equivalent to --word-diff=color plus (if a regex was specified) --word-diff-regex=<regex>."},{"names":["--no-renames"],"argument":"","description":"Turn off rename detection, even when the configuration file gives the default to do so."},{"names":["--rename-empty"],"argument":"","description":"Whether to use empty blobs as rename source."},{"names":["--no-rename-empty"],"argument":"","description":"Whether to use empty blobs as rename source."},{"names":["--check"],"argument":"","description":"Warn if changes introduce conflict markers or whitespace errors. What are considered whitespace errors is controlled by core.whitespace configuration. By default, trailing whitespaces (including lines that consist solely of whitespaces) and a space character that is immediately followed by a tab character inside the initial indent of the line are considered whitespace errors. Exits with non-zero status if problems are found. Not compatible with --exit-code."},{"names":["--ws-error-highlight"],"argument":"<kind>","description":"Highlight whitespace errors in the context, old or new lines of the diff. Multiple values are separated by comma, none resets previous values, default reset the list to new and all is a shorthand for old,new,context. When this option is not given, and the configuration variable diff.wsErrorHighlight is not set, only whitespace errors in new lines are highlighted. The whitespace errors are colored with color.diff.whitespace."},{"names":["--full-index"],"argument":"","description":"Instead of the first handful of characters, show the full pre- and post-image blob object names on the \"index\" line when generating patch format output."},{"names":["--binary"],"argument":"","description":"In addition to --full-index, output a binary diff that can be applied with git-apply. Implies --patch."},{"names":["--abbrev"],"argument":"[=<n>]","description":"Instead of showing the full 40-byte hexadecimal object name in diff-raw format output and diff-tree header lines, show the shortest prefix that is at least <n> hexdigits long that uniquely refers the object. In diff-patch output format, --full-index takes higher precedence, i.e. if --full-index is specified, full blob names will be shown regardless of --abbrev. Non default number of digits can be specified with --abbrev=<n>."},{"names":["-B","--break-rewrites"],"argument":"[<n>][/<m>]","description":"Break complete rewrite changes into pairs of delete and create. This serves two purposes:"},{"names":["-M","--find-renames"],"argument":"[<n>]","description":"If generating diffs, detect and report renames for each commit. For following files across renames while traversing history, see --follow. If n is specified, it is a threshold on the similarity index (i.e. amount of addition/deletions compared to the file’s size). For example, -M90% means Git should consider a delete/add pair to be a rename if more than 90% of the file hasn’t changed. Without a % sign, the number is to be read as a fraction, with a decimal point before it. I.e., -M5 becomes 0.5, and is thus the same as -M50%. Similarly, -M05 is the same as -M5%. To limit detection to exact renames, use -M100%. The default similarity index is 50%."},{"names":["-C","--find-copies"],"argument":"[<n>]","description":"Detect copies as well as renames. See also --find-copies-harder. If n is specified, it has the same meaning as for -M<n>."},{"names":["--find-copies-harder"],"argument":"","description":"For performance reasons, by default, -C option finds copies only if the original file of the copy was modified in the same changeset. This flag makes the command inspect unmodified files as candidates for the source of copy. This is a very expensive operation for large projects, so use it with caution. Giving more than one -C option has the same effect."},{"names":["-D","--irreversible-delete"],"argument":"","description":"Omit the preimage for deletes, i.e. print only the header but not the diff between the preimage and /dev/null. The resulting patch is not meant to be applied with patch or git apply; this is solely for people who want to just concentrate on reviewing the text after the change. In addition, the output obviously lacks enough information to apply such a patch in reverse, even manually, hence the name of the option."},{"names":["-l"],"argument":"<num>","description":"The -M and -C options involve some preliminary steps that can detect subsets of renames/copies cheaply, followed by an exhaustive fallback portion that compares all remaining unpaired destinations to all relevant sources. (For renames, only remaining unpaired sources are relevant; for copies, all original sources are relevant.) For N sources and destinations, this exhaustive check is O(N^2). This option prevents the exhaustive portion of rename/copy detection from running if the number of source/destination files involved exceeds the specified number. Defaults to diff.renameLimit. Note that a value of 0 is treated as unlimited."},{"names":["--diff-filter"],"argument":"[(A|C|D|M|R|T|U|X|B)...[*]]","description":"Select only files that are Added (A), Copied (C), Deleted (D), Modified (M), Renamed (R), have their type (i.e. regular file, symlink, submodule, ...) changed (T), are Unmerged (U), are Unknown (X), or have had their pairing Broken (B). Any combination of the filter characters (including none) can be used. When * (All-or-none) is added to the combination, all paths are selected if there is any file that matches other criteria in the comparison; if there is no file that matches other criteria, nothing is selected."},{"names":["-S"],"argument":"<string>","description":"Look for differences that change the number of occurrences of the specified string (i.e. addition/deletion) in a file. Intended for the scripter’s use."},{"names":["-G"],"argument":"<regex>","description":"Look for differences whose patch text contains added/removed lines that match <regex>."},{"names":["--find-object"],"argument":"<object-id>","description":"Look for differences that change the number of occurrences of the specified object. Similar to -S, just the argument is different in that it doesn’t search for a specific string but for a specific object id."},{"names":["--pickaxe-all"],"argument":"","description":"When -S or -G finds a change, show all the changes in that changeset, not just the files that contain the change in <string>."},{"names":["--pickaxe-regex"],"argument":"","description":"Treat the <string> given to -S as an extended POSIX regular expression to match."},{"names":["-O"],"argument":"<orderfile>","description":"Control the order in which files appear in the output. This overrides the diff.orderFile configuration variable (see git-config(1)). To cancel diff.orderFile, use -O/dev/null."},{"names":["--skip-to","--rotate-to"],"argument":"<file>","description":"Discard the files before the named <file> from the output (i.e. skip to), or move them to the end of the output (i.e. rotate to). These were invented primarily for use of the git difftool command, and may not be very useful otherwise."},{"names":["-R"],"argument":"","description":"Swap two inputs; that is, show differences from index or on-disk file to tree contents."},{"names":["--relative","--no-relative"],"argument":"[=<path>]","description":"When run from a subdirectory of the project, it can be told to exclude changes outside the directory and show pathnames relative to it with this option. When you are not in a subdirectory (e.g. in a bare repository), you can name which subdirectory to make the output relative to by giving a <path> as an argument. --no-relative can be used to countermand both diff.relative config option and previous --relative."},{"names":["-a","--text"],"argument":"","description":"Treat all files as text."},{"names":["--ignore-cr-at-eol"],"argument":"","description":"Ignore carriage-return at the end of line when doing a comparison."},{"names":["--ignore-space-at-eol"],"argument":"","description":"Ignore changes in whitespace at EOL."},{"names":["-b","--ignore-space-change"],"argument":"","description":"Ignore changes in amount of whitespace. This ignores whitespace at line end, and considers all other sequences of one or more whitespace characters to be equivalent."},{"names":["-w","--ignore-all-space"],"argument":"","description":"Ignore whitespace when comparing lines. This ignores differences even if one line has whitespace where the other line has none."},{"names":["--ignore-blank-lines"],"argument":"","description":"Ignore changes whose lines are all blank."},{"names":["-I","--ignore-matching-lines"],"argument":"<regex>","description":"Ignore changes whose all lines match <regex>. This option may be specified more than once."},{"names":["--inter-hunk-context"],"argument":"<lines>","description":"Show the context between diff hunks, up to the specified number of lines, thereby fusing hunks that are close to each other. Defaults to diff.interHunkContext or 0 if the config option is unset."},{"names":["-W","--function-context"],"argument":"","description":"Show whole function as context lines for each change. The function names are determined in the same way as git diff works out patch hunk headers (see Defining a custom hunk-header in gitattributes(5))."},{"names":["--ext-diff"],"argument":"","description":"Allow an external diff helper to be executed. If you set an external diff driver with gitattributes(5), you need to use this option with git-log(1) and friends."},{"names":["--no-ext-diff"],"argument":"","description":"Disallow external diff drivers."},{"names":["--textconv","--no-textconv"],"argument":"","description":"Allow (or disallow) external text conversion filters to be run when comparing binary files. See gitattributes(5) for details. Because textconv filters are typically a one-way conversion, the resulting diff is suitable for human consumption, but cannot be applied. For this reason, textconv filters are enabled by default only for git-diff(1) and git-log(1), but not for git-format-patch(1) or diff plumbing commands."},{"names":["--ignore-submodules"],"argument":"[=<when>]","description":"Ignore changes to submodules in the diff generation. <when> can be either \"none\", \"untracked\", \"dirty\" or \"all\", which is the default. Using \"none\" will consider the submodule modified when it either contains untracked or modified files or its HEAD differs from the commit recorded in the superproject and can be used to override any settings of the ignore option in git-config(1) or gitmodules(5). When \"untracked\" is used submodules are not considered dirty when they only contain untracked content (but they are still scanned for modified content). Using \"dirty\" ignores all changes to the work tree of submodules, only changes to the commits stored in the superproject are shown (this was the behavior until 1.7.0). Using \"all\" hides all changes to submodules."},{"names":["--src-prefix"],"argument":"<prefix>","description":"Show the given source prefix instead of \"a/\"."},{"names":["--dst-prefix"],"argument":"<prefix>","description":"Show the given destination prefix instead of \"b/\"."},{"names":["--no-prefix"],"argument":"","description":"Do not show any source or destination prefix."},{"names":["--line-prefix"],"argument":"<prefix>","description":"Prepend an additional prefix to every line of output."},{"names":["--ita-invisible-in-index"],"argument":"","description":"By default entries added by \"git add -N\" appear as an existing empty file in \"git diff\" and a new file in \"git diff --cached\". This option makes the entry appear as a new file in \"git diff\" and non-existent in \"git diff --cached\". This option could be reverted with --ita-visible-in-index. Both options are experimental and could be removed in future."}]},{"name":"status","description":"Show the working tree status","options":[{"names":["-s","--short"],"argument":"","description":"Give the output in the short-format."},{"names":["-b","--branch"],"argument":"","description":"Show the branch and tracking info even in short-format."},{"names":["--show-stash"],"argument":"","description":"Show the number of entries currently stashed away."},{"names":["--porcelain"],"argument":"[=<version>]","description":"Give the output in an easy-to-parse format for scripts. This is similar to the short output, but will remain stable across Git versions and regardless of user configuration. See below for details."},{"names":["--long"],"argument":"","description":"Give the output in the long-format. This is the default."},{"names":["-v","--verbose"],"argument":"","description":"In addition to the names of files that have been changed, also show the textual changes that are staged to be committed (i.e., like the output of git diff --cached). If -v is specified twice, then also show the changes in the working tree that have not yet been staged (i.e., like the output of git diff)."},{"names":["-u","--untracked-files"],"argument":"[<mode>]","description":"Show untracked files."},{"names":["--ignore-submodules"],"argument":"[=<when>]","description":"Ignore changes to submodules when looking for changes. <when> can be either \"none\", \"untracked\", \"dirty\" or \"all\", which is the default. Using \"none\" will consider the submodule modified when it either contains untracked or modified files or its HEAD differs from the commit recorded in the superproject and can be used to override any settings of the ignore option in git-config(1) or gitmodules(5). When \"untracked\" is used submodules are not considered dirty when they only contain untracked content (but they are still scanned for modified content). Using \"dirty\" ignores all changes to the work tree of submodules, only changes to the commits stored in the superproject are shown (this was the behavior before 1.7.0). Using \"all\" hides all changes to submodules (and suppresses the output of submodule summaries when the config option status.submoduleSummary is set)."},{"names":["--ignored"],"argument":"[=<mode>]","description":"Show ignored files as well."},{"names":["-z"],"argument":"","description":"Terminate entries with NUL, instead of LF. This implies the --porcelain=v1 output format if no other format is given."},{"names":["--column","--no-column"],"argument":"[=<options>]","description":"Display untracked files in columns. See configuration variable column.status for option syntax. --column and --no-column without options are equivalent to always and never respectively."},{"names":["--ahead-behind","--no-ahead-behind"],"argument":"","description":"Display or do not display detailed ahead/behind counts for the branch relative to its upstream branch. Defaults to true."},{"names":["--renames","--no-renames"],"argument":"","description":"Turn on/off rename detection regardless of user configuration. See also git-diff(1) --no-renames."},{"names":["--find-renames"],"argument":"[=<n>]","description":"Turn on rename detection, optionally setting the similarity threshold. See also git-diff(1) --find-renames."}]},{"name":"branch","description":"List, create, or delete branches","options":[{"names":["-d","--delete"],"argument":"","description":"Delete a branch. The branch must be fully merged in its upstream branch, or in HEAD if no upstream was set with --track or --set-upstream-to."},{"names":["-D"],"argument":"","description":"Shortcut for --delete --force."},{"names":["--create-reflog"],"argument":"","description":"Create the branch’s reflog. This activates recording of all changes made to the branch ref, enabling use of date based sha1 expressions such as \"<branchname>@{yesterday}\". Note that in non-bare repositories, reflogs are usually enabled by default by the core.logAllRefUpdates config option. The negated form --no-create-reflog only overrides an earlier --create-reflog, but currently does not negate the setting of core.logAllRefUpdates."},{"names":["-f","--force"],"argument":"","description":"Reset <branchname> to <startpoint>, even if <branchname> exists already. Without -f, git branch refuses to change an existing branch. In combination with -d (or --delete), allow deleting the branch irrespective of its merged status, or whether it even points to a valid commit. In combination with -m (or --move), allow renaming the branch even if the new branch name already exists, the same applies for -c (or --copy)."},{"names":["-m","--move"],"argument":"","description":"Move/rename a branch, together with its config and reflog."},{"names":["-M"],"argument":"","description":"Shortcut for --move --force."},{"names":["-c","--copy"],"argument":"","description":"Copy a branch, together with its config and reflog."},{"names":["-C"],"argument":"","description":"Shortcut for --copy --force."},{"names":["--color"],"argument":"[=<when>]","description":"Color branches to highlight current, local, and remote-tracking branches. The value must be always (the default), never, or auto."},{"names":["--no-color"],"argument":"","description":"Turn off branch colors, even when the configuration file gives the default to color output. Same as --color=never."},{"names":["-i","--ignore-case"],"argument":"","description":"Sorting and filtering branches are case insensitive."},{"names":["--column","--no-column"],"argument":"[=<options>]","description":"Display branch listing in columns. See configuration variable column.branch for option syntax. --column and --no-column without options are equivalent to always and never respectively."},{"names":["-r","--remotes"],"argument":"","description":"List or delete (if used with -d) the remote-tracking branches. Combine with --list to match the optional pattern(s)."},{"names":["-a","--all"],"argument":"","description":"List both remote-tracking branches and local branches. Combine with --list to match optional pattern(s)."},{"names":["-l","--list"],"argument":"","description":"List branches. With optional <pattern>..., e.g. git branch --list 'maint-*', list only the branches that match the pattern(s)."},{"names":["--show-current"],"argument":"","description":"Print the name of the current branch. In detached HEAD state, nothing is printed."},{"names":["-v","-vv","--verbose"],"argument":"","description":"When in list mode, show sha1 and commit subject line for each head, along with relationship to upstream branch (if any). If given twice, print the path of the linked worktree (if any) and the name of the upstream branch, as well (see also git remote show <remote>). Note that the current worktree’s HEAD will not have its path printed (it will always be your current directory)."},{"names":["-q","--quiet"],"argument":"","description":"Be more quiet when creating or deleting a branch, suppressing non-error messages."},{"names":["--abbrev"],"argument":"<n>","description":"In the verbose listing that show the commit object name, show the shortest prefix that is at least <n> hexdigits long that uniquely refers the object. The default value is 7 and can be overridden by the core.abbrev config option."},{"names":["--no-abbrev"],"argument":"","description":"Display the full sha1s in the output listing rather than abbreviating them."},{"names":["-t","--track"],"argument":"[=(direct|inherit)]","description":"When creating a new branch, set up branch.<name>.remote and branch.<name>.merge configuration entries to set \"upstream\" tracking configuration for the new branch. This configuration will tell git to show the relationship between the two branches in git status and git branch -v. Furthermore, it directs git pull without arguments to pull from the upstream when the new branch is checked out."},{"names":["--no-track"],"argument":"","description":"Do not set up \"upstream\" configuration, even if the branch.autoSetupMerge configuration variable is set."},{"names":["--set-upstream"],"argument":"","description":"As this option had confusing syntax, it is no longer supported. Please use --track or --set-upstream-to instead."},{"names":["-u","--set-upstream-to"],"argument":"<upstream>","description":"Set up <branchname>'s tracking information so <upstream> is considered <branchname>'s upstream branch. If no <branchname> is specified, then it defaults to the current branch."},{"names":["--unset-upstream"],"argument":"","description":"Remove the upstream information for <branchname>. If no branch is specified it defaults to the current branch."},{"names":["--edit-description"],"argument":"","description":"Open an editor and edit the text to explain what the branch is for, to be used by various other commands (e.g. format-patch, request-pull, and merge (if enabled)). Multi-line explanations may be used."},{"names":["--contains"],"argument":"[<commit>]","description":"Only list branches which contain the specified commit (HEAD if not specified). Implies --list."},{"names":["--no-contains"],"argument":"[<commit>]","description":"Only list branches which don’t contain the specified commit (HEAD if not specified). Implies --list."},{"names":["--merged"],"argument":"[<commit>]","description":"Only list branches whose tips are reachable from the specified commit (HEAD if not specified). Implies --list."},{"names":["--no-merged"],"argument":"[<commit>]","description":"Only list branches whose tips are not reachable from the specified commit (HEAD if not specified). Implies --list."},{"names":["--sort"],"argument":"<key>","description":"Sort based on the key given. Prefix - to sort in descending order of the value. You may use the --sort=<key> option multiple times, in which case the last key becomes the primary key. The keys supported are the same as those in git for-each-ref. Sort order defaults to the value configured for the branch.sort variable if exists, or to sorting based on the full refname (including refs/... prefix). This lists detached HEAD (if present) first, then local branches and finally remote-tracking branches. See git-config(1)."},{"names":["--points-at"],"argument":"<object>","description":"Only list branches of the given object."},{"names":["--format"],"argument":"<format>","description":"A string that interpolates %(fieldname) from a branch ref being shown and the object it points at. The format is the same as that of git-for-each-ref(1)."}]},{"name":"commit","description":"Record changes to the repository","options":[{"names":["-a","--all"],"argument":"","description":"Tell the command to automatically stage files that have been modified and deleted, but new files you have not told Git about are not affected."},{"names":["-p","--patch"],"argument":"","description":"Use the interactive patch selection interface to choose which changes to commit. See git-add(1) for details."},{"names":["-C","--reuse-message"],"argument":"<commit>","description":"Take an existing commit object, and reuse the log message and the authorship information (including the timestamp) when creating the commit."},{"names":["-c","--reedit-message"],"argument":"<commit>","description":"Like -C, but with -c the editor is invoked, so that the user can further edit the commit message."},{"names":["--fixup"],"argument":"[(amend|reword):]<commit>","description":"Create a new commit which \"fixes up\" <commit> when applied with git rebase --autosquash. Plain --fixup=<commit> creates a \"fixup!\" commit which changes the content of <commit> but leaves its log message untouched. --fixup=amend:<commit> is similar but creates an \"amend!\" commit which also replaces the log message of <commit> with the log message of the \"amend!\" commit. --fixup=reword:<commit> creates an \"amend!\" commit which replaces the log message of <commit> with its own log message but makes no changes to the content of <commit>."},{"names":["--squash"],"argument":"<commit>","description":"Construct a commit message for use with rebase --autosquash. The commit message subject line is taken from the specified commit with a prefix of \"squash! \". Can be used with additional commit message options (-m/-c/-C/-F). See git-rebase(1) for details."},{"names":["--reset-author"],"argument":"","description":"When used with -C/-c/--amend options, or when committing after a conflicting cherry-pick, declare that the authorship of the resulting commit now belongs to the committer. This also renews the author timestamp."},{"names":["--short"],"argument":"","description":"When doing a dry-run, give the output in the short-format. See git-status(1) for details. Implies --dry-run."},{"names":["--branch"],"argument":"","description":"Show the branch and tracking info even in short-format."},{"names":["--porcelain"],"argument":"","description":"When doing a dry-run, give the output in a porcelain-ready format. See git-status(1) for details. Implies --dry-run."},{"names":["--long"],"argument":"","description":"When doing a dry-run, give the output in the long-format. Implies --dry-run."},{"names":["-z","--null"],"argument":"","description":"When showing short or porcelain status output, print the filename verbatim and terminate the entries with NUL, instead of LF. If no format is given, implies the --porcelain output format. Without the -z option, filenames with \"unusual\" characters are quoted as explained for the configuration variable core.quotePath (see git-config(1))."},{"names":["-F","--file"],"argument":"<file>","description":"Take the commit message from the given file. Use - to read the message from the standard input."},{"names":["--author"],"argument":"<author>","description":"Override the commit author. Specify an explicit author using the standard A U Thor <author@example.com> format. Otherwise <author> is assumed to be a pattern and is used to search for an existing commit by that author (i.e. rev-list --all -i --author=<author>); the commit author is then copied from the first such commit found."},{"names":["--date"],"argument":"<date>","description":"Override the author date used in the commit."},{"names":["-m","--message"],"argument":"<msg>","description":"Use the given <msg> as the commit message. If multiple -m options are given, their values are concatenated as separate paragraphs."},{"names":["-t","--template"],"argument":"<file>","description":"When editing the commit message, start the editor with the contents in the given file. The commit.template configuration variable is often used to give this option implicitly to the command. This mechanism can be used by projects that want to guide participants with some hints on what to write in the message in what order. If the user exits the editor without editing the message, the commit is aborted. This has no effect when a message is given by other means, e.g. with the -m or -F options."},{"names":["-s","--signoff","--no-signoff"],"argument":"","description":"Add a Signed-off-by trailer by the committer at the end of the commit log message. The meaning of a signoff depends on the project to which you’re committing. For example, it may certify that the committer has the rights to submit the work under the project’s license or agrees to some contributor representation, such as a Developer Certificate of Origin. (See http://developercertificate.org for the one used by the Linux kernel and Git projects.) Consult the documentation or leadership of the project to which you’re contributing to understand how the signoffs are used in that project."},{"names":["--trailer"],"argument":"<token>[(=|:)<value>]","description":"Specify a (<token>, <value>) pair that should be applied as a trailer. (e.g. git commit --trailer \"Signed-off-by:C O Mitter \\ <committer@example.com>\" --trailer \"Helped-by:C O Mitter \\ <committer@example.com>\" will add the \"Signed-off-by\" trailer and the \"Helped-by\" trailer to the commit message.) The trailer.* configuration variables (git-interpret-trailers(1)) can be used to define if a duplicated trailer is omitted, where in the run of trailers each trailer would appear, and other details."},{"names":["-n","--verify"],"argument":"","description":"By default, the pre-commit and commit-msg hooks are run. When any of --no-verify or -n is given, these are bypassed. See also githooks(5)."},{"names":["-n","--no-verify"],"argument":"","description":"By default, the pre-commit and commit-msg hooks are run. When any of --no-verify or -n is given, these are bypassed. See also githooks(5)."},{"names":["--allow-empty"],"argument":"","description":"Usually recording a commit that has the exact same tree as its sole parent commit is a mistake, and the command prevents you from making such a commit. This option bypasses the safety, and is primarily for use by foreign SCM interface scripts."},{"names":["--allow-empty-message"],"argument":"","description":"Like --allow-empty this command is primarily for use by foreign SCM interface scripts. It allows you to create a commit with an empty commit message without using plumbing commands like git-commit-tree(1)."},{"names":["--cleanup"],"argument":"<mode>","description":"This option determines how the supplied commit message should be cleaned up before committing. The <mode> can be strip, whitespace, verbatim, scissors or default."},{"names":["-e","--edit"],"argument":"","description":"The message taken from file with -F, command line with -m, and from commit object with -C are usually used as the commit log message unmodified. This option lets you further edit the message taken from these sources."},{"names":["--no-edit"],"argument":"","description":"Use the selected commit message without launching an editor. For example, git commit --amend --no-edit amends a commit without changing its commit message."},{"names":["--amend"],"argument":"","description":"Replace the tip of the current branch by creating a new commit. The recorded tree is prepared as usual (including the effect of the -i and -o options and explicit pathspec), and the message from the original commit is used as the starting point, instead of an empty message, when no other message is specified from the command line via options such as -m, -F, -c, etc. The new commit has the same parents and author as the current one (the --reset-author option can countermand this)."},{"names":["--no-post-rewrite"],"argument":"","description":"Bypass the post-rewrite hook."},{"names":["-i","--include"],"argument":"","description":"Before making a commit out of staged contents so far, stage the contents of paths given on the command line as well. This is usually not what you want unless you are concluding a conflicted merge."},{"names":["-o","--only"],"argument":"","description":"Make a commit by taking the updated working tree contents of the paths specified on the command line, disregarding any contents that have been staged for other paths. This is the default mode of operation of git commit if any paths are given on the command line, in which case this option can be omitted. If this option is specified together with --amend, then no paths need to be specified, which can be used to amend the last commit without committing changes that have already been staged. If used together with --allow-empty paths are also not required, and an empty commit will be created."},{"names":["--pathspec-from-file"],"argument":"<file>","description":"Pathspec is passed in <file> instead of commandline args. If <file> is exactly - then standard input is used. Pathspec elements are separated by LF or CR/LF. Pathspec elements can be quoted as explained for the configuration variable core.quotePath (see git-config(1)). See also --pathspec-file-nul and global --literal-pathspecs."},{"names":["--pathspec-file-nul"],"argument":"","description":"Only meaningful with --pathspec-from-file. Pathspec elements are separated with NUL character and all other characters are taken literally (including newlines and quotes)."},{"names":["-u","--untracked-files"],"argument":"[<mode>]","description":"Show untracked files."},{"names":["-v","--verbose"],"argument":"","description":"Show unified diff between the HEAD commit and what would be committed at the bottom of the commit message template to help the user describe the commit by reminding what changes the commit has. Note that this diff output doesn’t have its lines prefixed with #. This diff will not be a part of the commit message. See the commit.verbose configuration variable in git-config(1)."},{"names":["-q","--quiet"],"argument":"","description":"Suppress commit summary message."},{"names":["--dry-run"],"argument":"","description":"Do not create a commit, but show a list of paths that are to be committed, paths with local changes that will be left uncommitted and paths that are untracked."},{"names":["--status"],"argument":"","description":"Include the output of git-status(1) in the commit message template when using an editor to prepare the commit message. Defaults to on, but can be used to override configuration variable commit.status."},{"names":["--no-status"],"argument":"","description":"Do not include the output of git-status(1) in the commit message template when using an editor to prepare the default commit message."},{"names":["-S","--gpg-sign","--no-gpg-sign"],"argument":"[<keyid>]","description":"GPG-sign commits. The keyid argument is optional and defaults to the committer identity; if specified, it must be stuck to the option without a space. --no-gpg-sign is useful to countermand both commit.gpgSign configuration variable, and earlier --gpg-sign."},{"names":["--"],"argument":"","description":"Do not interpret any more arguments as options."}]},{"name":"merge","description":"Join two or more development histories together","options":[{"names":["--commit","--no-commit"],"argument":"","description":"Perform the merge and commit the result. This option can be used to override --no-commit."},{"names":["--edit","-e","--no-edit"],"argument":"","description":"Invoke an editor before committing successful mechanical merge to further edit the auto-generated merge message, so that the user can explain and justify the merge. The --no-edit option can be used to accept the auto-generated message (this is generally discouraged). The --edit (or -e) option is still useful if you are giving a draft message with the -m option from the command line and want to edit it in the editor."},{"names":["--cleanup"],"argument":"<mode>","description":"This option determines how the merge message will be cleaned up before committing. See git-commit(1) for more details. In addition, if the <mode> is given a value of scissors, scissors will be appended to MERGE_MSG before being passed on to the commit machinery in the case of a merge conflict."},{"names":["--ff","--no-ff","--ff-only"],"argument":"","description":"Specifies how a merge is handled when the merged-in history is already a descendant of the current history. --ff is the default unless merging an annotated (and possibly signed) tag that is not stored in its natural place in the refs/tags/ hierarchy, in which case --no-ff is assumed."},{"names":["-S","--gpg-sign","--no-gpg-sign"],"argument":"[<keyid>]","description":"GPG-sign the resulting merge commit. The keyid argument is optional and defaults to the committer identity; if specified, it must be stuck to the option without a space. --no-gpg-sign is useful to countermand both commit.gpgSign configuration variable, and earlier --gpg-sign."},{"names":["--log","--no-log"],"argument":"[=<n>]","description":"In addition to branch names, populate the log message with one-line descriptions from at most <n> actual commits that are being merged. See also git-fmt-merge-msg(1)."},{"names":["--signoff","--no-signoff"],"argument":"","description":"Add a Signed-off-by trailer by the committer at the end of the commit log message. The meaning of a signoff depends on the project to which you’re committing. For example, it may certify that the committer has the rights to submit the work under the project’s license or agrees to some contributor representation, such as a Developer Certificate of Origin. (See http://developercertificate.org for the one used by the Linux kernel and Git projects.) Consult the documentation or leadership of the project to which you’re contributing to understand how the signoffs are used in that project."},{"names":["--stat","-n","--no-stat"],"argument":"","description":"Show a diffstat at the end of the merge. The diffstat is also controlled by the configuration option merge.stat."},{"names":["--squash","--no-squash"],"argument":"","description":"Produce the working tree and index state as if a real merge happened (except for the merge information), but do not actually make a commit, move the HEAD, or record $GIT_DIR/MERGE_HEAD (to cause the next git commit command to create a merge commit). This allows you to create a single commit on top of the current branch whose effect is the same as merging another branch (or more in case of an octopus)."},{"names":["--verify"],"argument":"","description":"By default, the pre-merge and commit-msg hooks are run. When --no-verify is given, these are bypassed. See also githooks(5)."},{"names":["--no-verify"],"argument":"","description":"By default, the pre-merge and commit-msg hooks are run. When --no-verify is given, these are bypassed. See also githooks(5)."},{"names":["-s","--strategy"],"argument":"<strategy>","description":"Use the given merge strategy; can be supplied more than once to specify them in the order they should be tried. If there is no -s option, a built-in list of strategies is used instead (ort when merging a single head, octopus otherwise)."},{"names":["-X","--strategy-option"],"argument":"<option>","description":"Pass merge strategy specific option through to the merge strategy."},{"names":["--verify-signatures","--no-verify-signatures"],"argument":"","description":"Verify that the tip commit of the side branch being merged is signed with a valid key, i.e. a key that has a valid uid: in the default trust model, this means the signing key has been signed by a trusted key. If the tip commit of the side branch is not signed with a valid key, the merge is aborted."},{"names":["--summary","--no-summary"],"argument":"","description":"Synonyms to --stat and --no-stat; these are deprecated and will be removed in the future."},{"names":["-q","--quiet"],"argument":"","description":"Operate quietly. Implies --no-progress."},{"names":["-v","--verbose"],"argument":"","description":"Be verbose."},{"names":["--progress","--no-progress"],"argument":"","description":"Turn progress on/off explicitly. If neither is specified, progress is shown if standard error is connected to a terminal. Note that not all merge strategies may support progress reporting."},{"names":["--autostash","--no-autostash"],"argument":"","description":"Automatically create a temporary stash entry before the operation begins, record it in the special ref MERGE_AUTOSTASH and apply it after the operation ends. This means that you can run the operation on a dirty worktree. However, use with care: the final stash application after a successful merge might result in non-trivial conflicts."},{"names":["--allow-unrelated-histories"],"argument":"","description":"By default, git merge command refuses to merge histories that do not share a common ancestor. This option can be used to override this safety when merging histories of two projects that started their lives independently. As that is a very rare occasion, no configuration variable to enable this by default exists and will not be added."},{"names":["-m"],"argument":"<msg>","description":"Set the commit message to be used for the merge commit (in case one is created)."},{"names":["--into-name"],"argument":"<branch>","description":"Prepare the default merge message as if merging to the branch <branch>, instead of the name of the real branch to which the merge is made."},{"names":["-F","--file"],"argument":"<file>","description":"Read the commit message to be used for the merge commit (in case one is created)."},{"names":["--rerere-autoupdate","--no-rerere-autoupdate"],"argument":"","description":"Allow the rerere mechanism to update the index with the result of auto-conflict resolution if possible."},{"names":["--overwrite-ignore","--no-overwrite-ignore"],"argument":"","description":"Silently overwrite ignored files from the merge result. This is the default behavior. Use --no-overwrite-ignore to abort."},{"names":["--abort"],"argument":"","description":"Abort the current conflict resolution process, and try to reconstruct the pre-merge state. If an autostash entry is present, apply it to the worktree."},{"names":["--quit"],"argument":"","description":"Forget about the current merge in progress. Leave the index and the working tree as-is. If MERGE_AUTOSTASH is present, the stash entry will be saved to the stash list."},{"names":["--continue"],"argument":"","description":"After a git merge stops due to conflicts you can conclude the merge by running git merge --continue (see \"HOW TO RESOLVE CONFLICTS\" section below)."}]},{"name":"rebase","description":"Reapply commits on top of another base tip","options":[{"names":["--onto"],"argument":"<newbase>","description":"Starting point at which to create the new commits. If the --onto option is not specified, the starting point is <upstream>. May be any valid commit, and not just an existing branch name."},{"names":["--keep-base"],"argument":"","description":"Set the starting point at which to create the new commits to the merge base of <upstream> <branch>. Running git rebase --keep-base <upstream> <branch> is equivalent to running git rebase --onto <upstream>... <upstream>."},{"names":["--continue"],"argument":"","description":"Restart the rebasing process after having resolved a merge conflict."},{"names":["--abort"],"argument":"","description":"Abort the rebase operation and reset HEAD to the original branch. If <branch> was provided when the rebase operation was started, then HEAD will be reset to <branch>. Otherwise HEAD will be reset to where it was when the rebase operation was started."},{"names":["--quit"],"argument":"","description":"Abort the rebase operation but HEAD is not reset back to the original branch. The index and working tree are also left unchanged as a result. If a temporary stash entry was created using --autostash, it will be saved to the stash list."},{"names":["--apply"],"argument":"","description":"Use applying strategies to rebase (calling git-am internally). This option may become a no-op in the future once the merge backend handles everything the apply one does."},{"names":["--empty"],"argument":"{drop,keep,ask}","description":"How to handle commits that are not empty to start and are not clean cherry-picks of any upstream commit, but which become empty after rebasing (because they contain a subset of already upstream changes). With drop (the default), commits that become empty are dropped. With keep, such commits are kept. With ask (implied by --interactive), the rebase will halt when an empty commit is applied allowing you to choose whether to drop it, edit files more, or just commit the empty changes. Other options, like --exec, will use the default of drop unless -i/--interactive is explicitly specified."},{"names":["--no-keep-empty","--keep-empty"],"argument":"","description":"Do not keep commits that start empty before the rebase (i.e. that do not change anything from its parent) in the result. The default is to keep commits which start empty, since creating such commits requires passing the --allow-empty override flag to git commit, signifying that a user is very intentionally creating such a commit and thus wants to keep it."},{"names":["--reapply-cherry-picks","--no-reapply-cherry-picks"],"argument":"","description":"Reapply all clean cherry-picks of any upstream commit instead of preemptively dropping them. (If these commits then become empty after rebasing, because they contain a subset of already upstream changes, the behavior towards them is controlled by the --empty flag.)"},{"names":["--allow-empty-message"],"argument":"","description":"No-op. Rebasing commits with an empty message used to fail and this option would override that behavior, allowing commits with empty messages to be rebased. Now commits with an empty message do not cause rebasing to halt."},{"names":["--skip"],"argument":"","description":"Restart the rebasing process by skipping the current patch."},{"names":["--edit-todo"],"argument":"","description":"Edit the todo list during an interactive rebase."},{"names":["--show-current-patch"],"argument":"","description":"Show the current patch in an interactive rebase or when rebase is stopped because of conflicts. This is the equivalent of git show REBASE_HEAD."},{"names":["-m","--merge"],"argument":"","description":"Using merging strategies to rebase (default)."},{"names":["-s","--strategy"],"argument":"<strategy>","description":"Use the given merge strategy, instead of the default ort. This implies --merge."},{"names":["-X","--strategy-option"],"argument":"<strategy-option>","description":"Pass the <strategy-option> through to the merge strategy. This implies --merge and, if no strategy has been specified, -s ort. Note the reversal of ours and theirs as noted above for the -m option."},{"names":["--rerere-autoupdate","--no-rerere-autoupdate"],"argument":"","description":"Allow the rerere mechanism to update the index with the result of auto-conflict resolution if possible."},{"names":["-S","--gpg-sign","--no-gpg-sign"],"argument":"[<keyid>]","description":"GPG-sign commits. The keyid argument is optional and defaults to the committer identity; if specified, it must be stuck to the option without a space. --no-gpg-sign is useful to countermand both commit.gpgSign configuration variable, and earlier --gpg-sign."},{"names":["-q","--quiet"],"argument":"","description":"Be quiet. Implies --no-stat."},{"names":["-v","--verbose"],"argument":"","description":"Be verbose. Implies --stat."},{"names":["--stat"],"argument":"","description":"Show a diffstat of what changed upstream since the last rebase. The diffstat is also controlled by the configuration option rebase.stat."},{"names":["-n","--no-stat"],"argument":"","description":"Do not show a diffstat as part of the rebase process."},{"names":["--no-verify"],"argument":"","description":"This option bypasses the pre-rebase hook. See also githooks(5)."},{"names":["--verify"],"argument":"","description":"Allows the pre-rebase hook to run, which is the default. This option can be used to override --no-verify. See also githooks(5)."},{"names":["-C"],"argument":"<n>","description":"Ensure at least <n> lines of surrounding context match before and after each change. When fewer lines of surrounding context exist they all must match. By default no context is ever ignored. Implies --apply."},{"names":["--no-ff","--force-rebase","-f"],"argument":"","description":"Individually replay all rebased commits instead of fast-forwarding over the unchanged ones. This ensures that the entire history of the rebased branch is composed of new commits."},{"names":["--fork-point","--no-fork-point"],"argument":"","description":"Use reflog to find a better common ancestor between <upstream> and <branch> when calculating which commits have been introduced by <branch>."},{"names":["--ignore-whitespace"],"argument":"","description":"Ignore whitespace differences when trying to reconcile differences. Currently, each backend implements an approximation of this behavior:"},{"names":["--whitespace"],"argument":"<option>","description":"This flag is passed to the git apply program (see git-apply(1)) that applies the patch. Implies --apply."},{"names":["--committer-date-is-author-date"],"argument":"","description":"Instead of using the current time as the committer date, use the author date of the commit being rebased as the committer date. This option implies --force-rebase."},{"names":["--ignore-date","--reset-author-date"],"argument":"","description":"Instead of using the author date of the original commit, use the current time as the author date of the rebased commit. This option implies --force-rebase."},{"names":["--signoff"],"argument":"","description":"Add a Signed-off-by trailer to all the rebased commits. Note that if --interactive is given then only commits marked to be picked, edited or reworded will have the trailer added."},{"names":["-i","--interactive"],"argument":"","description":"Make a list of the commits which are about to be rebased. Let the user edit that list before rebasing. This mode can also be used to split commits (see SPLITTING COMMITS below)."},{"names":["-r","--rebase-merges"],"argument":"[=(rebase-cousins|no-rebase-cousins)]","description":"By default, a rebase will simply drop merge commits from the todo list, and put the rebased commits into a single, linear branch. With --rebase-merges, the rebase will instead try to preserve the branching structure within the commits that are to be rebased, by recreating the merge commits. Any resolved merge conflicts or manual amendments in these merge commits will have to be resolved/re-applied manually."},{"names":["-x","--exec"],"argument":"<cmd>","description":"Append \"exec <cmd>\" after each line creating a commit in the final history. <cmd> will be interpreted as one or more shell commands. Any command that fails will interrupt the rebase, with exit code 1."},{"names":["--root"],"argument":"","description":"Rebase all commits reachable from <branch>, instead of limiting them with an <upstream>. This allows you to rebase the root commit(s) on a branch. When used with --onto, it will skip changes already contained in <newbase> (instead of <upstream>) whereas without --onto it will operate on every change."},{"names":["--autosquash","--no-autosquash"],"argument":"","description":"When the commit log message begins with \"squash! ...\" or \"fixup! ...\" or \"amend! ...\", and there is already a commit in the todo list that matches the same ..., automatically modify the todo list of rebase -i, so that the commit marked for squashing comes right after the commit to be modified, and change the action of the moved commit from pick to squash or fixup or fixup -C respectively. A commit matches the ... if the commit subject matches, or if the ... refers to the commit’s hash. As a fall-back, partial matches of the commit subject work, too. The recommended way to create fixup/amend/squash commits is by using the --fixup, --fixup=amend: or --fixup=reword: and --squash options respectively of git-commit(1)."},{"names":["--autostash","--no-autostash"],"argument":"","description":"Automatically create a temporary stash entry before the operation begins, and apply it after the operation ends. This means that you can run rebase on a dirty worktree. However, use with care: the final stash application after a successful rebase might result in non-trivial conflicts."},{"names":["--reschedule-failed-exec","--no-reschedule-failed-exec"],"argument":"","description":"Automatically reschedule exec commands that failed. This only makes sense in interactive mode (or when an --exec option was provided)."}]},{"name":"reset","description":"Reset current HEAD to the specified state","options":[{"names":["--soft"],"argument":"","description":"Does not touch the index file or the working tree at all (but resets the head to <commit>, just like all modes do). This leaves all your changed files \"Changes to be committed\", as git status would put it."},{"names":["--mixed"],"argument":"","description":"Resets the index but not the working tree (i.e., the changed files are preserved but not marked for commit) and reports what has not been updated. This is the default action."},{"names":["--hard"],"argument":"","description":"Resets the index and working tree. Any changes to tracked files in the working tree since <commit> are discarded. Any untracked files or directories in the way of writing any tracked files are simply deleted."},{"names":["--merge"],"argument":"","description":"Resets the index and updates the files in the working tree that are different between <commit> and HEAD, but keeps those which are different between the index and working tree (i.e. which have changes which have not been added). If a file that is different between <commit> and the index has unstaged changes, reset is aborted."},{"names":["--keep"],"argument":"","description":"Resets index entries and updates files in the working tree that are different between <commit> and HEAD. If a file that is different between <commit> and HEAD has local changes, reset is aborted."},{"names":["--recurse-submodules"],"argument":"","description":"When the working tree is updated, using --recurse-submodules will also recursively reset the working tree of all active submodules according to the commit recorded in the superproject, also setting the submodules' HEAD to be detached at that commit."},{"names":["--no-recurse-submodules"],"argument":"","description":"When the working tree is updated, using --recurse-submodules will also recursively reset the working tree of all active submodules according to the commit recorded in the superproject, also setting the submodules' HEAD to be detached at that commit."},{"names":["-q","--quiet","--no-quiet"],"argument":"","description":"Be quiet, only report errors. The default behavior is set by the reset.quiet config option. --quiet and --no-quiet will override the default behavior."},{"names":["--pathspec-from-file"],"argument":"<file>","description":"Pathspec is passed in <file> instead of commandline args. If <file> is exactly - then standard input is used. Pathspec elements are separated by LF or CR/LF. Pathspec elements can be quoted as explained for the configuration variable core.quotePath (see git-config(1)). See also --pathspec-file-nul and global --literal-pathspecs."},{"names":["--pathspec-file-nul"],"argument":"","description":"Only meaningful with --pathspec-from-file. Pathspec elements are separated with NUL character and all other characters are taken literally (including newlines and quotes)."},{"names":["--"],"argument":"","description":"Do not interpret any more arguments as options."}]},{"name":"switch","description":"Switch branches","options":[{"names":["-c","--create"],"argument":"<new-branch>","description":"Create a new branch named <new-branch> starting at <start-point> before switching to the branch. This is a convenient shortcut for:"},{"names":["-C","--force-create"],"argument":"<new-branch>","description":"Similar to --create except that if <new-branch> already exists, it will be reset to <start-point>. This is a convenient shortcut for:"},{"names":["-d","--detach"],"argument":"","description":"Switch to a commit for inspection and discardable experiments. See the \"DETACHED HEAD\" section in git-checkout(1) for details."},{"names":["--guess","--no-guess"],"argument":"","description":"If <branch> is not found but there does exist a tracking branch in exactly one remote (call it <remote>) with a matching name, treat as equivalent to"},{"names":["-f","--force"],"argument":"","description":"An alias for --discard-changes."},{"names":["--discard-changes"],"argument":"","description":"Proceed even if the index or the working tree differs from HEAD. Both the index and working tree are restored to match the switching target. If --recurse-submodules is specified, submodule content is also restored to match the switching target. This is used to throw away local changes."},{"names":["-m","--merge"],"argument":"","description":"If you have local modifications to one or more files that are different between the current branch and the branch to which you are switching, the command refuses to switch branches in order to preserve your modifications in context. However, with this option, a three-way merge between the current branch, your working tree contents, and the new branch is done, and you will be on the new branch."},{"names":["--conflict"],"argument":"<style>","description":"The same as --merge option above, but changes the way the conflicting hunks are presented, overriding the merge.conflictStyle configuration variable. Possible values are \"merge\" (default), \"diff3\", and \"zdiff3\"."},{"names":["-q","--quiet"],"argument":"","description":"Quiet, suppress feedback messages."},{"names":["--progress","--no-progress"],"argument":"","description":"Progress status is reported on the standard error stream by default when it is attached to a terminal, unless --quiet is specified. This flag enables progress reporting even if not attached to a terminal, regardless of --quiet."},{"names":["-t","--track"],"argument":"[direct|inherit]","description":"When creating a new branch, set up \"upstream\" configuration. -c is implied. See --track in git-branch(1) for details."},{"names":["--no-track"],"argument":"","description":"Do not set up \"upstream\" configuration, even if the branch.autoSetupMerge configuration variable is true."},{"names":["--orphan"],"argument":"<new-branch>","description":"Create a new orphan branch, named <new-branch>. All tracked files are removed."},{"names":["--ignore-other-worktrees"],"argument":"","description":"git switch refuses when the wanted ref is already checked out by another worktree. This option makes it check the ref out anyway. In other words, the ref can be held by more than one worktree."},{"names":["--recurse-submodules","--no-recurse-submodules"],"argument":"","description":"Using --recurse-submodules will update the content of all active submodules according to the commit recorded in the superproject. If nothing (or --no-recurse-submodules) is used, submodules working trees will not be updated. Just like git-submodule(1), this will detach HEAD of the submodules."}]},{"name":"tag","description":"Create, list, delete or verify a tag object signed with GPG","options":[{"names":["-a","--annotate"],"argument":"","description":"Make an unsigned, annotated tag object"},{"names":["-s","--sign"],"argument":"","description":"Make a GPG-signed tag, using the default e-mail address’s key. The default behavior of tag GPG-signing is controlled by tag.gpgSign configuration variable if it exists, or disabled otherwise. See git-config(1)."},{"names":["--no-sign"],"argument":"","description":"Override tag.gpgSign configuration variable that is set to force each and every tag to be signed."},{"names":["-u","--local-user"],"argument":"<keyid>","description":"Make a GPG-signed tag, using the given key."},{"names":["-f","--force"],"argument":"","description":"Replace an existing tag with the given name (instead of failing)"},{"names":["-d","--delete"],"argument":"","description":"Delete existing tags with the given names."},{"names":["-v","--verify"],"argument":"","description":"Verify the GPG signature of the given tag names."},{"names":["-n"],"argument":"<num>","description":"<num> specifies how many lines from the annotation, if any, are printed when using -l. Implies --list."},{"names":["-l","--list"],"argument":"","description":"List tags. With optional <pattern>..., e.g. git tag --list 'v-*', list only the tags that match the pattern(s)."},{"names":["--sort"],"argument":"<key>","description":"Sort based on the key given. Prefix - to sort in descending order of the value. You may use the --sort=<key> option multiple times, in which case the last key becomes the primary key. Also supports \"version:refname\" or \"v:refname\" (tag names are treated as versions). The \"version:refname\" sort order can also be affected by the \"versionsort.suffix\" configuration variable. The keys supported are the same as those in git for-each-ref. Sort order defaults to the value configured for the tag.sort variable if it exists, or lexicographic order otherwise. See git-config(1)."},{"names":["--color"],"argument":"[=<when>]","description":"Respect any colors specified in the --format option. The <when> field must be one of always, never, or auto (if <when> is absent, behave as if always was given)."},{"names":["-i","--ignore-case"],"argument":"","description":"Sorting and filtering tags are case insensitive."},{"names":["--column","--no-column"],"argument":"[=<options>]","description":"Display tag listing in columns. See configuration variable column.tag for option syntax. --column and --no-column without options are equivalent to always and never respectively."},{"names":["--contains"],"argument":"[<commit>]","description":"Only list tags which contain the specified commit (HEAD if not specified). Implies --list."},{"names":["--no-contains"],"argument":"[<commit>]","description":"Only list tags which don’t contain the specified commit (HEAD if not specified). Implies --list."},{"names":["--merged"],"argument":"[<commit>]","description":"Only list tags whose commits are reachable from the specified commit (HEAD if not specified)."},{"names":["--no-merged"],"argument":"[<commit>]","description":"Only list tags whose commits are not reachable from the specified commit (HEAD if not specified)."},{"names":["--points-at"],"argument":"<object>","description":"Only list tags of the given object (HEAD if not specified). Implies --list."},{"names":["-m","--message"],"argument":"<msg>","description":"Use the given tag message (instead of prompting). If multiple -m options are given, their values are concatenated as separate paragraphs. Implies -a if none of -a, -s, or -u <keyid> is given."},{"names":["-F","--file"],"argument":"<file>","description":"Take the tag message from the given file. Use - to read the message from the standard input. Implies -a if none of -a, -s, or -u <keyid> is given."},{"names":["-e","--edit"],"argument":"","description":"The message taken from file with -F and command line with -m are usually used as the tag message unmodified. This option lets you further edit the message taken from these sources."},{"names":["--cleanup"],"argument":"<mode>","description":"This option sets how the tag message is cleaned up. The <mode> can be one of verbatim, whitespace and strip. The strip mode is default. The verbatim mode does not change message at all, whitespace removes just leading/trailing whitespace lines and strip removes both whitespace and commentary."},{"names":["--create-reflog"],"argument":"","description":"Create a reflog for the tag. To globally enable reflogs for tags, see core.logAllRefUpdates in git-config(1). The negated form --no-create-reflog only overrides an earlier --create-reflog, but currently does not negate the setting of core.logAllRefUpdates."},{"names":["--format"],"argument":"<format>","description":"A string that interpolates %(fieldname) from a tag ref being shown and the object it points at. The format is the same as that of git-for-each-ref(1). When unspecified, defaults to %(refname:strip=2)."}]},{"name":"fetch","description":"Download objects and refs from another repository","options":[{"names":["--all"],"argument":"","description":"Fetch all remotes."},{"names":["-a","--append"],"argument":"","description":"Append ref names and object names of fetched refs to the existing contents of .git/FETCH_HEAD. Without this option old data in .git/FETCH_HEAD will be overwritten."},{"names":["--atomic"],"argument":"","description":"Use an atomic transaction to update local refs. Either all refs are updated, or on error, no refs are updated."},{"names":["--depth"],"argument":"<depth>","description":"Limit fetching to the specified number of commits from the tip of each remote branch history. If fetching to a shallow repository created by git clone with --depth=<depth> option (see git-clone(1)), deepen or shorten the history to the specified number of commits. Tags for the deepened commits are not fetched."},{"names":["--deepen"],"argument":"<depth>","description":"Similar to --depth, except it specifies the number of commits from the current shallow boundary instead of from the tip of each remote branch history."},{"names":["--shallow-since"],"argument":"<date>","description":"Deepen or shorten the history of a shallow repository to include all reachable commits after <date>."},{"names":["--shallow-exclude"],"argument":"<revision>","description":"Deepen or shorten the history of a shallow repository to exclude commits reachable from a specified remote branch or tag. This option can be specified multiple times."},{"names":["--unshallow"],"argument":"","description":"If the source repository is complete, convert a shallow repository to a complete one, removing all the limitations imposed by shallow repositories."},{"names":["--update-shallow"],"argument":"","description":"By default when fetching from a shallow repository, git fetch refuses refs that require updating .git/shallow. This option updates .git/shallow and accept such refs."},{"names":["--negotiation-tip"],"argument":"<commit|glob>","description":"By default, Git will report, to the server, commits reachable from all local refs to find common commits in an attempt to reduce the size of the to-be-received packfile. If specified, Git will only report commits reachable from the given tips. This is useful to speed up fetches when the user knows which local ref is likely to have commits in common with the upstream ref being fetched."},{"names":["--negotiate-only"],"argument":"","description":"Do not fetch anything from the server, and instead print the ancestors of the provided --negotiation-tip=* arguments, which we have in common with the server."},{"names":["--dry-run"],"argument":"","description":"Show what would be done, without making any changes."},{"names":["--write-fetch-head"],"argument":"","description":"Write the list of remote refs fetched in the FETCH_HEAD file directly under $GIT_DIR. This is the default. Passing --no-write-fetch-head from the command line tells Git not to write the file. Under --dry-run option, the file is never written."},{"names":["--no-write-fetch-head"],"argument":"","description":"Write the list of remote refs fetched in the FETCH_HEAD file directly under $GIT_DIR. This is the default. Passing --no-write-fetch-head from the command line tells Git not to write the file. Under --dry-run option, the file is never written."},{"names":["-f","--force"],"argument":"","description":"When git fetch is used with <src>:<dst> refspec it may refuse to update the local branch as discussed in the <refspec> part below. This option overrides that check."},{"names":["-k","--keep"],"argument":"","description":"Keep downloaded pack."},{"names":["--multiple"],"argument":"","description":"Allow several <repository> and <group> arguments to be specified. No <refspec>s may be specified."},{"names":["--write-commit-graph"],"argument":"","description":"Write a commit-graph after fetching. This overrides the config setting fetch.writeCommitGraph."},{"names":["--no-write-commit-graph"],"argument":"","description":"Write a commit-graph after fetching. This overrides the config setting fetch.writeCommitGraph."},{"names":["--prefetch"],"argument":"","description":"Modify the configured refspec to place all refs into the refs/prefetch/ namespace. See the prefetch task in git-maintenance(1)."},{"names":["-p","--prune"],"argument":"","description":"Before fetching, remove any remote-tracking references that no longer exist on the remote. Tags are not subject to pruning if they are fetched only because of the default tag auto-following or due to a --tags option. However, if tags are fetched due to an explicit refspec (either on the command line or in the remote configuration, for example if the remote was cloned with the --mirror option), then they are also subject to pruning. Supplying --prune-tags is a shorthand for providing the tag refspec."},{"names":["-P","--prune-tags"],"argument":"","description":"Before fetching, remove any local tags that no longer exist on the remote if --prune is enabled. This option should be used more carefully, unlike --prune it will remove any local references (local tags) that have been created. This option is a shorthand for providing the explicit tag refspec along with --prune, see the discussion about that in its documentation."},{"names":["-n","--no-tags"],"argument":"","description":"By default, tags that point at objects that are downloaded from the remote repository are fetched and stored locally. This option disables this automatic tag following. The default behavior for a remote may be specified with the remote.<name>.tagOpt setting. See git-config(1)."},{"names":["--refmap"],"argument":"<refspec>","description":"When fetching refs listed on the command line, use the specified refspec (can be given more than once) to map the refs to remote-tracking branches, instead of the values of remote.*.fetch configuration variables for the remote repository. Providing an empty <refspec> to the --refmap option causes Git to ignore the configured refspecs and rely entirely on the refspecs supplied as command-line arguments. See section on \"Configured Remote-tracking Branches\" for details."},{"names":["-t","--tags"],"argument":"","description":"Fetch all tags from the remote (i.e., fetch remote tags refs/tags/* into local tags with the same name), in addition to whatever else would otherwise be fetched. Using this option alone does not subject tags to pruning, even if --prune is used (though tags may be pruned anyway if they are also the destination of an explicit refspec; see --prune)."},{"names":["--recurse-submodules"],"argument":"[=yes|on-demand|no]","description":"This option controls if and under what conditions new commits of populated submodules should be fetched too. It can be used as a boolean option to completely disable recursion when set to no or to unconditionally recurse into all populated submodules when set to yes, which is the default when this option is used without any value. Use on-demand to only recurse into a populated submodule when the superproject retrieves a commit that updates the submodule’s reference to a commit that isn’t already in the local submodule clone. By default, on-demand is used, unless fetch.recurseSubmodules is set (see git-config(1))."},{"names":["-j","--jobs"],"argument":"<n>","description":"Number of parallel children to be used for all forms of fetching."},{"names":["--no-recurse-submodules"],"argument":"","description":"Disable recursive fetching of submodules (this has the same effect as using the --recurse-submodules=no option)."},{"names":["--set-upstream"],"argument":"","description":"If the remote is fetched successfully, add upstream (tracking) reference, used by argument-less git-pull(1) and other commands. For more information, see branch.<name>.merge and branch.<name>.remote in git-config(1)."},{"names":["--submodule-prefix"],"argument":"<path>","description":"Prepend <path> to paths printed in informative messages such as \"Fetching submodule foo\". This option is used internally when recursing over submodules."},{"names":["--recurse-submodules-default"],"argument":"[yes|on-demand]","description":"This option is used internally to temporarily provide a non-negative default value for the --recurse-submodules option. All other methods of configuring fetch’s submodule recursion (such as settings in gitmodules(5) and git-config(1)) override this option, as does specifying --[no-]recurse-submodules directly."},{"names":["-u","--update-head-ok"],"argument":"","description":"By default git fetch refuses to update the head which corresponds to the current branch. This flag disables the check. This is purely for the internal use for git pull to communicate with git fetch, and unless you are implementing your own Porcelain you are not supposed to use it."},{"names":["--upload-pack"],"argument":"<upload-pack>","description":"When given, and the repository to fetch from is handled by git fetch-pack, --exec=<upload-pack> is passed to the command to specify non-default path for the command run on the other end."},{"names":["-q","--quiet"],"argument":"","description":"Pass --quiet to git-fetch-pack and silence any other internally used git commands. Progress is not reported to the standard error stream."},{"names":["-v","--verbose"],"argument":"","description":"Be verbose."},{"names":["--progress"],"argument":"","description":"Progress status is reported on the standard error stream by default when it is attached to a terminal, unless -q is specified. This flag forces progress status even if the standard error stream is not directed to a terminal."},{"names":["-o","--server-option"],"argument":"<option>","description":"Transmit the given string to the server when communicating using protocol version 2. The given string must not contain a NUL or LF character. The server’s handling of server options, including unknown ones, is server-specific. When multiple --server-option=<option> are given, they are all sent to the other side in the order listed on the command line."},{"names":["--show-forced-updates"],"argument":"","description":"By default, git checks if a branch is force-updated during fetch. This can be disabled through fetch.showForcedUpdates, but the --show-forced-updates option guarantees this check occurs. See git-config(1)."},{"names":["--no-show-forced-updates"],"argument":"","description":"By default, git checks if a branch is force-updated during fetch. Pass --no-show-forced-updates or set fetch.showForcedUpdates to false to skip this check for performance reasons. If used during git-pull the --ff-only option will still check for forced updates before attempting a fast-forward update. See git-config(1)."},{"names":["-4","--ipv4"],"argument":"","description":"Use IPv4 addresses only, ignoring IPv6 addresses."},{"names":["-6","--ipv6"],"argument":"","description":"Use IPv6 addresses only, ignoring IPv4 addresses."},{"names":["--stdin"],"argument":"","description":"Read refspecs, one per line, from stdin in addition to those provided as arguments. The \"tag <name>\" format is not supported."}]},{"name":"pull","description":"Fetch from and integrate with another repository or a local branch","options":[{"names":["-q","--quiet"],"argument":"","description":"This is passed to both underlying git-fetch to squelch reporting of during transfer, and underlying git-merge to squelch output during merging."},{"names":["-v","--verbose"],"argument":"","description":"Pass --verbose to git-fetch and git-merge."},{"names":["--commit","--no-commit"],"argument":"","description":"Perform the merge and commit the result. This option can be used to override --no-commit. Only useful when merging."},{"names":["--edit","-e","--no-edit"],"argument":"","description":"Invoke an editor before committing successful mechanical merge to further edit the auto-generated merge message, so that the user can explain and justify the merge. The --no-edit option can be used to accept the auto-generated message (this is generally discouraged)."},{"names":["--cleanup"],"argument":"<mode>","description":"This option determines how the merge message will be cleaned up before committing. See git-commit(1) for more details. In addition, if the <mode> is given a value of scissors, scissors will be appended to MERGE_MSG before being passed on to the commit machinery in the case of a merge conflict."},{"names":["--ff-only"],"argument":"","description":"Only update to the new history if there is no divergent local history. This is the default when no method for reconciling divergent histories is provided (via the --rebase=* flags)."},{"names":["--ff","--no-ff"],"argument":"","description":"When merging rather than rebasing, specifies how a merge is handled when the merged-in history is already a descendant of the current history. If merging is requested, --ff is the default unless merging an annotated (and possibly signed) tag that is not stored in its natural place in the refs/tags/ hierarchy, in which case --no-ff is assumed."},{"names":["-S","--gpg-sign","--no-gpg-sign"],"argument":"[<keyid>]","description":"GPG-sign the resulting merge commit. The keyid argument is optional and defaults to the committer identity; if specified, it must be stuck to the option without a space. --no-gpg-sign is useful to countermand both commit.gpgSign configuration variable, and earlier --gpg-sign."},{"names":["--log","--no-log"],"argument":"[=<n>]","description":"In addition to branch names, populate the log message with one-line descriptions from at most <n> actual commits that are being merged. See also git-fmt-merge-msg(1). Only useful when merging."},{"names":["--signoff","--no-signoff"],"argument":"","description":"Add a Signed-off-by trailer by the committer at the end of the commit log message. The meaning of a signoff depends on the project to which you’re committing. For example, it may certify that the committer has the rights to submit the work under the project’s license or agrees to some contributor representation, such as a Developer Certificate of Origin. (See http://developercertificate.org for the one used by the Linux kernel and Git projects.) Consult the documentation or leadership of the project to which you’re contributing to understand how the signoffs are used in that project."},{"names":["--stat","-n","--no-stat"],"argument":"","description":"Show a diffstat at the end of the merge. The diffstat is also controlled by the configuration option merge.stat."},{"names":["--squash","--no-squash"],"argument":"","description":"Produce the working tree and index state as if a real merge happened (except for the merge information), but do not actually make a commit, move the HEAD, or record $GIT_DIR/MERGE_HEAD (to cause the next git commit command to create a merge commit). This allows you to create a single commit on top of the current branch whose effect is the same as merging another branch (or more in case of an octopus)."},{"names":["--verify"],"argument":"","description":"By default, the pre-merge and commit-msg hooks are run. When --no-verify is given, these are bypassed. See also githooks(5). Only useful when merging."},{"names":["--no-verify"],"argument":"","description":"By default, the pre-merge and commit-msg hooks are run. When --no-verify is given, these are bypassed. See also githooks(5). Only useful when merging."},{"names":["-s","--strategy"],"argument":"<strategy>","description":"Use the given merge strategy; can be supplied more than once to specify them in the order they should be tried. If there is no -s option, a built-in list of strategies is used instead (ort when merging a single head, octopus otherwise)."},{"names":["-X","--strategy-option"],"argument":"<option>","description":"Pass merge strategy specific option through to the merge strategy."},{"names":["--verify-signatures","--no-verify-signatures"],"argument":"","description":"Verify that the tip commit of the side branch being merged is signed with a valid key, i.e. a key that has a valid uid: in the default trust model, this means the signing key has been signed by a trusted key. If the tip commit of the side branch is not signed with a valid key, the merge is aborted."},{"names":["--summary","--no-summary"],"argument":"","description":"Synonyms to --stat and --no-stat; these are deprecated and will be removed in the future."},{"names":["--autostash","--no-autostash"],"argument":"","description":"Automatically create a temporary stash entry before the operation begins, record it in the special ref MERGE_AUTOSTASH and apply it after the operation ends. This means that you can run the operation on a dirty worktree. However, use with care: the final stash application after a successful merge might result in non-trivial conflicts."},{"names":["--allow-unrelated-histories"],"argument":"","description":"By default, git merge command refuses to merge histories that do not share a common ancestor. This option can be used to override this safety when merging histories of two projects that started their lives independently. As that is a very rare occasion, no configuration variable to enable this by default exists and will not be added."},{"names":["-r","--rebase"],"argument":"[=false|true|merges|interactive]","description":"When true, rebase the current branch on top of the upstream branch after fetching. If there is a remote-tracking branch corresponding to the upstream branch and the upstream branch was rebased since last fetched, the rebase uses that information to avoid rebasing non-local changes."},{"names":["--no-rebase"],"argument":"","description":"This is shorthand for --rebase=false."},{"names":["--all"],"argument":"","description":"Fetch all remotes."},{"names":["-a","--append"],"argument":"","description":"Append ref names and object names of fetched refs to the existing contents of .git/FETCH_HEAD. Without this option old data in .git/FETCH_HEAD will be overwritten."},{"names":["--atomic"],"argument":"","description":"Use an atomic transaction to update local refs. Either all refs are updated, or on error, no refs are updated."},{"names":["--depth"],"argument":"<depth>","description":"Limit fetching to the specified number of commits from the tip of each remote branch history. If fetching to a shallow repository created by git clone with --depth=<depth> option (see git-clone(1)), deepen or shorten the history to the specified number of commits. Tags for the deepened commits are not fetched."},{"names":["--deepen"],"argument":"<depth>","description":"Similar to --depth, except it specifies the number of commits from the current shallow boundary instead of from the tip of each remote branch history."},{"names":["--shallow-since"],"argument":"<date>","description":"Deepen or shorten the history of a shallow repository to include all reachable commits after <date>."},{"names":["--shallow-exclude"],"argument":"<revision>","description":"Deepen or shorten the history of a shallow repository to exclude commits reachable from a specified remote branch or tag. This option can be specified multiple times."},{"names":["--unshallow"],"argument":"","description":"If the source repository is complete, convert a shallow repository to a complete one, removing all the limitations imposed by shallow repositories."},{"names":["--update-shallow"],"argument":"","description":"By default when fetching from a shallow repository, git fetch refuses refs that require updating .git/shallow. This option updates .git/shallow and accept such refs."},{"names":["--negotiation-tip"],"argument":"<commit|glob>","description":"By default, Git will report, to the server, commits reachable from all local refs to find common commits in an attempt to reduce the size of the to-be-received packfile. If specified, Git will only report commits reachable from the given tips. This is useful to speed up fetches when the user knows which local ref is likely to have commits in common with the upstream ref being fetched."},{"names":["--negotiate-only"],"argument":"","description":"Do not fetch anything from the server, and instead print the ancestors of the provided --negotiation-tip=* arguments, which we have in common with the server."},{"names":["--dry-run"],"argument":"","description":"Show what would be done, without making any changes."},{"names":["-f","--force"],"argument":"","description":"When git fetch is used with <src>:<dst> refspec it may refuse to update the local branch as discussed in the <refspec> part of the git-fetch(1) documentation. This option overrides that check."},{"names":["-k","--keep"],"argument":"","description":"Keep downloaded pack."},{"names":["--prefetch"],"argument":"","description":"Modify the configured refspec to place all refs into the refs/prefetch/ namespace. See the prefetch task in git-maintenance(1)."},{"names":["-p","--prune"],"argument":"","description":"Before fetching, remove any remote-tracking references that no longer exist on the remote. Tags are not subject to pruning if they are fetched only because of the default tag auto-following or due to a --tags option. However, if tags are fetched due to an explicit refspec (either on the command line or in the remote configuration, for example if the remote was cloned with the --mirror option), then they are also subject to pruning. Supplying --prune-tags is a shorthand for providing the tag refspec."},{"names":["--no-tags"],"argument":"","description":"By default, tags that point at objects that are downloaded from the remote repository are fetched and stored locally. This option disables this automatic tag following. The default behavior for a remote may be specified with the remote.<name>.tagOpt setting. See git-config(1)."},{"names":["--refmap"],"argument":"<refspec>","description":"When fetching refs listed on the command line, use the specified refspec (can be given more than once) to map the refs to remote-tracking branches, instead of the values of remote.*.fetch configuration variables for the remote repository. Providing an empty <refspec> to the --refmap option causes Git to ignore the configured refspecs and rely entirely on the refspecs supplied as command-line arguments. See section on \"Configured Remote-tracking Branches\" for details."},{"names":["-t","--tags"],"argument":"","description":"Fetch all tags from the remote (i.e., fetch remote tags refs/tags/* into local tags with the same name), in addition to whatever else would otherwise be fetched. Using this option alone does not subject tags to pruning, even if --prune is used (though tags may be pruned anyway if they are also the destination of an explicit refspec; see --prune)."},{"names":["-j","--jobs"],"argument":"<n>","description":"Number of parallel children to be used for all forms of fetching."},{"names":["--set-upstream"],"argument":"","description":"If the remote is fetched successfully, add upstream (tracking) reference, used by argument-less git-pull(1) and other commands. For more information, see branch.<name>.merge and branch.<name>.remote in git-config(1)."},{"names":["--upload-pack"],"argument":"<upload-pack>","description":"When given, and the repository to fetch from is handled by git fetch-pack, --exec=<upload-pack> is passed to the command to specify non-default path for the command run on the other end."},{"names":["--progress"],"argument":"","description":"Progress status is reported on the standard error stream by default when it is attached to a terminal, unless -q is specified. This flag forces progress status even if the standard error stream is not directed to a terminal."},{"names":["-o","--server-option"],"argument":"<option>","description":"Transmit the given string to the server when communicating using protocol version 2. The given string must not contain a NUL or LF character. The server’s handling of server options, including unknown ones, is server-specific. When multiple --server-option=<option> are given, they are all sent to the other side in the order listed on the command line."},{"names":["--show-forced-updates"],"argument":"","description":"By default, git checks if a branch is force-updated during fetch. This can be disabled through fetch.showForcedUpdates, but the --show-forced-updates option guarantees this check occurs. See git-config(1)."},{"names":["--no-show-forced-updates"],"argument":"","description":"By default, git checks if a branch is force-updated during fetch. Pass --no-show-forced-updates or set fetch.showForcedUpdates to false to skip this check for performance reasons. If used during git-pull the --ff-only option will still check for forced updates before attempting a fast-forward update. See git-config(1)."},{"names":["-4","--ipv4"],"argument":"","description":"Use IPv4 addresses only, ignoring IPv6 addresses."},{"names":["-6","--ipv6"],"argument":"","description":"Use IPv6 addresses only, ignoring IPv4 addresses."}]},{"name":"push","description":"Update remote refs along with associated objects","options":[{"names":["--all"],"argument":"","description":"Push all branches (i.e. refs under refs/heads/); cannot be used with other <refspec>."},{"names":["--prune"],"argument":"","description":"Remove remote branches that don’t have a local counterpart. For example a remote branch tmp will be removed if a local branch with the same name doesn’t exist any more. This also respects refspecs, e.g. git push --prune remote refs/heads/*:refs/tmp/* would make sure that remote refs/tmp/foo will be removed if refs/heads/foo doesn’t exist."},{"names":["--mirror"],"argument":"","description":"Instead of naming each ref to push, specifies that all refs under refs/ (which includes but is not limited to refs/heads/, refs/remotes/, and refs/tags/) be mirrored to the remote repository. Newly created local refs will be pushed to the remote end, locally updated refs will be force updated on the remote end, and deleted refs will be removed from the remote end. This is the default if the configuration option remote.<remote>.mirror is set."},{"names":["-n","--dry-run"],"argument":"","description":"Do everything except actually send the updates."},{"names":["--porcelain"],"argument":"","description":"Produce machine-readable output. The output status line for each ref will be tab-separated and sent to stdout instead of stderr. The full symbolic names of the refs will be given."},{"names":["-d","--delete"],"argument":"","description":"All listed refs are deleted from the remote repository. This is the same as prefixing all refs with a colon."},{"names":["--tags"],"argument":"","description":"All refs under refs/tags are pushed, in addition to refspecs explicitly listed on the command line."},{"names":["--follow-tags"],"argument":"","description":"Push all the refs that would be pushed without this option, and also push annotated tags in refs/tags that are missing from the remote but are pointing at commit-ish that are reachable from the refs being pushed. This can also be specified with configuration variable push.followTags. For more information, see push.followTags in git-config(1)."},{"names":["--signed"],"argument":"(true|false|if-asked)","description":"GPG-sign the push request to update refs on the receiving side, to allow it to be checked by the hooks and/or be logged. If false or --no-signed, no signing will be attempted. If true or --signed, the push will fail if the server does not support signed pushes. If set to if-asked, sign if and only if the server supports signed pushes. The push will also fail if the actual call to gpg --sign fails. See git-receive-pack(1) for the details on the receiving end."},{"names":["--no-signed","--signed"],"argument":"(true|false|if-asked)","description":"GPG-sign the push request to update refs on the receiving side, to allow it to be checked by the hooks and/or be logged. If false or --no-signed, no signing will be attempted. If true or --signed, the push will fail if the server does not support signed pushes. If set to if-asked, sign if and only if the server supports signed pushes. The push will also fail if the actual call to gpg --sign fails. See git-receive-pack(1) for the details on the receiving end."},{"names":["--atomic"],"argument":"","description":"Use an atomic transaction on the remote side if available. Either all refs are updated, or on error, no refs are updated. If the server does not support atomic pushes the push will fail."},{"names":["--no-atomic"],"argument":"","description":"Use an atomic transaction on the remote side if available. Either all refs are updated, or on error, no refs are updated. If the server does not support atomic pushes the push will fail."},{"names":["-o","--push-option"],"argument":"<option>","description":"Transmit the given string to the server, which passes them to the pre-receive as well as the post-receive hook. The given string must not contain a NUL or LF character. When multiple --push-option=<option> are given, they are all sent to the other side in the order listed on the command line. When no --push-option=<option> is given from the command line, the values of configuration variable push.pushOption are used instead."},{"names":["--receive-pack","--exec"],"argument":"<git-receive-pack>","description":"Path to the git-receive-pack program on the remote end. Sometimes useful when pushing to a remote repository over ssh, and you do not have the program in a directory on the default $PATH."},{"names":["--force-with-lease"],"argument":"<refname>","description":"Usually, \"git push\" refuses to update a remote ref that is not an ancestor of the local ref used to overwrite it."},{"names":["--no-force-with-lease","--force-with-lease"],"argument":"<refname>","description":"Usually, \"git push\" refuses to update a remote ref that is not an ancestor of the local ref used to overwrite it."},{"names":["-f","--force"],"argument":"","description":"Usually, the command refuses to update a remote ref that is not an ancestor of the local ref used to overwrite it. Also, when --force-with-lease option is used, the command refuses to update a remote ref whose current value does not match what is expected."},{"names":["--force-if-includes"],"argument":"","description":"Force an update only if the tip of the remote-tracking ref has been integrated locally."},{"names":["--no-force-if-includes"],"argument":"","description":"Force an update only if the tip of the remote-tracking ref has been integrated locally."},{"names":["--repo"],"argument":"<repository>","description":"This option is equivalent to the <repository> argument. If both are specified, the command-line argument takes precedence."},{"names":["-u","--set-upstream"],"argument":"","description":"For every branch that is up to date or successfully pushed, add upstream (tracking) reference, used by argument-less git-pull(1) and other commands. For more information, see branch.<name>.merge in git-config(1)."},{"names":["--thin"],"argument":"","description":"These options are passed to git-send-pack(1). A thin transfer significantly reduces the amount of sent data when the sender and receiver share many of the same objects in common. The default is --thin."},{"names":["--no-thin"],"argument":"","description":"These options are passed to git-send-pack(1). A thin transfer significantly reduces the amount of sent data when the sender and receiver share many of the same objects in common. The default is --thin."},{"names":["-q","--quiet"],"argument":"","description":"Suppress all output, including the listing of updated refs, unless an error occurs. Progress is not reported to the standard error stream."},{"names":["-v","--verbose"],"argument":"","description":"Run verbosely."},{"names":["--progress"],"argument":"","description":"Progress status is reported on the standard error stream by default when it is attached to a terminal, unless -q is specified. This flag forces progress status even if the standard error stream is not directed to a terminal."},{"names":["--no-recurse-submodules","--recurse-submodules"],"argument":"check|on-demand|only|no","description":"May be used to make sure all submodule commits used by the revisions to be pushed are available on a remote-tracking branch. If check is used Git will verify that all submodule commits that changed in the revisions to be pushed are available on at least one remote of the submodule. If any commits are missing the push will be aborted and exit with non-zero status. If on-demand is used all submodules that changed in the revisions to be pushed will be pushed. If on-demand was not able to push all necessary revisions it will also be aborted and exit with non-zero status. If only is used all submodules will be recursively pushed while the superproject is left unpushed. A value of no or using --no-recurse-submodules can be used to override the push.recurseSubmodules configuration variable when no submodule recursion is required."},{"names":["--verify"],"argument":"","description":"Toggle the pre-push hook (see githooks(5)). The default is --verify, giving the hook a chance to prevent the push. With --no-verify, the hook is bypassed completely."},{"names":["--no-verify"],"argument":"","description":"Toggle the pre-push hook (see githooks(5)). The default is --verify, giving the hook a chance to prevent the push. With --no-verify, the hook is bypassed completely."},{"names":["-4","--ipv4"],"argument":"","description":"Use IPv4 addresses only, ignoring IPv6 addresses."},{"names":["-6","--ipv6"],"argument":"","description":"Use IPv6 addresses only, ignoring IPv4 addresses."}]}]}
