{"name":"hyperfine","description":"hyperfine","usage":"hyperfine [OPTIONS] <command>...","options":[{"names":["-w","--warmup"],"argument":"<NUM>","description":"Perform NUM warmup runs before the actual benchmark. This can be used to fill (disk) caches for I/O-heavy programs."},{"names":["-m","--min-runs"],"argument":"<NUM>","description":"Perform at least NUM runs for each command (default: 10)."},{"names":["-M","--max-runs"],"argument":"<NUM>","description":"Perform at most NUM runs for each command. By default, there is no limit."},{"names":["-r","--runs"],"argument":"<NUM>","description":"Perform exactly NUM runs for each command. If this option is not specified, hyperfine automatically determines the number of runs."},{"names":["-s","--setup"],"argument":"<CMD>","description":"Execute CMD before each set of timing runs. This is useful for compiling your software with the provided parameters, or to do any other work that should happen once before a series of benchmark runs, not every time as would happen with the --prepare option."},{"names":["-p","--prepare"],"argument":"<CMD>","description":"Execute CMD before each timing run. This is useful for clearing disk caches, for example. The --prepare option can be specified once for all commands or multiple times, once for each command. In the latter case, each preparation command will be run prior to the corresponding benchmark command."},{"names":["-c","--cleanup"],"argument":"<CMD>","description":"Execute CMD after the completion of all benchmarking runs for each individual command to be benchmarked. This is useful if the commands to be benchmarked produce artifacts that need to be cleaned up."},{"names":["-P","--parameter-scan"],"argument":"<VAR> <MIN> <MAX>","description":"Perform benchmark runs for each value in the range MIN..MAX. Replaces the string '{VAR}' in each command by the current parameter value."},{"names":["-D","--parameter-step-size"],"argument":"<DELTA>","description":"This argument requires --parameter-scan to be specified as well. Traverse the range MIN..MAX in steps of DELTA."},{"names":["-L","--parameter-list"],"argument":"<VAR> <VALUES>","description":"Perform benchmark runs for each value in the comma-separated list VALUES. Replaces the string '{VAR}' in each command by the current parameter value."},{"names":["--style"],"argument":"<TYPE>","description":"Set output style type (default: auto). Set this to 'basic' to disable output coloring and interactive elements. Set it to 'full' to enable all effects even if no interactive terminal was detected. Set this to 'nocolor' to keep the interactive output without any colors. Set this to 'color' to keep the colors without any interactive output. Set this to 'none' to disable all the output of the tool."},{"names":["-S","--shell"],"argument":"<SHELL>","description":"Set the shell to use for executing benchmarked commands. This can be the name or the path to the shell executable, or a full command line like \"bash --norc\". It can also be set to \"default\" to explicitly select the default shell on this platform. Finally, this can also be set to \"none\" to disable the shell. In this case, commands will be executed directly. They can still have arguments, but more complex things like \"sleep 0.1; sleep 0.2\" are not possible without a shell."},{"names":["-N"],"argument":"","description":"An alias for '--shell=none'."},{"names":["-i","--ignore-failure"],"argument":"","description":"Ignore non-zero exit codes of the benchmarked programs."},{"names":["-u","--time-unit"],"argument":"<UNIT>","description":"Set the time unit to be used. Possible values: millisecond, second. If the option is not given, the time unit is determined automatically. This option affects the standard output as well as all export formats except for CSV and JSON."},{"names":["--export-asciidoc"],"argument":"<FILE>","description":"Export the timing summary statistics as an AsciiDoc table to the given FILE. The output time unit can be changed using the --time-unit option."},{"names":["--export-csv"],"argument":"<FILE>","description":"Export the timing summary statistics as CSV to the given FILE. If you need the timing results for each individual run, use the JSON export format. The output time unit is always seconds."},{"names":["--export-json"],"argument":"<FILE>","description":"Export the timing summary statistics and timings of individual runs as JSON to the given FILE. The output time unit is always seconds"},{"names":["--export-markdown"],"argument":"<FILE>","description":"Export the timing summary statistics as a Markdown table to the given FILE. The output time unit can be changed using the --time-unit option."},{"names":["--export-orgmode"],"argument":"<FILE>","description":"Export the timing summary statistics as a Emacs org-mode table to the given FILE. The output time unit can be changed using the --time-unit option."},{"names":["--show-output"],"argument":"","description":"Print the stdout and stderr of the benchmark instead of suppressing it. This will increase the time it takes for benchmarks to run, so it should only be used for debugging purposes or when trying to benchmark output speed."},{"names":["--output"],"argument":"<WHERE>","description":"Control where the output of the benchmark is redirected. <WHERE> can be:"},{"names":["-n","--command-name"],"argument":"<NAME>","description":"Give a meaningful name to a command. This can be specified multiple times if several commands are benchmarked."},{"names":["-h","--help"],"argument":"","description":"Print help information"},{"names":["-V","--version"],"argument":"","description":"Print version information"}],"version":"hyperfine 1.15.0","tldr":"> A command-line benchmarking tool.\n> More information: <https://github.com/sharkdp/hyperfine/>.\n\n- Run a basic benchmark, performing at least 10 runs:\n\n`hyperfine '{{make}}'`\n\n- Run a comparative benchmark:\n\n`hyperfine '{{make target1}}' '{{make target2}}'`\n\n- Change minimum number of benchmarking runs:\n\n`hyperfine --min-runs {{7}} '{{make}}'`\n\n- Perform benchmark with warmup:\n\n`hyperfine --warmup {{5}} '{{make}}'`\n\n- Run a command before each benchmark run (to clear caches, etc.):\n\n`hyperfine --prepare '{{make clean}}' '{{make}}'`\n\n- Run a benchmark where a single parameter changes for each run:\n\n`hyperfine --prepare '{{make clean}}' --parameter-scan {{num_threads}} {{1}} {{10}} '{{make -j {num_threads}}}'`\n"}
