{
  "name": "nc",
  "description": "arbitrary TCP and UDP connections and listens",
  "options": [
    {
      "names": [
        "-4"
      ],
      "argument": "",
      "description": "Use IPv4 addresses only."
    },
    {
      "names": [
        "-6"
      ],
      "argument": "",
      "description": "Use IPv6 addresses only."
    },
    {
      "names": [
        "-b"
      ],
      "argument": "",
      "description": "Allow broadcast."
    },
    {
      "names": [
        "-C"
      ],
      "argument": "",
      "description": "Send CRLF as line-ending.  Each line feed (LF) character from the input data is translated into CR+LF before being written to the socket.  Line feed characters that are already preceded with a carriage return (CR) are not translated.  Received data is not affected."
    },
    {
      "names": [
        "-D"
      ],
      "argument": "",
      "description": "Enable debugging on the socket."
    },
    {
      "names": [
        "-d"
      ],
      "argument": "",
      "description": "Do not attempt to read from stdin."
    },
    {
      "names": [
        "-F"
      ],
      "argument": "",
      "description": "Pass the first connected socket using sendmsg(2) to stdout and exit.  This is useful in conjunction with -X to have nc perform connection setup with a proxy but then leave the rest of the connection to another program (e.g. ssh(1) using the ssh_config(5) ProxyUseFdpass option).  Cannot be used with -U."
    },
    {
      "names": [
        "-h"
      ],
      "argument": "",
      "description": "Print out the nc help text and exit."
    },
    {
      "names": [
        "-I"
      ],
      "argument": "length",
      "description": "Specify the size of the TCP receive buffer."
    },
    {
      "names": [
        "-i"
      ],
      "argument": "interval",
      "description": "Sleep for interval seconds between lines of text sent and received.  Also causes a delay time between connections to multiple ports."
    },
    {
      "names": [
        "-k"
      ],
      "argument": "",
      "description": "When a connection is completed, listen for another one.  Requires -l.  When used together with the -u option, the server socket is not connected and it can receive UDP datagrams from multiple hosts."
    },
    {
      "names": [
        "-l"
      ],
      "argument": "",
      "description": "Listen for an incoming connection rather than initiating a connection to a remote host.  The destination and port to listen on can be specified either as non-optional arguments, or with options -s and -p respectively.  Cannot be used together with -x or -z.  Additionally, any timeouts specified with the -w option are ignored."
    },
    {
      "names": [
        "-M"
      ],
      "argument": "ttl",
      "description": "Set the TTL / hop limit of outgoing packets."
    },
    {
      "names": [
        "-m"
      ],
      "argument": "minttl",
      "description": "Ask the kernel to drop incoming packets whose TTL / hop limit is under minttl."
    },
    {
      "names": [
        "-N"
      ],
      "argument": "",
      "description": "shutdown(2) the network socket after EOF on the input.  Some servers require this to finish their work."
    },
    {
      "names": [
        "-n"
      ],
      "argument": "",
      "description": "Do not do any DNS or service lookups on any specified addresses, hostnames or ports."
    },
    {
      "names": [
        "-O"
      ],
      "argument": "length",
      "description": "Specify the size of the TCP send buffer."
    },
    {
      "names": [
        "-P"
      ],
      "argument": "proxy_username",
      "description": "Specifies a username to present to a proxy server that requires authentication.  If no username is specified then authentication will not be attempted.  Proxy authentication is only supported for HTTP CONNECT proxies at present."
    },
    {
      "names": [
        "-p"
      ],
      "argument": "source_port",
      "description": "Specify the source port nc should use, subject to privilege restrictions and availability."
    },
    {
      "names": [
        "-q"
      ],
      "argument": "seconds",
      "description": "after EOF on stdin, wait the specified number of seconds and then quit. If seconds is negative, wait forever (default).  Specifying a non-negative seconds implies -N."
    },
    {
      "names": [
        "-r"
      ],
      "argument": "",
      "description": "Choose source and/or destination ports randomly instead of sequentially within a range or in the order that the system assigns them."
    },
    {
      "names": [
        "-S"
      ],
      "argument": "",
      "description": "Enable the RFC 2385 TCP MD5 signature option."
    },
    {
      "names": [
        "-s"
      ],
      "argument": "source",
      "description": "Send packets from the interface with the source IP address.  For UNIX-domain datagram sockets, specifies the local temporary socket file to create and use so that datagrams can be received.  Cannot be used together with -x."
    },
    {
      "names": [
        "-T"
      ],
      "argument": "keyword",
      "description": "Change the IPv4 TOS/IPv6 traffic class value.  keyword may be one of critical, inetcontrol, lowcost, lowdelay, netcontrol, throughput, reliability, or one of the DiffServ Code Points: ef, af11 ... af43, cs0 ... cs7; or a number in either hex or decimal."
    },
    {
      "names": [
        "-t"
      ],
      "argument": "",
      "description": "Send RFC 854 DON'T and WON'T responses to RFC 854 DO and WILL requests.  This makes it possible to use nc to script telnet sessions."
    },
    {
      "names": [
        "-U"
      ],
      "argument": "",
      "description": "Use UNIX-domain sockets.  Cannot be used together with -F or -x."
    },
    {
      "names": [
        "-u"
      ],
      "argument": "",
      "description": "Use UDP instead of TCP.  Cannot be used together with -x.  For UNIX-domain sockets, use a datagram socket instead of a stream socket.  If a UNIX-domain socket is used, a temporary receiving socket is created in /tmp unless the -s flag is given."
    },
    {
      "names": [
        "-V"
      ],
      "argument": "rtable",
      "description": "Set the routing table to be used."
    },
    {
      "names": [
        "-v"
      ],
      "argument": "",
      "description": "Produce more verbose output."
    },
    {
      "names": [
        "-W"
      ],
      "argument": "recvlimit",
      "description": "Terminate after receiving recvlimit packets from the network."
    },
    {
      "names": [
        "-w"
      ],
      "argument": "timeout",
      "description": "Connections which cannot be established or are idle timeout after timeout seconds.  The -w flag has no effect on the -l option, i.e. nc will listen forever for a connection, with or without the -w flag.  The default is no timeout."
    },
    {
      "names": [
        "-X"
      ],
      "argument": "proxy_protocol",
      "description": "Use proxy_protocol when talking to the proxy server.  Supported protocols are 4 (SOCKS v.4), 5 (SOCKS v.5) and connect (HTTPS proxy).  If the protocol is not specified, SOCKS version 5 is used."
    },
    {
      "names": [
        "-x"
      ],
      "argument": "proxy_address[:port]",
      "description": "Connect to destination using a proxy at proxy_address and port.  If port is not specified, the well-known port for the proxy protocol is used (1080 for SOCKS, 3128 for HTTPS).  An IPv6 address can be specified unambiguously by enclosing proxy_address in square brackets.  A proxy cannot be used with any of the options -lsuU."
    },
    {
      "names": [
        "-Z"
      ],
      "argument": "",
      "description": "DCCP mode."
    },
    {
      "names": [
        "-z"
      ],
      "argument": "",
      "description": "Only scan for listening daemons, without sending any data to them.  Cannot be used together with -l."
    }
  ]
}
