{"name":"passwd","description":"passwd","usage":"passwd [options] [LOGIN]","options":[{"names":["-a","--all"],"argument":"","description":"This option can be used only with -S and causes show status for all users."},{"names":["-d","--delete"],"argument":"","description":"Delete a user's password (make it empty). This is a quick way to disable a password for an account. It will set the named account passwordless."},{"names":["-e","--expire"],"argument":"","description":"Immediately expire an account's password. This in effect can force a user to change their password at the user's next login."},{"names":["-h","--help"],"argument":"","description":"Display help message and exit."},{"names":["-i","--inactive"],"argument":"INACTIVE","description":"This option is used to disable an account after the password has been expired for a number of days. After a user account has had an expired password for INACTIVE days, the user may no longer sign on to the account."},{"names":["-k","--keep-tokens"],"argument":"","description":"Indicate password change should be performed only for expired authentication tokens (passwords). The user wishes to keep their non-expired tokens as before."},{"names":["-l","--lock"],"argument":"","description":"Lock the password of the named account. This option disables a password by changing it to a value which matches no possible encrypted value (it adds a ´!´ at the beginning of the password)."},{"names":["-n","--mindays"],"argument":"MIN_DAYS","description":"Set the minimum number of days between password changes to MIN_DAYS. A value of zero for this field indicates that the user may change their password at any time."},{"names":["-q","--quiet"],"argument":"","description":"Quiet mode."},{"names":["-r","--repository"],"argument":"REPOSITORY","description":"change password in REPOSITORY repository"},{"names":["-R","--root"],"argument":"CHROOT_DIR","description":"Apply changes in the CHROOT_DIR directory and use the configuration files from the CHROOT_DIR directory."},{"names":["-S","--status"],"argument":"","description":"Display account status information. The status information consists of 7 fields. The first field is the user's login name. The second field indicates if the user account has a locked password (L), has no password (NP), or has a usable password (P). The third field gives the date of the last password change. The next four fields are the minimum age, maximum age, warning period, and inactivity period for the password. These ages are expressed in days."},{"names":["-u","--unlock"],"argument":"","description":"Unlock the password of the named account. This option re-enables a password by changing the password back to its previous value (to the value before using the -l option)."},{"names":["-w","--warndays"],"argument":"WARN_DAYS","description":"Set the number of days of warning before a password change is required. The WARN_DAYS option is the number of days prior to the password expiring that a user will be warned that their password is about to expire."},{"names":["-x","--maxdays"],"argument":"MAX_DAYS","description":"Set the maximum number of days a password remains valid. After MAX_DAYS, the password is required to be changed."}],"tldr":"> Passwd is a tool used to change a user's password.\n> More information: <https://manned.org/passwd>.\n\n- Change the password of the current user interactively:\n\n`passwd`\n\n- Change the password of a specific user:\n\n`passwd {{username}}`\n\n- Get the current status of the user:\n\n`passwd -S`\n\n- Make the password of the account blank (it will set the named account passwordless):\n\n`passwd -d`\n"}
