{"name":"set","description":"Set or unset values of shell options and positional parameters.","options":[{"names":["-a"],"argument":"","description":"Mark variables which are modified or created for export."},{"names":["-b"],"argument":"","description":"Notify of job termination immediately."},{"names":["-e"],"argument":"","description":"Exit immediately if a command exits with a non-zero status."},{"names":["-f"],"argument":"","description":"Disable file name generation (globbing)."},{"names":["-h"],"argument":"","description":"Remember the location of commands as they are looked up."},{"names":["-k"],"argument":"","description":"All assignment arguments are placed in the environment for a command, not just those that precede the command name."},{"names":["-m"],"argument":"","description":"Job control is enabled."},{"names":["-n"],"argument":"","description":"Read commands but do not execute them."},{"names":["-o"],"argument":"option-name","description":"Set the variable corresponding to option-name:"},{"names":["-p"],"argument":"","description":"Turned on whenever the real and effective user ids do not match. Disables processing of the $ENV file and importing of shell functions. Turning this option off causes the effective uid and gid to be set to the real uid and gid."},{"names":["-t"],"argument":"","description":"Exit after reading and executing one command."},{"names":["-u"],"argument":"","description":"Treat unset variables as an error when substituting."},{"names":["-v"],"argument":"","description":"Print shell input lines as they are read."},{"names":["-x"],"argument":"","description":"Print commands and their arguments as they are executed."},{"names":["-B"],"argument":"","description":"the shell will perform brace expansion"},{"names":["-C"],"argument":"","description":"If set, disallow existing regular files to be overwritten by redirection of output."},{"names":["-E"],"argument":"","description":"If set, the ERR trap is inherited by shell functions."},{"names":["-H"],"argument":"","description":"Enable ! style history substitution. This flag is on by default when the shell is interactive."},{"names":["-P"],"argument":"","description":"If set, do not resolve symbolic links when executing commands such as cd which change the current directory."},{"names":["-T"],"argument":"","description":"If set, the DEBUG and RETURN traps are inherited by shell functions."},{"names":["--"],"argument":"","description":"Assign any remaining arguments to the positional parameters. If there are no remaining arguments, the positional parameters are unset."},{"names":["-"],"argument":"","description":"Assign any remaining arguments to the positional parameters. The -x and -v options are turned off."}],"tldr":"> Display, set or unset values of shell attributes and positional parameters.\n> More information: <https://manned.org/set>.\n\n- Display the names and values of shell variables:\n\n`set`\n\n- Mark variables that are modified or created for export:\n\n`set -a`\n\n- Notify of job termination immediately:\n\n`set -b`\n\n- Set various options, e.g. enable `vi` style line editing:\n\n`set -o {{vi}}`\n\n- Set the shell to exit as soon as the first error is encountered (mostly used in scripts):\n\n`set -e`\n"}
