{"name":"tmux","description":"tmux","usage":"tmux [-2CDluvV] [-c shell-command] [-f file] [-L socket-name] [-S socket-path] [-T features] [command [flags]]","options":[{"names":["-2"],"argument":"","description":"Force tmux to assume the terminal supports 256 colours. This is equivalent to -T 256."},{"names":["-C"],"argument":"","description":"Start in control mode (see the CONTROL MODE section). Given twice (-CC) disables echo."},{"names":["-c"],"argument":"shell-command","description":"Execute shell-command using the default shell. If necessary, the tmux server will be started to retrieve the default-shell option. This option is for compatibility with sh(1) when tmux is used as a login shell."},{"names":["-D"],"argument":"","description":"Do not start the tmux server as a daemon. This also turns the exit-empty option off. With -D, command may not be specified."},{"names":["-f"],"argument":"file","description":"Specify an alternative configuration file. By default, tmux loads the system configuration file from @SYSCONFDIR@/tmux.conf, if present, then looks for a user configuration file at ~/.tmux.conf, $XDG_CONFIG_HOME/tmux/tmux.conf or ~/.config/tmux/tmux.conf."},{"names":["-L"],"argument":"socket-name","description":"tmux stores the server socket in a directory under TMUX_TMPDIR or /tmp if it is unset. The default socket is named default. This option allows a different socket name to be specified, allowing several independent tmux servers to be run. Unlike -S a full path is not necessary: the sockets are all created in a directory tmux-UID under the directory given by TMUX_TMPDIR or in /tmp. The tmux-UID directory is created by tmux and must not be world readable, writable or executable."},{"names":["-l"],"argument":"","description":"Behave as a login shell. This flag currently has no effect and is for compatibility with other shells when using tmux as a login shell."},{"names":["-N"],"argument":"","description":"Do not start the server even if the command would normally do so (for example new-session or start-server)."},{"names":["-S"],"argument":"socket-path","description":"Specify a full alternative path to the server socket. If -S is specified, the default socket directory is not used and any -L flag is ignored."},{"names":["-u"],"argument":"","description":"Write UTF-8 output to the terminal even if the first environment variable of LC_ALL, LC_CTYPE, or LANG that is set does not contain \"UTF-8\" or \"UTF8\". This is equivalent to -T UTF-8."},{"names":["-T"],"argument":"features","description":"Set terminal features for the client. This is a comma-separated list of features. See the terminal-features option."},{"names":["-v"],"argument":"","description":"Request verbose logging. Log messages will be saved into tmux-client-PID.log and tmux-server-PID.log files in the current directory, where PID is the PID of the server or client process. If -v is specified twice, an additional tmux-out-PID.log file is generated with a copy of everything tmux writes to the terminal."},{"names":["-V"],"argument":"","description":"Report the tmux version."}],"version":"tmux 3.3a","tldr":"> Terminal multiplexer. It allows multiple sessions with windows, panes, and more.\n> See also `zellij` and `screen`.\n> More information: <https://github.com/tmux/tmux>.\n\n- Start a new session:\n\n`tmux`\n\n- Start a new named session:\n\n`tmux new -s {{name}}`\n\n- List existing sessions:\n\n`tmux ls`\n\n- Attach to the most recently used session:\n\n`tmux attach`\n\n- Detach from the current session (inside a tmux session):\n\n`Ctrl-B d`\n\n- Create a new window (inside a tmux session):\n\n`Ctrl-B c`\n\n- Switch between sessions and windows (inside a tmux session):\n\n`Ctrl-B w`\n\n- Kill a session by name:\n\n`tmux kill-session -t {{name}}`\n"}
